STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
/**
  ******************************************************************************
  * @file    $PRODUCTNAME_LC$.h
  * @author  MCD Application Team
  * @brief   CMSIS $PRODUCTNAME_UC$ Device Peripheral Access Layer Header File.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral's registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#ifndef $PRODUCTNAME_UC$_H
#define $PRODUCTNAME_UC$_H

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup ST
  * @{
  */

/** @addtogroup $PRODUCTNAME_UC$
  * @{
  */

/** @addtogroup Configuration_of_CMSIS
  * @{
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define CPU_IN_SECURE_STATE
#endif

/* ================================================================================================================== */
/* ================                     Interrupt Number Definition                                  ================ */
/* ================================================================================================================== */
typedef enum
{
  /* ================================== ARM Cortex-M33 Specific Interrupt Numbers =================================== */
  NonMaskableInt_IRQn         = -14,    /*!< -14 Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn              = -13,    /*!< -13 Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn       = -12,    /*!< -12 Memory Management, MPU mismatch, including Access Violation and No
                                                 No Match                                                             */
  BusFault_IRQn               = -11,    /*!< -11 Bus Fault, Pre-Fetch, Memory Access Fault, other address/memory
                                                 related Fault                                                        */
  UsageFault_IRQn             = -10,    /*!< -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SecureFault_IRQn            = -9,     /*!< -9  Secure Fault                                                         */
  SVCall_IRQn                 = -5,     /*!< -5  System Service Call via SVC instruction                              */
  DebugMonitor_IRQn           = -4,     /*!< -4  Debug Monitor                                                        */
  PendSV_IRQn                 = -2,     /*!< -2  Pendable request for system service                                  */
  SysTick_IRQn                = -1,     /*!< -1  System Tick Timer                                                    */

  /* ================================== $PRODUCTNAME_UC$ Specific Interrupt Numbers ================================= */
  WWDG_IRQn                   = 0,      /*!< Window WatchDog interrupt                                                */
  PVD_PVM_IRQn                = 1,      /*!< PVD and PVM through EXTI Line detection Interrupt                        */
  RTC_IRQn                    = 2,      /*!< RTC non-secure interrupt                                                 */
  RTC_S_IRQn                  = 3,      /*!< RTC secure interrupt                                                     */
  TAMP_IRQn                   = 4,      /*!< Tamper global interrupt                                                  */
  RAMCFG_IRQn                 = 5,      /*!< RAMCFG global interrupt                                                  */
  FLASH_IRQn                  = 6,      /*!< FLASH non-secure global interrupt                                        */
  FLASH_S_IRQn                = 7,      /*!< FLASH secure global interrupt                                            */
  GTZC_IRQn                   = 8,      /*!< Global TrustZone Controller interrupt                                    */
  RCC_IRQn                    = 9,      /*!< RCC non secure global interrupt                                          */
  RCC_S_IRQn                  = 10,     /*!< RCC secure global interrupt                                              */
  EXTI0_IRQn                  = 11,     /*!< EXTI Line 0 interrupt                                                    */
  EXTI1_IRQn                  = 12,     /*!< EXTI Line 1 interrupt                                                    */
  EXTI2_IRQn                  = 13,     /*!< EXTI Line 2 interrupt                                                    */
  EXTI3_IRQn                  = 14,     /*!< EXTI Line 3 interrupt                                                    */
  EXTI4_IRQn                  = 15,     /*!< EXTI Line 4 interrupt                                                    */
  EXTI5_IRQn                  = 16,     /*!< EXTI Line 5 interrupt                                                    */
  EXTI6_IRQn                  = 17,     /*!< EXTI Line 6 interrupt                                                    */
  EXTI7_IRQn                  = 18,     /*!< EXTI Line 7 interrupt                                                    */
  EXTI8_IRQn                  = 19,     /*!< EXTI Line 8 interrupt                                                    */
  EXTI9_IRQn                  = 20,     /*!< EXTI Line 9 interrupt                                                    */
  EXTI10_IRQn                 = 21,     /*!< EXTI Line 10 interrupt                                                   */
  EXTI11_IRQn                 = 22,     /*!< EXTI Line 11 interrupt                                                   */
  EXTI12_IRQn                 = 23,     /*!< EXTI Line 12 interrupt                                                   */
  EXTI13_IRQn                 = 24,     /*!< EXTI Line 13 interrupt                                                   */
  EXTI14_IRQn                 = 25,     /*!< EXTI Line 14 interrupt                                                   */
  EXTI15_IRQn                 = 26,     /*!< EXTI Line 15 interrupt                                                   */
  IWDG_IRQn                   = 27,     /*!< IWDG global interrupt                                                    */
#if $U3_CRYPTO$ && !$U3_256K$
  SAES_IRQn                   = 28,     /*!< Secure AES global interrupt                                              */
#endif /*$U3_CRYPTO$ && !$U3_256K$*/
  GPDMA1_Channel0_IRQn        = 29,     /*!< GPDMA1 Channel 0 global interrupt                                        */
  GPDMA1_Channel1_IRQn        = 30,     /*!< GPDMA1 Channel 1 global interrupt                                        */
  GPDMA1_Channel2_IRQn        = 31,     /*!< GPDMA1 Channel 2 global interrupt                                        */
  GPDMA1_Channel3_IRQn        = 32,     /*!< GPDMA1 Channel 3 global interrupt                                        */
  GPDMA1_Channel4_IRQn        = 33,     /*!< GPDMA1 Channel 4 global interrupt                                        */
  GPDMA1_Channel5_IRQn        = 34,     /*!< GPDMA1 Channel 5 global interrupt                                        */
  GPDMA1_Channel6_IRQn        = 35,     /*!< GPDMA1 Channel 6 global interrupt                                        */
  GPDMA1_Channel7_IRQn        = 36,     /*!< GPDMA1 Channel 7 global interrupt                                        */
  ADC1_IRQn                   = 37,     /*!< ADC1 global interrupt                                                    */
  DAC1_IRQn                   = 38,     /*!< DAC1 global interrupt                                                    */
#if !$U3_512K$
  FDCAN1_IT0_IRQn             = 39,     /*!< FDCAN1 interrupt 0                                                       */
  FDCAN1_IT1_IRQn             = 40,     /*!< FDCAN1 interrupt 1                                                       */
#endif /* !$U3_512K$ */
  TIM1_BRK_TERR_IERR_IRQn     = 41,     /*!< TIM1 Break, Transition error and Index error interrupt                   */
  TIM1_UP_IRQn                = 42,     /*!< TIM1 Update interrupt                                                    */
  TIM1_TRG_COM_DIR_IDX_IRQn   = 43,     /*!< TIM1 Trigger, Commutation, Direction change and Index interrupt          */
  TIM1_CC_IRQn                = 44,     /*!< TIM1 Capture Compare interrupt                                           */
  TIM2_IRQn                   = 45,     /*!< TIM2 global interrupt                                                    */
  TIM3_IRQn                   = 46,     /*!< TIM3 global interrupt                                                    */
  TIM4_IRQn                   = 47,     /*!< TIM4 global interrupt                                                    */
  TIM6_IRQn                   = 49,     /*!< TIM6 global interrupt                                                    */
  TIM7_IRQn                   = 50,     /*!< TIM7 global interrupt                                                    */
#if $U3_2M$ || $U3_1M5$
  TIM12_IRQn                  = 51,     /*!< TIM12 global interrupt                                                   */
#endif /* $U3_2M$ && $U3_1M5$ */
  I3C1_EV_IRQn                = 53,     /*!< I3C1 event interrupt                                                     */
  I3C1_ER_IRQn                = 54,     /*!< I3C1 error interrupt                                                     */
  I2C1_EV_IRQn                = 55,     /*!< I2C1 Event interrupt                                                     */
  I2C1_ER_IRQn                = 56,     /*!< I2C1 Error interrupt                                                     */
#if !$U3_512K$ && !$U3_256K$
  I2C2_EV_IRQn                = 57,     /*!< I2C2 Event interrupt                                                     */
  I2C2_ER_IRQn                = 58,     /*!< I2C2 Error interrupt                                                     */
#endif /* !$U3_512K$ && !$U3_256K$ */
  SPI1_IRQn                   = 59,     /*!< SPI1 global interrupt                                                    */
  SPI2_IRQn                   = 60,     /*!< SPI2 global interrupt                                                    */
  USART1_IRQn                 = 61,     /*!< USART1 global interrupt                                                  */
#if $U3_2M$ || $U3_1M5$
  USART2_IRQn                 = 62,     /*!< USART2 global interrupt                                                  */
#endif /* $U3_2M$ && $U3_1M5$ */
  USART3_IRQn                 = 63,     /*!< USART3 global interrupt                                                  */
  UART4_IRQn                  = 64,     /*!< UART4 global interrupt                                                   */
#if !$U3_256K$
  UART5_IRQn                  = 65,     /*!< UART5 global interrupt                                                   */
#endif /*!$U3_256K$*/
  LPUART1_IRQn                = 66,     /*!< LPUART1 global interrupt                                                 */
  LPTIM1_IRQn                 = 67,     /*!< LPTIM1 global interrupt                                                  */
  LPTIM2_IRQn                 = 68,     /*!< LPTIM2 global interrupt                                                  */
  TIM15_IRQn                  = 69,     /*!< TIM15 global interrupt                                                   */
  TIM16_IRQn                  = 70,     /*!< TIM16 global interrupt                                                   */
  TIM17_IRQn                  = 71,     /*!< TIM17 global interrupt                                                   */
  COMP_IRQn                   = 72,     /*!< COMP1 and COMP2 through EXTI Lines interrupts                            */
  USB_FS_IRQn                 = 73,     /*!< USB FS global interrupt                                                  */
  CRS_IRQn                    = 74,     /*!< CRS global interrupt                                                     */
#if $U3_1M5$
  FMC_IRQn                    = 75,      /*!< FMC global interrupt                                                     */ 
#endif /*$U3_1M5$*/
  OCTOSPI1_IRQn               = 76,     /*!< OctoSPI1 global interrupt                                                */
#if $U3_2M$ || $U3_1M5$
  HSP1_IRQn                   = 77,     /*!< HSP1 global interrupt                                                    */
#endif /* $U3_2M$ || $U3_1M5$*/
#if !$U3_512K$ && !$U3_256K$
  SDMMC1_IRQn                 = 78,     /*!< SDMMC1 global interrupt                                                  */
#endif /* !$U3_512K$ && !$U3_256K$*/
  GPDMA1_Channel8_IRQn        = 80,     /*!< GPDMA1 Channel 8 global interrupt                                        */
  GPDMA1_Channel9_IRQn        = 81,     /*!< GPDMA1 Channel 9 global interrupt                                        */
  GPDMA1_Channel10_IRQn       = 82,     /*!< GPDMA1 Channel 10 global interrupt                                       */
  GPDMA1_Channel11_IRQn       = 83,     /*!< GPDMA1 Channel 11 global interrupt                                       */
  I2C3_EV_IRQn                = 88,     /*!< I2C3 event interrupt                                                     */
  I2C3_ER_IRQn                = 89,     /*!< I2C3 error interrupt                                                     */
#if !$U3_512K$ && !$U3_256K$
  SAI1_IRQn                   = 90,     /*!< Serial Audio Interface 1 global interrupt                                */
#endif /* !$U3_512K$ && !$U3_256K$*/
  TSC_IRQn                    = 92,     /*!< Touch Sense Controller global interrupt                                  */
#if $U3_CRYPTO$
  AES_IRQn                    = 93,     /*!< AES global interrupt                                                     */
#endif /* $U3_CRYPTO$ */
  RNG_IRQn                    = 94,     /*!< RNG global interrupt                                                     */
  FPU_IRQn                    = 95,     /*!< FPU global interrupt                                                     */
  HASH_IRQn                   = 96,     /*!< HASH global interrupt                                                    */
  #if !$U3_256K$
  PKA_IRQn                    = 97,     /*!< PKA global interrupt                                                     */
  #endif /*!$U3_256K$*/
  LPTIM3_IRQn                 = 98,     /*!< LPTIM3 global interrupt                                                  */
#if !$U3_256K$
  SPI3_IRQn                   = 99,     /*!< SPI3 global interrupt                                                    */
#endif /*!$U3_256K$*/
#if !$U3_512K$ && !$U3_256K$
  I3C2_EV_IRQn                = 100,    /*!< I3C2 Event interrupt                                                     */
  I3C2_ER_IRQn                = 101,    /*!< I3C2 Error interrupt                                                     */
#endif /* !$U3_512K$ && !$U3_256K$ */
#if $U3_2M$ || $U3_1M5$
  TIM8_BRK_TERR_IERR_IRQn     = 102,    /*!< TIM8 Break, Transition error and Index error interrupt                   */
  TIM8_UP_IRQn                = 103,    /*!< TIM8 Update interrupt                                                    */
  TIM8_TRG_COM_DIR_IDX_IRQn   = 104,    /*!< TIM8 Trigger, Commutation, Direction change and Index interrupt          */
  TIM8_CC_IRQn                = 105,    /*!< TIM8 Capture Compare interrupt                                           */
#endif /* $U3_2M$ || $U3_1M5$ */
  ICACHE_IRQn                 = 107,    /*!< Instruction cache global interrupt                                       */
#if $U3_1M5$
  GFXPAND1_IRQn               = 108,    /*!< GFXPAND1 global interrupt                                                */
#endif/*$U3_1M5$*/
#if $U3_LCD$
  LCD_IRQn                    = 109,    /*!< LCD global interrupt                                                     */
#endif /* $LCD$ */
  LPTIM4_IRQn                 = 110,    /*!< LPTIM4 global interrupt                                                  */
#if !$U3_512K$
  ADF1_IRQn                   = 112,    /*!< ADF1 interrupt                                                           */
#endif /* !$U3_512K$ */
#if !$U3_256K$
  ADC2_IRQn                   = 113,    /*!< ADC2 (12bits) global interrupt                                           */
#endif /*!$U3_256K$*/
#if $U3_2M$
  FDCAN2_IT0_IRQn             = 114,    /*!< FDCAN2 interrupt 0                                                       */
  FDCAN2_IT1_IRQn             = 115,    /*!< FDCAN2 interrupt 1                                                       */
  I2C4_EV_IRQn                = 116,    /*!< I2C4 Event interrupt                                                     */
  I2C4_ER_IRQn                = 117,    /*!< I2C4 Error interrupt                                                     */
#endif /* $U3_2M$ */
#if $U3_1M5$
  DMA2D_IRQn                  = 118,    /*!< DMA2D global interrupt                                                   */
#endif/*$U3_1M5$*/
#if $U3_2M$
  SPI4_IRQn                   = 119,    /*!< SPI4 global interrupt                                                    */
#endif /* $U3_2M$ */
#if $U3_1M5$
  OCTOSPI2_IRQn               = 120,    /* OCTOSPI global interrupt                                                   */
#endif/*$U3_1M5$*/ 
  PWR_IRQn                    = 123,    /*!< PWR non-secure interrupt                                                 */
  PWR_S_IRQn                  = 124     /*!< PWR secure interrupt                                                     */
} IRQn_Type;

