STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
/* ================================================================================================================== */
/* ================                     Processor and Core Peripheral Section                        ================ */
/* ================================================================================================================== */
/* -------  Start of section using anonymous unions and disabling warnings  ------- */
#if   defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/* --------  Configuration of the Cortex-M33 Processor and Core Peripherals  ------ */
#define __CM33_REV                      0x0000U   /* Core revision r0p4 */
#define __SAUREGION_PRESENT             1U        /* SAU regions present */
#define __MPU_PRESENT                   1U        /* MPU present */
#define __VTOR_PRESENT                  1U        /* VTOR present */
#define __NVIC_PRIO_BITS                4U        /* Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig          0U        /* Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT                   1U        /* FPU present */
#define __DSP_PRESENT                   1U        /* DSP extension present */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm33.h"                            /*!< ARM Cortex-M33 processor and core peripherals */
#include "system_stm32u3xx.h"                     /*!< STM32U3xx System */


/* ================================================================================================================== */
/* ================                     Device Specific Peripheral Section                           ================ */
/* ================================================================================================================== */
/** @addtogroup STM32U3xx_peripherals
  * @{
  */

/**
  * @brief ADC Analog to Digital Converter
  */
typedef struct
{
  __IO uint32_t ISR;              /*!< ADC interrupt and status register,                        Address offset: 0x00 */
  __IO uint32_t IER;              /*!< ADC interrupt enable register,                            Address offset: 0x04 */
  __IO uint32_t CR;               /*!< ADC control register,                                     Address offset: 0x08 */
  __IO uint32_t CFGR1;            /*!< ADC configuration register 1,                             Address offset: 0x0C */
  __IO uint32_t CFGR2;            /*!< ADC configuration register 2,                             Address offset: 0x10 */
  __IO uint32_t SMPR1;            /*!< ADC sample time register 1,                               Address offset: 0x14 */
  __IO uint32_t SMPR2;            /*!< ADC sample time register 2,                               Address offset: 0x18 */
  __IO uint32_t PCSEL;            /*!< ADC channel preselection register,                        Address offset: 0x1C */
  uint32_t      RESERVED1[4];     /*!< Reserved,                                                 Address offset: 0x20 */
  __IO uint32_t SQR1;             /*!< ADC regular sequence register 1,                          Address offset: 0x30 */
  __IO uint32_t SQR2;             /*!< ADC regular sequence register 2,                          Address offset: 0x34 */
  __IO uint32_t SQR3;             /*!< ADC regular sequence register 3,                          Address offset: 0x38 */
  __IO uint32_t SQR4;             /*!< ADC regular sequence register 4,                          Address offset: 0x3C */
  __IO uint32_t DR;               /*!< ADC regular data register,                                Address offset: 0x40 */
  uint32_t      RESERVED2[2];     /*!< Reserved,                                                 Address offset: 0x44 */
  __IO uint32_t JSQR;             /*!< ADC injected sequence register,                           Address offset: 0x4C */
  __IO uint32_t OFCFGR1;          /*!< ADC offset configuration register 1,                      Address offset: 0x50 */
  __IO uint32_t OFCFGR2;          /*!< ADC offset configuration register 2,                      Address offset: 0x54 */
  __IO uint32_t OFCFGR3;          /*!< ADC offset configuration register 3,                      Address offset: 0x58 */
  __IO uint32_t OFCFGR4;          /*!< ADC offset configuration register 4,                      Address offset: 0x5C */
  __IO uint32_t OFR1;             /*!< ADC offset register 1,                                    Address offset: 0x60 */
  __IO uint32_t OFR2;             /*!< ADC offset register 2,                                    Address offset: 0x64 */
  __IO uint32_t OFR3;             /*!< ADC offset register 3,                                    Address offset: 0x68 */
  __IO uint32_t OFR4;             /*!< ADC offset register 4,                                    Address offset: 0x6C */
  __IO uint32_t GCOMP;            /*!< ADC gain compensation register,                           Address offset: 0x70 */
  uint32_t      RESERVED3[3];     /*!< Reserved,                                                 Address offset: 0x74 */
  __IO uint32_t JDR1;             /*!< ADC injected data register 1,                             Address offset: 0x80 */
  __IO uint32_t JDR2;             /*!< ADC injected data register 2,                             Address offset: 0x84 */
  __IO uint32_t JDR3;             /*!< ADC injected data register 3,                             Address offset: 0x88 */
  __IO uint32_t JDR4;             /*!< ADC injected data register 4,                             Address offset: 0x8C */
  uint32_t      RESERVED4[4];     /*!< Reserved,                                                 Address offset: 0x90 */
  __IO uint32_t AWD2CR;           /*!< ADC analog watchdog 2 configuration register,             Address offset: 0xA0 */
  __IO uint32_t AWD3CR;           /*!< ADC analog watchdog 3 configuration register,             Address offset: 0xA4 */
  __IO uint32_t AWD1LTR;          /*!< ADC analog watchdog 1 low threshold register,             Address offset: 0xA8 */
  __IO uint32_t AWD1HTR;          /*!< ADC analog watchdog 1 high threshold register,            Address offset: 0xAC */
  __IO uint32_t AWD2LTR;          /*!< ADC analog watchdog 2 low threshold register,             Address offset: 0xB0 */
  __IO uint32_t AWD2HTR;          /*!< ADC analog watchdog 2 high threshold register,            Address offset: 0xB4 */
  __IO uint32_t AWD3LTR;          /*!< ADC analog watchdog 3 low threshold register,             Address offset: 0xB8 */
  __IO uint32_t AWD3HTR;          /*!< ADC analog watchdog 3 high threshold register,            Address offset: 0xBC */
       uint32_t RESERVED5;        /*!< Reserved,                                                 Address offset: 0xC0 */
  __IO uint32_t CALFACT;          /*!< ADC calibration factors,                                  Address offset: 0xC4 */
  uint32_t      RESERVED6[2];     /*!< Reserved,                                                 Address offset: 0xC8 */
  __IO uint32_t OR;               /*!< ADC option register,                                      Address offset: 0xD0 */
} ADC_TypeDef;

typedef struct
{
  __IO uint32_t CSR;              /*!< ADC common status register,                              Address offset: 0x300 */
  uint32_t RESERVED;              /*!< Reserved,                                                Address offset: 0x304 */
  __IO uint32_t CCR;              /*!< ADC common control register,                             Address offset: 0x308 */
  __IO uint32_t CDR;              /*!< ADC common regular data register for dual mode,          Address offset: 0x30C */
  __IO uint32_t CDR2;             /*!< ADC common regular data register for dual mode 32-bit,   Address offset: 0x310 */
} ADC_Common_TypeDef;

#if $U3_CRYPTO$
/**
  * @brief AES hardware accelerator
  */
typedef struct
{
  __IO uint32_t CR;               /*!< AES control register,                              Address offset: 0x00 */
  __IO uint32_t SR;               /*!< AES status register,                               Address offset: 0x04 */
  __IO uint32_t DINR;             /*!< AES data input register,                           Address offset: 0x08 */
  __IO uint32_t DOUTR;            /*!< AES data output register,                          Address offset: 0x0C */
  __IO uint32_t KEYR0;            /*!< AES key register 0,                                Address offset: 0x10 */
  __IO uint32_t KEYR1;            /*!< AES key register 1,                                Address offset: 0x14 */
  __IO uint32_t KEYR2;            /*!< AES key register 2,                                Address offset: 0x18 */
  __IO uint32_t KEYR3;            /*!< AES key register 3,                                Address offset: 0x1C */
  __IO uint32_t IVR0;             /*!< AES initialization vector register 0,              Address offset: 0x20 */
  __IO uint32_t IVR1;             /*!< AES initialization vector register 1,              Address offset: 0x24 */
  __IO uint32_t IVR2;             /*!< AES initialization vector register 2,              Address offset: 0x28 */
  __IO uint32_t IVR3;             /*!< AES initialization vector register 3,              Address offset: 0x2C */
  __IO uint32_t KEYR4;            /*!< AES key register 4,                                Address offset: 0x30 */
  __IO uint32_t KEYR5;            /*!< AES key register 5,                                Address offset: 0x34 */
  __IO uint32_t KEYR6;            /*!< AES key register 6,                                Address offset: 0x38 */
  __IO uint32_t KEYR7;            /*!< AES key register 7,                                Address offset: 0x3C */
  __IO uint32_t SUSP0R;           /*!< AES Suspend register 0,                            Address offset: 0x40 */
  __IO uint32_t SUSP1R;           /*!< AES Suspend register 1,                            Address offset: 0x44 */
  __IO uint32_t SUSP2R;           /*!< AES Suspend register 2,                            Address offset: 0x48 */
  __IO uint32_t SUSP3R;           /*!< AES Suspend register 3,                            Address offset: 0x4C */
  __IO uint32_t SUSP4R;           /*!< AES Suspend register 4,                            Address offset: 0x50 */
  __IO uint32_t SUSP5R;           /*!< AES Suspend register 5,                            Address offset: 0x54 */
  __IO uint32_t SUSP6R;           /*!< AES Suspend register 6,                            Address offset: 0x58 */
  __IO uint32_t SUSP7R;           /*!< AES Suspend register 7,                            Address offset: 0x5C */
       uint32_t RESERVED1[168];   /*!< Reserved,                                                 0x60 -- 0x2FC */
  __IO uint32_t IER;              /*!< AES Interrupt Enable Register,                    Address offset: 0x300 */
  __IO uint32_t ISR;              /*!< AES Interrupt Status Register,                    Address offset: 0x304 */
  __IO uint32_t ICR;              /*!< AES Interrupt Clear Register,                     Address offset: 0x308 */
} AES_TypeDef;

#if !$U3_256K$
/**
  * @brief  Coupling and chaining bridge (CCB)
  */
typedef struct
{
  __IO uint32_t CR;               /*!< CCB ccontrol register,                                   Address offset: 0x00 */
  __IO uint32_t SR;               /*!< CCB status register,                                     Address offset: 0x04 */
       uint32_t RESERVED1[2];     /*!< Reserved,                                                Address offset: 0x08 */
  __IO uint32_t REFTAGR[4];       /*!< CCB reference tag register,                              Address offset: 0x10 */
} CCB_TypeDef;
