STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
#if $U3_2M$
/**
  * @brief HSP
  */
typedef struct
{
  __IO uint32_t CR;             /*!< HSP control register                           Address offset: 0x00 */
       uint32_t RESERVED0[15];  /*!< Reserved                                       Address offset: 0x04 - 0x3C */
  __IO uint32_t C2HSEMR;        /*!< HSP CPU to HSP semaphore register              Address offset: 0x40 */
  __IO uint32_t C2HMSGDR;       /*!< HSP CPU to HSP message data register           Address offset: 0x44 */
  __IO uint32_t H2CSEMR;        /*!< HSP HSP to CPU semaphore register              Address offset: 0x48 */
  __IO uint32_t H2CMSGDR;       /*!< HSP HSP to CPU message data register           Address offset: 0x4C */
       uint32_t RESERVED1[2];   /*!< Reserved                                       Address offset: 0x50 - 0x54 */
  __IO uint32_t DCMDSR;         /*!< HSP DCMD Command status register               Address offset: 0x58 */
  __IO uint32_t DCMDPTSR;       /*!< HSP DCMD Pointer status register               Address offset: 0x5C */
  __IO uint32_t DCMDIDR;        /*!< HSP DCMD Command ID register                   Address offset: 0x60 */
  __IO uint32_t DCMDPTR0;       /*!< HSP DCMD address pointer register 0            Address offset: 0x64 */
  __IO uint32_t DCMDPTR1;       /*!< HSP DCMD address pointer register 1            Address offset: 0x68 */
  __IO uint32_t DCMDPTR2;       /*!< HSP DCMD address pointer register 2            Address offset: 0x6C */
       uint32_t RESERVED2[4];   /*!< Reserved                                       Address offset: 0x70 - 0x7C */
  __IO uint32_t EVTENR;         /*!< HSP event enable register                      Address offset: 0x80 */
  __IO uint32_t ESYNCENR;       /*!< HSP Event synchronization enable register      Address offset: 0x84 */
  __IO uint32_t ESYNC0SRCR;     /*!< HSP Event synchronization source register 0    Address offset: 0x88 */
  __IO uint32_t ESYNC1SRCR;     /*!< HSP Event synchronization source register 1    Address offset: 0x8C */
  __IO uint32_t ESYNC2SRCR;     /*!< HSP Event synchronization source register 2    Address offset: 0x90 */
       uint32_t RESERVED3;      /*!< Reserved                                       Address offset: 0x94 */
  __IO uint32_t PEVTLR;         /*!< HSP pending event level register               Address offset: 0x98 */
       uint32_t RESERVED4;      /*!< Reserved                                       Address offset: 0x9C */
  __IO uint32_t ITFENR;         /*!< HSP interfaces enable register                 Address offset: 0xA0 */
       uint32_t RESERVED5[4];   /*!< Reserved                                       Address offset: 0xA4 - 0xB0 */
  __IO uint32_t EVTSRC0R;       /*!< HSP Event source register 0                    Address offset: 0xB4 */
  __IO uint32_t EVTSRC1R;       /*!< HSP Event source register 1                    Address offset: 0xB8 */
  __IO uint32_t EVTSRC2R;       /*!< HSP Event source register 2                    Address offset: 0xBC */
       uint32_t RESERVED6[13];  /*!< Reserved                                       Address offset: 0xC0 - 0xF0 */
  __IO uint32_t BUFFCFGR;       /*!< HSP BUFF configuration register                Address offset: 0xF4 */
  __IO uint32_t BUFFDR[4];      /*!< HSP BUFF data register array                   Address offset: 0xF8 - 0x104 */
       uint32_t RESERVED7[6];   /*!< Reserved                                       Address offset: 0x108 - 0x11C */
  __IO uint32_t TRGINCFGR;      /*!< HSP TRGIN configuration register               Address offset: 0x120 */
  __IO uint32_t TRGOCFGR;       /*!< HSP TRGO configuration register                Address offset: 0x124 */
       uint32_t RESERVED8;      /*!< Reserved                                       Address offset: 0x128 */
  __IO uint32_t CSEGR;          /*!< HSP CPU shared event generator register        Address offset: 0x12C */
  __IO uint32_t CDEGR;          /*!< HSP CPU dedicated event generation register    Address offset: 0x130 */
       uint32_t RESERVED9[7];   /*!< Reserved                                       Address offset: 0x134 - 0x14C */
  __IO uint32_t TRGINSELR0;     /*!< HSP TRGIN input selection register 0           Address offset: 0x150 */
  __IO uint32_t TRGINSELR1;     /*!< HSP TRGIN input selection register 1           Address offset: 0x154 */
  __IO uint32_t TRGINSELR2;     /*!< HSP TRGIN input selection register 2           Address offset: 0x158 */
       uint32_t RESERVED10[3];  /*!< Reserved                                       Address offset: 0x15C - 0x164 */
  __IO uint32_t BKOCFGR[4];     /*!< HSP break output configuration register 0-3    Address offset: 0x168 - 0x174 */
  __IO uint32_t BKICFGR;        /*!< HSP break input configuration register         Address offset: 0x178 */
       uint32_t RESERVED11[3];  /*!< Reserved                                       Address offset: 0x17C - 0x184 */
  __IO uint32_t FWERR;          /*!< HSP firmware error register                    Address offset: 0x188 */
       uint32_t RESERVED12[2];  /*!< Reserved                                       Address offset: 0x18C - 0x190 */
  __IO uint32_t PARAMR0;        /*!< HSP parameter register 0                       Address offset: 0x194 */
  __IO uint32_t PARAMR1;        /*!< HSP parameter register 1                       Address offset: 0x198 */
  __IO uint32_t PARAMR2;        /*!< HSP parameter register 2                       Address offset: 0x19C */
  __IO uint32_t PARAMR3;        /*!< HSP parameter register 3                       Address offset: 0x1A0 */
  __IO uint32_t PARAMR4;        /*!< HSP parameter register 4                       Address offset: 0x1A4 */
  __IO uint32_t PARAMR5;        /*!< HSP parameter register 5                       Address offset: 0x1A8 */
  __IO uint32_t PARAMR6;        /*!< HSP parameter register 6                       Address offset: 0x1AC */
  __IO uint32_t PARAMR7;        /*!< HSP parameter register 7                       Address offset: 0x1B0 */
  __IO uint32_t PARAMR8;        /*!< HSP parameter register 8                       Address offset: 0x1B4 */
  __IO uint32_t PARAMR9;        /*!< HSP parameter register 9                       Address offset: 0x1B8 */
  __IO uint32_t PARAMR10;       /*!< HSP parameter register 10                      Address offset: 0x1BC */
  __IO uint32_t PARAMR11;       /*!< HSP parameter register 11                      Address offset: 0x1C0 */
  __IO uint32_t PARAMR12;       /*!< HSP parameter register 12                      Address offset: 0x1C4 */
  __IO uint32_t PARAMR13;       /*!< HSP parameter register 13                      Address offset: 0x1C8 */
  __IO uint32_t PARAMR14;       /*!< HSP parameter register 14                      Address offset: 0x1CC */
  __IO uint32_t PARAMR15;       /*!< HSP parameter register 15                      Address offset: 0x1D0 */
       uint32_t RESERVED13[43]; /*!< Reserved                                       Address offset: 0x1D4 - 0x27C */
  __IO uint32_t SPE_IER;        /*!< HSP SPE interrupt enable register              Address offset: 0x280 */
  __IO uint32_t SPE_ISR;        /*!< HSP SPE interrupt status register              Address offset: 0x284 */
       uint32_t RESERVED14[46]; /*!< Reserved                                       Address offset: 0x288 - 0x33C */
  __IO uint32_t TCUCFGR;        /*!< HSP task comparator unit register              Address offset: 0x340 */
  __IO uint32_t TOVLPCR;        /*!< HSP task overlap control register              Address offset: 0x344 */
       uint32_t RESERVED15[12]; /*!< Reserved                                       Address offset: 0x348 - 0x374 */
  __IO uint32_t SNPR;           /*!< HSP snoop register                             Address offset: 0x378 */
  __IO uint32_t CCNTR;          /*!< HSP conflict counter register                  Address offset: 0x37C */
  __IO uint32_t CAPDR;          /*!< HSP data capture register                      Address offset: 0x380 */
  __IO uint32_t CAPCR;          /*!< HSP capture control register                   Address offset: 0x384 */
       uint32_t RESERVED16[4];  /*!< Reserved                                       Address offset: 0x388 - 0x394 */
  __IO uint32_t ERR_IER;        /*!< HSP error interrupt enable register            Address offset: 0x398 */
  __IO uint32_t EVT_IER;        /*!< HSP events interrupt enable register           Address offset: 0x39C */
  __IO uint32_t PFCTEVT_IER;    /*!< HSP processing event interrupt enable register Address offset: 0x3A0 */
  __IO uint32_t ERR_ISR;        /*!< HSP error interrupt status register            Address offset: 0x3A4 */
  __IO uint32_t EVT_ISR;        /*!< HSP events interrupt status register           Address offset: 0x3A8 */
  __IO uint32_t PFCTEVT_ISR;    /*!< HSP processing event interrupt status register Address offset: 0x3AC */
  __IO uint32_t ERRINFR;        /*!< HSP error information register                 Address offset: 0x3B0 */
  __IO uint32_t ERR_ICR;        /*!< HSP error interrupt clear register             Address offset: 0x3B4 */
  __IO uint32_t EVT_ICR;        /*!< HSP events Interrupt clear register            Address offset: 0x3B8 */
  __IO uint32_t PFCTEVT_ICR;    /*!< HSP processing event interrupt clear register  Address offset: 0x3BC */
       uint32_t RESERVED17[7];  /*!< Reserved                                       Address offset: 0x3C0 - 0x3D8 */
  __IO uint32_t FWVERR;         /*!< HSP firmware versions register                 Address offset: 0x3DC */
}HSP_TypeDef;

#endif /* $U3_2M$ */
/**
  * @brief Inter-integrated Circuit Interface
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< I2C Control register 1,                  Address offset: 0x00 */
  __IO uint32_t CR2;              /*!< I2C Control register 2,                  Address offset: 0x04 */
  __IO uint32_t OAR1;             /*!< I2C Own address 1 register,              Address offset: 0x08 */
  __IO uint32_t OAR2;             /*!< I2C Own address 2 register,              Address offset: 0x0C */
  __IO uint32_t TIMINGR;          /*!< I2C Timing register,                     Address offset: 0x10 */
  __IO uint32_t TIMEOUTR;         /*!< I2C Timeout register,                    Address offset: 0x14 */
  __IO uint32_t ISR;              /*!< I2C Interrupt and status register,       Address offset: 0x18 */
  __IO uint32_t ICR;              /*!< I2C Interrupt clear register,            Address offset: 0x1C */
  __IO uint32_t PECR;             /*!< I2C PEC register,                        Address offset: 0x20 */
  __IO uint32_t RXDR;             /*!< I2C Receive data register,               Address offset: 0x24 */
  __IO uint32_t TXDR;             /*!< I2C Transmit data register,              Address offset: 0x28 */
  __IO uint32_t AUTOCR;           /*!< I2C Autonomous mode control register,    Address offset: 0x2C */
} I2C_TypeDef;

/**
  * @brief Improved Inter-integrated Circuit Interface
  */
typedef struct
{
  __IO uint32_t CR;             /*!< I3C Control register,                      Address offset: 0x00      */
  __IO uint32_t CFGR;           /*!< I3C Controller Configuration register,     Address offset: 0x04      */
  uint32_t      RESERVED1[2];   /*!< Reserved,                                  Address offset: 0x08-0x0C */
  __IO uint32_t RDR;            /*!< I3C Received Data register,                Address offset: 0x10      */
  __IO uint32_t RDWR;           /*!< I3C Received Data Word register,           Address offset: 0x14      */
  __IO uint32_t TDR;            /*!< I3C Transmit Data register,                Address offset: 0x18      */
  __IO uint32_t TDWR;           /*!< I3C Transmit Data Word register,           Address offset: 0x1C      */
  __IO uint32_t IBIDR;          /*!< I3C IBI payload Data register,             Address offset: 0x20      */
  __IO uint32_t TGTTDR;         /*!< I3C Target Transmit register,              Address offset: 0x24      */
  uint32_t      RESERVED2[2];   /*!< Reserved,                                  Address offset: 0x28-0x2C */
  __IO uint32_t SR;             /*!< I3C Status register,                       Address offset: 0x30      */
  __IO uint32_t SER;            /*!< I3C Status Error register,                 Address offset: 0x34      */
  uint32_t      RESERVED3[2];   /*!< Reserved,                                  Address offset: 0x38-0x3C */
  __IO uint32_t RMR;            /*!< I3C Received Message register,             Address offset: 0x40      */
  uint32_t      RESERVED4[3];   /*!< Reserved,                                  Address offset: 0x44-0x4C */
  __IO uint32_t EVR;            /*!< I3C Event register,                        Address offset: 0x50      */
  __IO uint32_t IER;            /*!< I3C Interrupt Enable register,             Address offset: 0x54      */
  __IO uint32_t CEVR;           /*!< I3C Clear Event register,                  Address offset: 0x58      */
  __IO uint32_t MISR;           /*!< I3C Masked Interrupt Status register,      Address offset: 0x5C      */
  __IO uint32_t DEVR0;          /*!< I3C own Target characteristics register,   Address offset: 0x60      */
  __IO uint32_t DEVRX[4];       /*!< I3C Target x (1<=x<=4) register,           Address offset: 0x64-0x70 */
  uint32_t      RESERVED6[7];   /*!< Reserved,                                  Address offset: 0x74-0x8C */
  __IO uint32_t MAXRLR;         /*!< I3C Maximum Read Length register,          Address offset: 0x90      */
  __IO uint32_t MAXWLR;         /*!< I3C Maximum Write Length register,         Address offset: 0x94      */
  uint32_t      RESERVED7[2];   /*!< Reserved,                                  Address offset: 0x98-0x9C */
  __IO uint32_t TIMINGR0;       /*!< I3C Timing 0 register,                     Address offset: 0xA0      */
  __IO uint32_t TIMINGR1;       /*!< I3C Timing 1 register,                     Address offset: 0xA4      */
  __IO uint32_t TIMINGR2;       /*!< I3C Timing 2 register,                     Address offset: 0xA8      */
  uint32_t      RESERVED9[5];   /*!< Reserved,                                  Address offset: 0xAC-0xBC */
  __IO uint32_t BCR;            /*!< I3C Bus Characteristics register,          Address offset: 0xC0      */
  __IO uint32_t DCR;            /*!< I3C Device Characteristics register,       Address offset: 0xC4      */
  __IO uint32_t GETCAPR;        /*!< I3C GET CAPabilities register,             Address offset: 0xC8      */
  __IO uint32_t CRCAPR;         /*!< I3C Controller CAPabilities register,      Address offset: 0xCC      */
  __IO uint32_t GETMXDSR;       /*!< I3C GET Max Data Speed register,           Address offset: 0xD0      */
  __IO uint32_t EPIDR;          /*!< I3C Extended Provisioned ID register,      Address offset: 0xD4      */
} I3C_TypeDef;

/**
  * @brief Instruction Cache
  */
typedef struct
{
  __IO uint32_t CR;               /*!< ICACHE control register,                Address offset: 0x00 */
  __IO uint32_t SR;               /*!< ICACHE status register,                 Address offset: 0x04 */
  __IO uint32_t IER;              /*!< ICACHE interrupt enable register,       Address offset: 0x08 */
  __IO uint32_t FCR;              /*!< ICACHE Flag clear register,             Address offset: 0x0C */
  __IO uint32_t HMONR;            /*!< ICACHE hit monitor register,            Address offset: 0x10 */
  __IO uint32_t MMONR;            /*!< ICACHE miss monitor register,           Address offset: 0x14 */
       uint32_t RESERVED1[2];     /*!< Reserved,                                        0x018-0x01C */
  __IO uint32_t CRR0;             /*!< ICACHE region 0 configuration register, Address offset: 0x20 */
  __IO uint32_t CRR1;             /*!< ICACHE region 1 configuration register, Address offset: 0x24 */
  __IO uint32_t CRR2;             /*!< ICACHE region 2 configuration register, Address offset: 0x28 */
  __IO uint32_t CRR3;             /*!< ICACHE region 3 configuration register, Address offset: 0x2C */
} ICACHE_TypeDef;

/**
  * @brief IWDG
  */
typedef struct
{
  __IO uint32_t KR;               /*!< IWDG Key register,          Address offset: 0x00 */
  __IO uint32_t PR;               /*!< IWDG Prescaler register,    Address offset: 0x04 */
  __IO uint32_t RLR;              /*!< IWDG Reload register,       Address offset: 0x08 */
  __IO uint32_t SR;               /*!< IWDG Status register,       Address offset: 0x0C */
  __IO uint32_t WINR;             /*!< IWDG Window register,       Address offset: 0x10 */
  __IO uint32_t EWCR;             /*!< IWDG Early Wakeup register, Address offset: 0x14 */
} IWDG_TypeDef;

#if $U3_LCD$
/**
  * @brief LCD
  */
typedef struct
{
  __IO uint32_t CR;          /*!< LCD control register,              Address offset: 0x00 */
  __IO uint32_t FCR;         /*!< LCD frame control register,        Address offset: 0x04 */
  __IO uint32_t SR;          /*!< LCD status register,               Address offset: 0x08 */
  __IO uint32_t CLR;         /*!< LCD clear register,                Address offset: 0x0C */
  uint32_t RESERVED;         /*!< Reserved,                          Address offset: 0x10 */
  __IO uint32_t RAM[16];     /*!< LCD display memory,           Address offset: 0x14-0x50 */
} LCD_TypeDef;
#endif /* $U3_LCD$ */

/**
  * @brief LPTIMER
  */
typedef struct
{
  __IO uint32_t ISR;              /*!< LPTIM Interrupt and Status register,    Address offset: 0x00 */
  __IO uint32_t ICR;              /*!< LPTIM Interrupt Clear register,         Address offset: 0x04 */
  __IO uint32_t DIER;             /*!< LPTIM Interrupt Enable register,        Address offset: 0x08 */
  __IO uint32_t CFGR;             /*!< LPTIM Configuration register,           Address offset: 0x0C */
  __IO uint32_t CR;               /*!< LPTIM Control register,                 Address offset: 0x10 */
  __IO uint32_t CCR1;             /*!< LPTIM Capture/Compare register 1,       Address offset: 0x14 */
  __IO uint32_t ARR;              /*!< LPTIM Autoreload register,              Address offset: 0x18 */
  __IO uint32_t CNT;              /*!< LPTIM Counter register,                 Address offset: 0x1C */
  __IO uint32_t RESERVED0;        /*!< Reserved,                               Address offset: 0x20 */
  __IO uint32_t CFGR2;            /*!< LPTIM Configuration register 2,         Address offset: 0x24 */
  __IO uint32_t RCR;              /*!< LPTIM Repetition register,              Address offset: 0x28 */
  __IO uint32_t CCMR1;            /*!< LPTIM Capture/Compare mode register,    Address offset: 0x2C */
  __IO uint32_t RESERVED1;        /*!< Reserved,                               Address offset: 0x30 */
  __IO uint32_t CCR2;             /*!< LPTIM Capture/Compare register 2,       Address offset: 0x34 */
} LPTIM_TypeDef;

/**
  * @brief MDF/ADF
  */
typedef struct
{
  __IO uint32_t GCR;              /*!< MDF Global Control register,            Address offset: 0x00  */
  __IO uint32_t CKGCR;            /*!< MDF Clock Generator Control Register,   Address offset: 0x04  */
 uint32_t       RESERVED0[6];     /*!< Reserved, 0x08-0x1C                                           */
  __IO uint32_t TRGISELR;         /*!< MDF Trigger Input Selection Register,   Address offset: 0x20  */
} MDF_TypeDef;

/**
  * @brief MDF/ADF filter
  */
typedef struct
{
 __IO uint32_t SITFCR;            /*!< MDF Serial Interface Control Register,          Address offset: 0x80 */
 __IO uint32_t BSMXCR;            /*!< MDF Bitstream Matrix Control Register,          Address offset: 0x84 */
 __IO uint32_t DFLTCR;            /*!< MDF Digital Filter Control Register,            Address offset: 0x88 */
 __IO uint32_t DFLTCICR;          /*!< MDF MCIC Configuration Register,                Address offset: 0x8C */
 __IO uint32_t DFLTRSFR;          /*!< MDF Reshape Filter Configuration Register,      Address offset: 0x90 */
 uint32_t      RESERVED0[4];      /*!< Reserved, 0x94-0xA0                                                  */
 __IO uint32_t DLYCR;             /*!< MDF Delay control Register,                     Address offset: 0xA4 */
 uint32_t      RESERVED1[1];      /*!< Reserved, 0xA8                                                       */
 __IO uint32_t DFLTIER;           /*!< MDF DFLT Interrupt enable Register,             Address offset: 0xAC */
 __IO uint32_t DFLTISR;           /*!< MDF DFLT Interrupt status Register,             Address offset: 0xB0 */
 uint32_t      RESERVED2[1];      /*!< Reserved, 0xB4                                                       */
 __IO uint32_t SADCR;             /*!< MDF SAD Control Register,                       Address offset: 0xB8 */
 __IO uint32_t SADCFGR;           /*!< MDF SAD configuration register,                 Address offset: 0xBC */
 __IO uint32_t SADSDLVR;          /*!< MDF SAD Sound level Register,                   Address offset: 0xC0 */
 __IO uint32_t SADANLVR;          /*!< MDF SAD Ambient Noise level Register,           Address offset: 0xC4 */
 uint32_t      RESERVED3[10];     /*!< Reserved, 0xC8-0xEC                                                  */
 __IO uint32_t DFLTDR;            /*!< MDF Digital Filter Data Register,               Address offset: 0xF0 */
} MDF_Filter_TypeDef;

/**
  * @brief Operational Amplifier (OPAMP)
  */
typedef struct
{
  __IO uint32_t CSR;              /*!< OPAMP control/status register,                     Address offset: 0x00 */
  __IO uint32_t OTR;              /*!< OPAMP offset trimming register for normal mode,    Address offset: 0x04 */
  __IO uint32_t LPOTR;            /*!< OPAMP offset trimming register for low power mode, Address offset: 0x08 */
} OPAMP_TypeDef;

typedef struct
{
  __IO uint32_t CSR;              /*!< OPAMP control/status register, used for bits common to
                                    several OPAMP instances, Address offset: 0x00         */
} OPAMP_Common_TypeDef;

#if !$U3_256K$
/**
  * @brief PKA
  */
typedef struct
{
  __IO uint32_t CR;               /*!< PKA control register,             Address offset: 0x00 */
  __IO uint32_t SR;               /*!< PKA status register,              Address offset: 0x04 */
  __IO uint32_t CLRFR;            /*!< PKA clear flag register,          Address offset: 0x08 */
  uint32_t Reserved[253];         /*!< Reserved memory area              Address offset: 0x0C  -> 0x03FC */
  __IO uint32_t RAM[1334];        /*!< PKA RAM                           Address offset: 0x400 -> 0x18D4 */
} PKA_TypeDef;

