STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
/*!< Peripheral memory map - secure */
#define APB1PERIPH_BASE_S               PERIPH_BASE_S
#define APB2PERIPH_BASE_S               (PERIPH_BASE_S + 0x00010000UL)
#define AHB1PERIPH_BASE_S               (PERIPH_BASE_S + 0x00020000UL)
#define APB3PERIPH_BASE_S               (PERIPH_BASE_S + 0x00040000UL)
#define AHB2PERIPH_BASE_S               (PERIPH_BASE_S + 0x02020000UL)

/*!< APB1 secure peripherals */
#define TIM2_BASE_S                     (APB1PERIPH_BASE_S + 0x00000000UL)
#define TIM3_BASE_S                     (APB1PERIPH_BASE_S + 0x00000400UL)
#define TIM4_BASE_S                     (APB1PERIPH_BASE_S + 0x00000800UL)
#define TIM6_BASE_S                     (APB1PERIPH_BASE_S + 0x00001000UL)
#define TIM7_BASE_S                     (APB1PERIPH_BASE_S + 0x00001400UL)
#if !$U3_256K$
#define SPI3_BASE_S                     (APB1PERIPH_BASE_S + 0x00002000UL)
#endif /*!$U3_256K$*/
#if $U3_2M$
#define SPI4_BASE_S                     (APB1PERIPH_BASE_S + 0x00002400UL)
#endif /* $U3_2M$ */
#define WWDG_BASE_S                     (APB1PERIPH_BASE_S + 0x00002C00UL)
#define IWDG_BASE_S                     (APB1PERIPH_BASE_S + 0x00003000UL)
#define SPI2_BASE_S                     (APB1PERIPH_BASE_S + 0x00003800UL)
#if $U3_2M$ || $U3_1M5$
#define USART2_BASE_S                   (APB1PERIPH_BASE_S + 0x00004400UL)
#endif /* $U3_2M$ || $U3_1M5$ */
#define USART3_BASE_S                   (APB1PERIPH_BASE_S + 0x00004800UL)
#define UART4_BASE_S                    (APB1PERIPH_BASE_S + 0x00004C00UL)
#if !$U3_256K$
#define UART5_BASE_S                    (APB1PERIPH_BASE_S + 0x00005000UL)
#endif /*!$U3_256K$*/
#define I2C1_BASE_S                     (APB1PERIPH_BASE_S + 0x00005400UL)
#if !$U3_512K$ && !$U3_256K$
#define I2C2_BASE_S                     (APB1PERIPH_BASE_S + 0x00005800UL)
#endif /* !$U3_512K$ && !$U3_256K$ */
#define I3C1_BASE_S                     (APB1PERIPH_BASE_S + 0x00005C00UL)
#define CRS_BASE_S                      (APB1PERIPH_BASE_S + 0x00006000UL)
#define OPAMP1_BASE_S                   (APB1PERIPH_BASE_S + 0x00007000UL)
#define OPAMP2_BASE_S                   (OPAMP1_BASE_S + 0x0000010UL)
#if !$U3_256K$
#define VREFBUF_BASE_S                  (APB1PERIPH_BASE_S + 0x00007400UL)
#endif /*!$U3_256K$*/
#define RTC_BASE_S                      (APB1PERIPH_BASE_S + 0x00007800UL)
#define TAMP_BASE_S                     (APB1PERIPH_BASE_S + 0x00007C00UL)
#if $U3_2M$
#define I2C4_BASE_S                     (APB1PERIPH_BASE_S + 0x00008400UL)
#endif /* $U3_2M$ */
#define LPTIM2_BASE_S                   (APB1PERIPH_BASE_S + 0x00009400UL)
#if !$U3_512K$
#define FDCAN1_BASE_S                   (APB1PERIPH_BASE_S + 0x0000A400UL)
#if $U3_2M$
#define FDCAN2_BASE_S                   (APB1PERIPH_BASE_S + 0x0000A800UL)
#endif /* $U3_2M$ */
#define FDCAN_CONFIG_BASE_S             (APB1PERIPH_BASE_S + 0x0000A500UL)
#define SRAMCAN_BASE_S                  (APB1PERIPH_BASE_S + 0x0000AC00UL)
#endif /* !$U3_512K$ */

/*!< APB2 secure peripherals */
#define TIM1_BASE_S                     (APB2PERIPH_BASE_S + 0x00002C00UL)
#define SPI1_BASE_S                     (APB2PERIPH_BASE_S + 0x00003000UL)
#if $U3_2M$ || $U3_1M5$
#define TIM8_BASE_S                     (APB2PERIPH_BASE_S + 0x00003400UL)
#endif /* $U3_2M$ || $U3_1M5$ */
#define USART1_BASE_S                   (APB2PERIPH_BASE_S + 0x00003800UL)
#if $U3_2M$ || $U3_1M5$
#define TIM12_BASE_S                    (APB2PERIPH_BASE_S + 0x00003C00UL)
#endif /* $U3_2M$ || $U3_1M5$ */
#define TIM15_BASE_S                    (APB2PERIPH_BASE_S + 0x00004000UL)
#define TIM16_BASE_S                    (APB2PERIPH_BASE_S + 0x00004400UL)
#define TIM17_BASE_S                    (APB2PERIPH_BASE_S + 0x00004800UL)
#if !$U3_512K$ && !$U3_256K$
#define SAI1_BASE_S                     (APB2PERIPH_BASE_S + 0x00005400UL)
#define SAI1_Block_A_BASE_S             (SAI1_BASE_S + 0x0000004UL)
#define SAI1_Block_B_BASE_S             (SAI1_BASE_S + 0x0000024UL)
#endif /* !$U3_512K$ && !$U3_256K$*/
#define USB_DRD_BASE_S                  (APB2PERIPH_BASE_S + 0x00006000UL)
#define USB_DRD_PMAADDR_S               (APB2PERIPH_BASE_S + 0x00006400UL)
#if !$U3_512K$ && !$U3_256K$
#define I3C2_BASE_S                     (APB2PERIPH_BASE_S + 0x00006C00UL)
#endif /* !$U3_512K$ && !$U3_256K$*/

/*!< AHB1 secure peripherals */
#define GPDMA1_BASE_S                   (AHB1PERIPH_BASE_S)
#define GPDMA1_Channel0_BASE_S          (GPDMA1_BASE_S + 0x00000050UL)
#define GPDMA1_Channel1_BASE_S          (GPDMA1_BASE_S + 0x000000D0UL)
#define GPDMA1_Channel2_BASE_S          (GPDMA1_BASE_S + 0x00000150UL)
#define GPDMA1_Channel3_BASE_S          (GPDMA1_BASE_S + 0x000001D0UL)
#define GPDMA1_Channel4_BASE_S          (GPDMA1_BASE_S + 0x00000250UL)
#define GPDMA1_Channel5_BASE_S          (GPDMA1_BASE_S + 0x000002D0UL)
#define GPDMA1_Channel6_BASE_S          (GPDMA1_BASE_S + 0x00000350UL)
#define GPDMA1_Channel7_BASE_S          (GPDMA1_BASE_S + 0x000003D0UL)
#define GPDMA1_Channel8_BASE_S          (GPDMA1_BASE_S + 0x00000450UL)
#define GPDMA1_Channel9_BASE_S          (GPDMA1_BASE_S + 0x000004D0UL)
#define GPDMA1_Channel10_BASE_S         (GPDMA1_BASE_S + 0x00000550UL)
#define GPDMA1_Channel11_BASE_S         (GPDMA1_BASE_S + 0x000005D0UL)
#define FLASH_R_BASE_S                  (AHB1PERIPH_BASE_S + 0x00002000UL)
#define CRC_BASE_S                      (AHB1PERIPH_BASE_S + 0x00003000UL)
#define TSC_BASE_S                      (AHB1PERIPH_BASE_S + 0x00004000UL)
#define RAMCFG_BASE_S                   (AHB1PERIPH_BASE_S + 0x00006000UL)
#define RAMCFG_SRAM1_BASE_S             (RAMCFG_BASE_S)
#define RAMCFG_SRAM2_BASE_S             (RAMCFG_BASE_S + 0x00000040UL)
#if $U3_2M$ || $U3_1M5$
#define RAMCFG_SRAM3_BASE_S             (RAMCFG_BASE_S + 0x00000080UL)
#endif /* $U3_2M$ || $U3_1M5$ */
#if $U3_2M$ || $U3_1M5$
#define HSP1_BASE_S                     (AHB1PERIPH_BASE_S + 0x0000C000UL)
#endif /* $U3_2M$ || $U3_1M5$ */
#define ICACHE_BASE_S                   (AHB1PERIPH_BASE_S + 0x00010400UL)
#define PWR_BASE_S                      (AHB1PERIPH_BASE_S + 0x00010800UL)
#define RCC_BASE_S                      (AHB1PERIPH_BASE_S + 0x00010C00UL)
#define EXTI_BASE_S                     (AHB1PERIPH_BASE_S + 0x00012000UL)
#define GTZC_TZSC1_BASE_S               (AHB1PERIPH_BASE_S + 0x00012400UL)
#define GTZC_TZIC1_BASE_S               (AHB1PERIPH_BASE_S + 0x00012800UL)
#define GTZC_MPCBB1_BASE_S              (AHB1PERIPH_BASE_S + 0x00012C00UL)
#define GTZC_MPCBB2_BASE_S              (AHB1PERIPH_BASE_S + 0x00013000UL)
#if $U3_2M$ || $U3_1M5$
#define GTZC_MPCBB3_BASE_S              (AHB1PERIPH_BASE_S + 0x00013400UL)
#define GTZC_MPCBB4_BASE_S              (AHB1PERIPH_BASE_S + 0x00013800UL)
#endif /* $U3_2M$ || $U3_1M5$ */
#if !$U3_512K$
#define ADF1_BASE_S                     (AHB1PERIPH_BASE_S + 0x00014000UL)
#define ADF1_Filter0_BASE_S             (ADF1_BASE_S + 0x00000080UL)
#endif /* !$U3_512K$ */

/*!< APB3 secure peripherals */
#define SYSCFG_BASE_S                   (APB3PERIPH_BASE_S + 0x00000400UL)
#define LPUART1_BASE_S                  (APB3PERIPH_BASE_S + 0x00002400UL)
#define I2C3_BASE_S                     (APB3PERIPH_BASE_S + 0x00002800UL)
#define LPTIM1_BASE_S                   (APB3PERIPH_BASE_S + 0x00004400UL)
#define LPTIM3_BASE_S                   (APB3PERIPH_BASE_S + 0x00004800UL)
#define LPTIM4_BASE_S                   (APB3PERIPH_BASE_S + 0x00004C00UL)
#define COMP1_BASE_S                    (APB3PERIPH_BASE_S + 0x00005400UL)
#define COMP2_BASE_S                    (COMP1_BASE_S + 0x00000004UL)
#if $U3_LCD$
#define LCD_BASE_S                      (APB3PERIPH_BASE_S + 0x00008000UL)
#endif /* $U3_LCD$ */

/*!< AHB2 secure peripherals */
#define GPIOA_BASE_S                    (AHB2PERIPH_BASE_S + 0x00000000UL)
#define GPIOB_BASE_S                    (AHB2PERIPH_BASE_S + 0x00000400UL)
#define GPIOC_BASE_S                    (AHB2PERIPH_BASE_S + 0x00000800UL)
#define GPIOD_BASE_S                    (AHB2PERIPH_BASE_S + 0x00000C00UL)
#if !$U3_256K$
#define GPIOE_BASE_S                    (AHB2PERIPH_BASE_S + 0x00001000UL)
#endif /*!$U3_256K$*/
#if $U3_2M$ || $U3_1M5$
#define GPIOF_BASE_S                    (AHB2PERIPH_BASE_S + 0x00001400UL)
#endif /* $U3_2M$ || $U3_1M5$ */
#if !$U3_512K$ && !$U3_256K$
#define GPIOG_BASE_S                    (AHB2PERIPH_BASE_S + 0x00001800UL)
#endif /* !$U3_512K$ && !$U3_256K$ */
#define GPIOH_BASE_S                    (AHB2PERIPH_BASE_S + 0x00001C00UL)
#define ADC1_BASE_S                     (AHB2PERIPH_BASE_S + 0x00008000UL)
#if !$U3_256K$
#define ADC2_BASE_S                     (AHB2PERIPH_BASE_S + 0x00008100UL)
#endif /*!$U3_256K$*/
#if !$U3_256K$
#define ADC12_COMMON_BASE_S             (AHB2PERIPH_BASE_S + 0x00008300UL)
#endif /*!$U3_256K$*/
#define DAC1_BASE_S                     (AHB2PERIPH_BASE_S + 0x00008400UL)
#if $U3_CRYPTO$
#define AES_BASE_S                      (AHB2PERIPH_BASE_S + 0x000A0000UL)
#endif /* $U3_CRYPTO$ */
#define HASH_BASE_S                     (AHB2PERIPH_BASE_S + 0x000A0400UL)
#define HASH_DIGEST_BASE_S              (AHB2PERIPH_BASE_S + 0x000A0710UL)
#define RNG_BASE_S                      (AHB2PERIPH_BASE_S + 0x000A0800UL)
#if $U3_CRYPTO$ && !$U3_256K$
#define SAES_BASE_S                     (AHB2PERIPH_BASE_S + 0x000A0C00UL)
#endif /* $U3_CRYPTO$ && !$U3_256K$*/
#if !$U3_256K$
#define PKA_BASE_S                      (AHB2PERIPH_BASE_S + 0x000A2000UL)
#define PKA_RAM_BASE_S                  (AHB2PERIPH_BASE_S + 0x000A2400UL)
#endif/*!$U3_256K$*/
#if $U3_CRYPTO$ && !$U3_256K$
#define CCB_BASE_S                      (AHB2PERIPH_BASE_S + 0x000A7C00UL)
#endif /* $U3_CRYPTO$ && !$U3_256K$*/
#if !$U3_512K$ && !$U3_256K$
#define SDMMC1_BASE_S                   (AHB2PERIPH_BASE_S + 0x000A8000UL)
#define DLYB_SDMMC1_BASE_S              (AHB2PERIPH_BASE_S + 0x000A8400UL)
#endif /* !$U3_512K$ && !$U3_256K$*/
#define DLYB_OCTOSPI1_BASE_S            (AHB2PERIPH_BASE_S + 0x000AF000UL)
#define OCTOSPI1_R_BASE_S               (AHB2PERIPH_BASE_S + 0x000B1400UL)
#endif /* CPU_IN_SECURE_STATE */

/*!< External memories base addresses - Not aliased */
#define OCTOSPI1_BASE                   EXTRAM_BASE_NS

/*!< DBGMCU base addresses - Not aliased */
#define DBGMCU_BASE                     (EPPB_BASE + 0x00004000UL)

/*!< USB PMA SIZE */
#define USB_DRD_PMA_SIZE        (2048U)         /*!< USB PMA Size 2Kbyte */

/*!< Root Secure Service Library */
/************ RSSLIB SAU system Flash region definition constants *************/
#define RSSLIB_SYS_FLASH_NS_PFUNC_START 0x0BF99040UL
#define RSSLIB_SYS_FLASH_NS_PFUNC_END   0x0BF990FFUL

