STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
/************ RSSLIB function return constants ********************************/
#define RSSLIB_ERROR                    0xF5F5F5F5UL
#define RSSLIB_SUCCESS                  0xEAEAEAEAUL

/*!< RSSLIB  pointer function structure address definition */
#define RSSLIB_PFUNC_BASE               RSSLIB_SYS_FLASH_NS_PFUNC_START
#define RSSLIB_PFUNC                    ((RSSLIB_pFunc_TypeDef *)RSSLIB_PFUNC_BASE)

/*!< HDP Area constant definition */
#define RSSLIB_HDP_AREA_Pos             0UL
#define RSSLIB_HDP_AREA_Msk             (0x3UL << RSSLIB_HDP_AREA_Pos )
#define RSSLIB_HDP_AREA1_Pos            0UL
#define RSSLIB_HDP_AREA1_Msk            (0x1UL << RSSLIB_HDP_AREA1_Pos )
#define RSSLIB_HDP_AREA2_Pos            1UL
#define RSSLIB_HDP_AREA2_Msk            (0x1UL << RSSLIB_HDP_AREA2_Pos )
#define RSSLIB_HDPEXT_CLOSE_BOUNDARY_OPEN 0xC9C9C9C9UL  /* Access to HDPx extension area and HDPx area denied but HDPx_EXT (in FLASH_HDPEXTR) increment allowed at any time */
#define RSSLIB_HDPEXT_CLOSE_BOUNDARY_LOCK 0xD6D6D6D6UL  /* Access to HDPx extension area and HDPx area denied. Update of HDPx_EXT size is not possible anymore */

/**
  * @brief  Prototype of RSSLIB Close and exit HDP Function
  * @detail This function close the requested hdp area passed in input
  *         parameter and jump to the reset handler present within the
  *         Vector table. The function does not return on successful execution.
  * @param  HdpArea notifies which hdp area to close, can be a combination of
  *         hdpa area 1 and hdp area 2
  * @param  VectorTableAddr pointer on the vector table containing the reset handler the function
  *         jumps to.
  * @retval RSSLIB_RSS_ERROR on error on input parameter, otherwise does not return.
  */
typedef uint32_t ( *RSSLIB_S_CloseExitHDP_TypeDef)( uint32_t HdpArea, uint32_t VectorTableAddr );

/**
  * @brief  Prototype of RSSLIB Close and exit HDP extension Function
  * @detail This function close the requested hdp extension area passed in input
  *         parameter and jump to the reset handler present within the
  *         Vector table. The function does not return on successful execution.
  * @param  HdpExtArea notifies which hdp extension area to close, can be a combination of
  *         hdp extension area 1 and hdp extension area 2
  * @param  VectorTableAddr pointer on the vector table containing the reset handler the function
  *         jumps to.
  * @param  CloseBound notifies if the HDP extension area should be closed with
  *         HDPx_EXT increment allowed or not
  * @retval RSSLIB_RSS_ERROR on error on input parameter, otherwise does not return.
  */
typedef uint32_t ( *RSSLIB_S_CloseExitHDPExt_TypeDef)( uint32_t HdpExtArea, uint32_t VectorTableAddr, uint32_t CloseBound );


/**
  * @brief RSSLib non-secure callable function pointer structure
  */
typedef struct
{
  __IM uint32_t Reserved[8];
}NSC_pFuncTypeDef;

/**
  * @brief RSSLib secure callable function pointer structure
  */
typedef struct
{
  __IM uint32_t Reserved2[2];
  __IM RSSLIB_S_CloseExitHDP_TypeDef CloseExitHDP;        /*!< RSSLIB Bootloader Close and exit HDP           Address offset: 0x28 */
  __IM RSSLIB_S_CloseExitHDPExt_TypeDef CloseExitHDPExt;  /*!< RSSLIB Bootloader Close and exit HDP extension Address offset: 0x2C */
}S_pFuncTypeDef;

/**
  * @brief RSSLib function pointer structure
  */
typedef struct
{
  NSC_pFuncTypeDef NSC;
  S_pFuncTypeDef S;
}RSSLIB_pFunc_TypeDef;

/*
 * Certificate address description
 */
#define CERT_CHIP_PACK1_ADDR (0x0BF9FE00U)
#define CERT_CHIP_PACK1_SIZE (0x200U)
#define CERT_CHIP_PACK2_ADDR (0x0BF9FC00U)
#define CERT_CHIP_PACK2_SIZE (0x200U)

#define CERT_CHIP_PACK_ADDR (CERT_CHIP_PACK2_ADDR)
#define CERT_CHIP_PACK_SIZE (CERT_CHIP_PACK1_SIZE + CERT_CHIP_PACK2_SIZE)

#define CERT_ST_DUA_USER_FU_PUB_KEY_OFFSET  (12U)
#define CERT_ST_DUA_USER_FU_PUB_KEY_ADDR    (CERT_CHIP_PACK2_ADDR + CERT_ST_DUA_USER_FU_PUB_KEY_OFFSET)
#define CERT_ST_DUA_USER_FU_SIGN_OFFSET     (76U)
#define CERT_ST_DUA_USER_FU_SIGN_ADDR       (CERT_CHIP_PACK2_ADDR + CERT_ST_DUA_USER_FU_SIGN_OFFSET)
#define CERT_ST_DUA_USER_FU_SERIAL_OFFSET   (140U)
#define CERT_ST_DUA_USER_FU_SERIAL_ADDR     (CERT_CHIP_PACK2_ADDR + CERT_ST_DUA_USER_FU_SERIAL_OFFSET)

#define CERT_ST_DUA_USER_LU_PUB_KEY_OFFSET  (162U)
#define CERT_ST_DUA_USER_LU_PUB_KEY_ADDR    (CERT_CHIP_PACK2_ADDR + CERT_ST_DUA_USER_LU_PUB_KEY_OFFSET)
#define CERT_ST_DUA_USER_LU_SIGN_OFFSET     (226U)
#define CERT_ST_DUA_USER_LU_SIGN_ADDR       (CERT_CHIP_PACK2_ADDR + CERT_ST_DUA_USER_LU_SIGN_OFFSET)
#define CERT_ST_DUA_USER_LU_SERIAL_OFFSET   (290U)
#define CERT_ST_DUA_USER_LU_SERIAL_ADDR     (CERT_CHIP_PACK2_ADDR + CERT_ST_DUA_USER_LU_SERIAL_OFFSET)
/** @} */ /* End of group STM32U3xx_Peripheral_peripheralAddr */


/* ================================================================================================================== */
/* ================                     Peripheral declaration                                       ================ */
/* ================================================================================================================== */
/** @addtogroup STM32U3xx_Peripheral_declaration
  * @{
  */
 #if !$U3_256K$
#define ADC12_COMMON_NS                 ((ADC_Common_TypeDef *) ADC12_COMMON_BASE_NS)
#endif /*!$U3_256K$*/
#define ADC1_NS                         ((ADC_TypeDef *) ADC1_BASE_NS)
#if !$U3_256K$
#define ADC2_NS                         ((ADC_TypeDef *) ADC2_BASE_NS)
#endif /*!$U3_256K$*/
#if !$U3_512K$
#define ADF1_NS                         ((MDF_TypeDef *) ADF1_BASE_NS)
#define ADF1_Filter0_NS                 ((MDF_Filter_TypeDef*) ADF1_Filter0_BASE_NS)
#endif /* !$U3_512K$ */
#if $U3_CRYPTO$ 
#define AES_NS                          ((AES_TypeDef *) AES_BASE_NS)
#if !$U3_256K$
#define CCB_NS                          ((CCB_TypeDef *) CCB_BASE_NS)
#endif /*!$U3_256K$*/
#endif /* $U3_CRYPTO$ */
#define COMP1_NS                        ((COMP_TypeDef *) COMP1_BASE_NS)
#define COMP2_NS                        ((COMP_TypeDef *) COMP2_BASE_NS)
#define COMP12_COMMON_NS                ((COMP_Common_TypeDef *) COMP1_BASE_NS)
#define CRC_NS                          ((CRC_TypeDef *) CRC_BASE_NS)
#define CRS_NS                          ((CRS_TypeDef *) CRS_BASE_NS)
#define DAC1_NS                         ((DAC_TypeDef *) DAC1_BASE_NS)
#if !$U3_512K$ && !$U3_256K$
#define DLYB_SDMMC1_NS                  ((DLYB_TypeDef *) DLYB_SDMMC1_BASE_NS)
#endif /* !$U3_512K$ && !$U3_256K$*/
#define DLYB_OCTOSPI1_NS                ((DLYB_TypeDef *) DLYB_OCTOSPI1_BASE_NS)
#define EXTI_NS                         ((EXTI_TypeDef *) EXTI_BASE_NS)
#if !$U3_512K$
#define FDCAN1_NS                       ((FDCAN_GlobalTypeDef *) FDCAN1_BASE_NS)
#if $U3_2M$
#define FDCAN2_NS                       ((FDCAN_GlobalTypeDef *) FDCAN2_BASE_NS)
#endif /* $U3_2M$ */
#define FDCAN_CONFIG_NS                 ((FDCAN_Config_TypeDef *) FDCAN_CONFIG_BASE_NS)
#endif /* !$U3_512K$ */
#define FLASH_NS                        ((FLASH_TypeDef *) FLASH_R_BASE_NS)
#define GPDMA1_NS                       ((DMA_TypeDef *) GPDMA1_BASE_NS)
#define GPDMA1_Channel0_NS              ((DMA_Channel_TypeDef *) GPDMA1_Channel0_BASE_NS)
#define GPDMA1_Channel1_NS              ((DMA_Channel_TypeDef *) GPDMA1_Channel1_BASE_NS)
#define GPDMA1_Channel2_NS              ((DMA_Channel_TypeDef *) GPDMA1_Channel2_BASE_NS)
#define GPDMA1_Channel3_NS              ((DMA_Channel_TypeDef *) GPDMA1_Channel3_BASE_NS)
#define GPDMA1_Channel4_NS              ((DMA_Channel_TypeDef *) GPDMA1_Channel4_BASE_NS)
#define GPDMA1_Channel5_NS              ((DMA_Channel_TypeDef *) GPDMA1_Channel5_BASE_NS)
#define GPDMA1_Channel6_NS              ((DMA_Channel_TypeDef *) GPDMA1_Channel6_BASE_NS)
#define GPDMA1_Channel7_NS              ((DMA_Channel_TypeDef *) GPDMA1_Channel7_BASE_NS)
#define GPDMA1_Channel8_NS              ((DMA_Channel_TypeDef *) GPDMA1_Channel8_BASE_NS)
#define GPDMA1_Channel9_NS              ((DMA_Channel_TypeDef *) GPDMA1_Channel9_BASE_NS)
#define GPDMA1_Channel10_NS             ((DMA_Channel_TypeDef *) GPDMA1_Channel10_BASE_NS)
#define GPDMA1_Channel11_NS             ((DMA_Channel_TypeDef *) GPDMA1_Channel11_BASE_NS)
#define GPIOA_NS                        ((GPIO_TypeDef *) GPIOA_BASE_NS)
#define GPIOB_NS                        ((GPIO_TypeDef *) GPIOB_BASE_NS)
#define GPIOC_NS                        ((GPIO_TypeDef *) GPIOC_BASE_NS)
#define GPIOD_NS                        ((GPIO_TypeDef *) GPIOD_BASE_NS)
#if !$U3_256K$
#define GPIOE_NS                        ((GPIO_TypeDef *) GPIOE_BASE_NS)
#endif /*!$U3_256K$*/
#if $U3_2M$ || $U3_1M5$
#define GPIOF_NS                        ((GPIO_TypeDef *) GPIOF_BASE_NS)
#endif /* $U3_2M$ || $U3_1M5$ */
#if !$U3_512K$ && !$U3_256K$
#define GPIOG_NS                        ((GPIO_TypeDef *) GPIOG_BASE_NS)
#endif /* !$U3_512K$ && !$U3_256K$ */
#define GPIOH_NS                        ((GPIO_TypeDef *) GPIOH_BASE_NS)
#define GTZC_MPCBB1_NS                  ((GTZC_MPCBB_TypeDef *) GTZC_MPCBB1_BASE_NS)
#define GTZC_MPCBB2_NS                  ((GTZC_MPCBB_TypeDef *) GTZC_MPCBB2_BASE_NS)
#if $U3_2M$ || $U3_1M5$
#define GTZC_MPCBB3_NS                  ((GTZC_MPCBB_TypeDef *) GTZC_MPCBB3_BASE_NS)
#define GTZC_MPCBB4_NS                  ((GTZC_MPCBB_TypeDef *) GTZC_MPCBB4_BASE_NS)
#endif /* $U3_2M$ || $U3_1M5$ */
#define GTZC_TZSC1_NS                   ((GTZC_TZSC_TypeDef *) GTZC_TZSC1_BASE_NS)
#define HASH_NS                         ((HASH_TypeDef *) HASH_BASE_NS)
#define HASH_DIGEST_NS                  ((HASH_DIGEST_TypeDef *) HASH_DIGEST_BASE_NS)
#define I2C1_NS                         ((I2C_TypeDef *) I2C1_BASE_NS)
#if !$U3_512K$ && !$U3_256K$
#define I2C2_NS                         ((I2C_TypeDef *) I2C2_BASE_NS)
#endif /* !$U3_512K$ && !$U3_256K$ */
#define I2C3_NS                         ((I2C_TypeDef *) I2C3_BASE_NS)
#if $U3_2M$
#define I2C4_NS                         ((I2C_TypeDef *) I2C4_BASE_NS)
#endif /* $U3_2M$ */
#define I3C1_NS                         ((I3C_TypeDef *) I3C1_BASE_NS)
#if !$U3_512K$ && !$U3_256K$
#define I3C2_NS                         ((I3C_TypeDef *) I3C2_BASE_NS)
#endif /* !$U3_512K$ && !$U3_256K$*/
#if $U3_2M$ || $U3_1M5$
#define HSP1_NS                         ((HSP_TypeDef *) HSP1_BASE_NS)
#endif /* $U3_2M$ || $U3_1M5$ */
#define ICACHE_NS                       ((ICACHE_TypeDef *) ICACHE_BASE_NS)
#define IWDG_NS                         ((IWDG_TypeDef *) IWDG_BASE_NS)
#if $U3_LCD$
#define LCD_NS                          ((LCD_TypeDef *) LCD_BASE_NS)
#endif /* $U3_LCD$ */
#define LPTIM1_NS                       ((LPTIM_TypeDef *) LPTIM1_BASE_NS)
#define LPTIM2_NS                       ((LPTIM_TypeDef *) LPTIM2_BASE_NS)
#define LPTIM3_NS                       ((LPTIM_TypeDef *) LPTIM3_BASE_NS)
#define LPTIM4_NS                       ((LPTIM_TypeDef *) LPTIM4_BASE_NS)
#define LPUART1_NS                      ((USART_TypeDef *) LPUART1_BASE_NS)
#define OCTOSPI1_NS                     ((OCTOSPI_TypeDef *) OCTOSPI1_R_BASE_NS)
#define OPAMP1_NS                       ((OPAMP_TypeDef *) OPAMP1_BASE_NS)
#define OPAMP2_NS                       ((OPAMP_TypeDef *) OPAMP2_BASE_NS)
#define OPAMP12_COMMON_NS               ((OPAMP_Common_TypeDef *) OPAMP1_BASE_NS)
#if !$U3_256K$
#define PKA_NS                          ((PKA_TypeDef *) PKA_BASE_NS)
#endif /*!$U3_256K$*/
#define PWR_NS                          ((PWR_TypeDef *) PWR_BASE_NS)
#define RAMCFG_SRAM1_NS                 ((RAMCFG_TypeDef *) RAMCFG_SRAM1_BASE_NS)
#define RAMCFG_SRAM2_NS                 ((RAMCFG_TypeDef *) RAMCFG_SRAM2_BASE_NS)
#if $U3_2M$ || $U3_1M5$
#define RAMCFG_SRAM3_NS                 ((RAMCFG_TypeDef *) RAMCFG_SRAM3_BASE_NS)
#endif /* $U3_2M$ || $U3_1M5$ */
#define RCC_NS                          ((RCC_TypeDef *) RCC_BASE_NS)
#define RNG_NS                          ((RNG_TypeDef *) RNG_BASE_NS)
#define RTC_NS                          ((RTC_TypeDef *) RTC_BASE_NS)
#if $U3_CRYPTO$ && !$U3_256K$
#define SAES_NS                         ((AES_TypeDef *) SAES_BASE_NS)
#endif /* $U3_CRYPTO$ && !$U3_256K$*/
#if !$U3_512K$ && !$U3_256K$
#define SAI1_NS                         ((SAI_TypeDef *) SAI1_BASE_NS)
#define SAI1_Block_A_NS                 ((SAI_Block_TypeDef *)SAI1_Block_A_BASE_NS)
#define SAI1_Block_B_NS                 ((SAI_Block_TypeDef *)SAI1_Block_B_BASE_NS)
#endif /* !$U3_512K$ && !$U3_256K$*/
#if !$U3_512K$ && !$U3_256K$
#define SDMMC1_NS                       ((SDMMC_TypeDef *) SDMMC1_BASE_NS)
#endif /* !$U3_512K$ && !$U3_256K$ */
#define SPI1_NS                         ((SPI_TypeDef *) SPI1_BASE_NS)
#define SPI2_NS                         ((SPI_TypeDef *) SPI2_BASE_NS)
#if !$U3_256K$
#define SPI3_NS                         ((SPI_TypeDef *) SPI3_BASE_NS)
#endif /*!$U3_256K$*/
#if $U3_2M$
#define SPI4_NS                         ((SPI_TypeDef *) SPI4_BASE_NS)
#endif /* $U3_2M$ */
#define SYSCFG_NS                       ((SYSCFG_TypeDef *) SYSCFG_BASE_NS)
#define TAMP_NS                         ((TAMP_TypeDef *) TAMP_BASE_NS)
#define TIM1_NS                         ((TIM_TypeDef *) TIM1_BASE_NS)
#define TIM2_NS                         ((TIM_TypeDef *) TIM2_BASE_NS)
#define TIM3_NS                         ((TIM_TypeDef *) TIM3_BASE_NS)
#define TIM4_NS                         ((TIM_TypeDef *) TIM4_BASE_NS)
#define TIM6_NS                         ((TIM_TypeDef *) TIM6_BASE_NS)
#define TIM7_NS                         ((TIM_TypeDef *) TIM7_BASE_NS)
#if $U3_2M$ || $U3_1M5$
#define TIM12_NS                        ((TIM_TypeDef *) TIM12_BASE_NS)
#endif /* $U3_2M$ || $U3_1M5$ */
#define TIM15_NS                        ((TIM_TypeDef *) TIM15_BASE_NS)
#define TIM16_NS                        ((TIM_TypeDef *) TIM16_BASE_NS)
#define TIM17_NS                        ((TIM_TypeDef *) TIM17_BASE_NS)
#define TSC_NS                          ((TSC_TypeDef *) TSC_BASE_NS)
#define UART4_NS                        ((USART_TypeDef *) UART4_BASE_NS)
#if !$U3_256K$
#define UART5_NS                        ((USART_TypeDef *) UART5_BASE_NS)
#endif /*!$U3_256K$*/
#if $U3_2M$ || $U3_1M5$
#define TIM8_NS                         ((TIM_TypeDef *) TIM8_BASE_NS)
#endif /* $U3_2M$ || $U3_1M5$ */
#define USART1_NS                       ((USART_TypeDef *) USART1_BASE_NS)
#if $U3_2M$ || $U3_1M5$
#define USART2_NS                       ((USART_TypeDef *) USART2_BASE_NS)
#endif /* $U3_2M$ || $U3_1M5$ */
#define USART3_NS                       ((USART_TypeDef *) USART3_BASE_NS)
#define USB_DRD_FS_NS                   ((USB_DRD_TypeDef *) USB_DRD_BASE_NS)
#define USB_DRD_PMA_BUFF_NS             ((USB_DRD_PMABuffDescTypeDef *) USB_DRD_PMAADDR_NS)
#if !$U3_256K$
#define VREFBUF_NS                      ((VREFBUF_TypeDef *) VREFBUF_BASE_NS)
#endif /*!$U3_256K$*/
#define WWDG_NS                         ((WWDG_TypeDef *) WWDG_BASE_NS)

