STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
/*!< DBGMCU peripheral */
#define DBGMCU                          ((DBGMCU_TypeDef *) DBGMCU_BASE)

#if defined (CPU_IN_SECURE_STATE)
#if !$U3_256K$
#define ADC12_COMMON_S                  ((ADC_Common_TypeDef *) ADC12_COMMON_BASE_S)
#endif /*!$U3_256K$*/
#define ADC1_S                          ((ADC_TypeDef *) ADC1_BASE_S)
#if !$U3_256K$
#define ADC2_S                          ((ADC_TypeDef *) ADC2_BASE_S)
#endif /*!$U3_256K$*/
#if !$U3_512K$
#define ADF1_S                          ((MDF_TypeDef *) ADF1_BASE_S)
#define ADF1_Filter0_S                  ((MDF_Filter_TypeDef*) ADF1_Filter0_BASE_S)
#endif /* !$U3_512K$ */
#if $U3_CRYPTO$
#define AES_S                           ((AES_TypeDef *) AES_BASE_S)
#if !$U3_256K$
#define CCB_S                           ((CCB_TypeDef *) CCB_BASE_S)
#endif /*!$U3_256K$*/
#endif /* $U3_CRYPTO$ */
#define COMP1_S                         ((COMP_TypeDef *) COMP1_BASE_S)
#define COMP2_S                         ((COMP_TypeDef *) COMP2_BASE_S)
#define COMP12_COMMON_S                 ((COMP_Common_TypeDef *) COMP1_BASE_S)
#define CRC_S                           ((CRC_TypeDef *) CRC_BASE_S)
#define CRS_S                           ((CRS_TypeDef *) CRS_BASE_S)
#define DAC1_S                          ((DAC_TypeDef *) DAC1_BASE_S)
#if !$U3_512K$ && !$U3_256K$
#define DLYB_SDMMC1_S                   ((DLYB_TypeDef *) DLYB_SDMMC1_BASE_S)
#endif /* !$U3_512K$ && !$U3_256K$*/
#define DLYB_OCTOSPI1_S                 ((DLYB_TypeDef *) DLYB_OCTOSPI1_BASE_S)
#define EXTI_S                          ((EXTI_TypeDef *) EXTI_BASE_S)
#if !$U3_512K$
#define FDCAN1_S                        ((FDCAN_GlobalTypeDef *) FDCAN1_BASE_S)
#if $U3_2M$
#define FDCAN2_S                        ((FDCAN_GlobalTypeDef *) FDCAN2_BASE_S)
#endif /* $U3_2M$ */
#define FDCAN_CONFIG_S                  ((FDCAN_Config_TypeDef *) FDCAN_CONFIG_BASE_S)
#endif /* !$U3_512K$ */
#define FLASH_S                         ((FLASH_TypeDef *) FLASH_R_BASE_S)
#define GPDMA1_S                        ((DMA_TypeDef *) GPDMA1_BASE_S)
#define GPDMA1_Channel0_S               ((DMA_Channel_TypeDef *) GPDMA1_Channel0_BASE_S)
#define GPDMA1_Channel1_S               ((DMA_Channel_TypeDef *) GPDMA1_Channel1_BASE_S)
#define GPDMA1_Channel2_S               ((DMA_Channel_TypeDef *) GPDMA1_Channel2_BASE_S)
#define GPDMA1_Channel3_S               ((DMA_Channel_TypeDef *) GPDMA1_Channel3_BASE_S)
#define GPDMA1_Channel4_S               ((DMA_Channel_TypeDef *) GPDMA1_Channel4_BASE_S)
#define GPDMA1_Channel5_S               ((DMA_Channel_TypeDef *) GPDMA1_Channel5_BASE_S)
#define GPDMA1_Channel6_S               ((DMA_Channel_TypeDef *) GPDMA1_Channel6_BASE_S)
#define GPDMA1_Channel7_S               ((DMA_Channel_TypeDef *) GPDMA1_Channel7_BASE_S)
#define GPDMA1_Channel8_S               ((DMA_Channel_TypeDef *) GPDMA1_Channel8_BASE_S)
#define GPDMA1_Channel9_S               ((DMA_Channel_TypeDef *) GPDMA1_Channel9_BASE_S)
#define GPDMA1_Channel10_S              ((DMA_Channel_TypeDef *) GPDMA1_Channel10_BASE_S)
#define GPDMA1_Channel11_S              ((DMA_Channel_TypeDef *) GPDMA1_Channel11_BASE_S)
#define GPIOA_S                         ((GPIO_TypeDef *) GPIOA_BASE_S)
#define GPIOB_S                         ((GPIO_TypeDef *) GPIOB_BASE_S)
#define GPIOC_S                         ((GPIO_TypeDef *) GPIOC_BASE_S)
#define GPIOD_S                         ((GPIO_TypeDef *) GPIOD_BASE_S)
#if !$U3_256K$
#define GPIOE_S                         ((GPIO_TypeDef *) GPIOE_BASE_S)
#endif /*!$U3_256K$*/
#if $U3_2M$ || $U3_1M5$
#define GPIOF_S                         ((GPIO_TypeDef *) GPIOF_BASE_S)
#endif /* $U3_2M$ || $U3_1M5$ */
#if !$U3_512K$ && !$U3_256K$
#define GPIOG_S                         ((GPIO_TypeDef *) GPIOG_BASE_S)
#endif /* !$U3_512K$ && !$U3_256K$ */
#define GPIOH_S                         ((GPIO_TypeDef *) GPIOH_BASE_S)
#define GTZC_TZSC1_S                    ((GTZC_TZSC_TypeDef *) GTZC_TZSC1_BASE_S)
#define GTZC_TZIC1_S                    ((GTZC_TZIC_TypeDef *) GTZC_TZIC1_BASE_S)
#define GTZC_MPCBB1_S                   ((GTZC_MPCBB_TypeDef *) GTZC_MPCBB1_BASE_S)
#define GTZC_MPCBB2_S                   ((GTZC_MPCBB_TypeDef *) GTZC_MPCBB2_BASE_S)
#if $U3_2M$ || $U3_1M5$
#define GTZC_MPCBB3_S                   ((GTZC_MPCBB_TypeDef *) GTZC_MPCBB3_BASE_S)
#define GTZC_MPCBB4_S                   ((GTZC_MPCBB_TypeDef *) GTZC_MPCBB4_BASE_S)
#endif /* $U3_2M$ || $U3_1M5$ */
#define HASH_S                          ((HASH_TypeDef *) HASH_BASE_S)
#define HASH_DIGEST_S                   ((HASH_DIGEST_TypeDef *) HASH_DIGEST_BASE_S)
#define I2C1_S                          ((I2C_TypeDef *) I2C1_BASE_S)
#if !$U3_512K$ && !$U3_256K$
#define I2C2_S                          ((I2C_TypeDef *) I2C2_BASE_S)
#endif /* !$U3_512K$ && !$U3_256K$*/
#define I2C3_S                          ((I2C_TypeDef *) I2C3_BASE_S)
#if $U3_2M$
#define I2C4_S                          ((I2C_TypeDef *) I2C4_BASE_S)
#endif /* $U3_2M$ */
#define I3C1_S                          ((I3C_TypeDef *) I3C1_BASE_S)
#if !$U3_512K$ && !$U3_256K$
#define I3C2_S                          ((I3C_TypeDef *) I3C2_BASE_S)
#endif /* !$U3_512K$ && !$U3_256K$*/
#if $U3_2M$ || $U3_1M5$
#define HSP1_S                          ((HSP_TypeDef *) HSP1_BASE_S)
#endif /* $U3_2M$ || $U3_1M5$ */
#define ICACHE_S                        ((ICACHE_TypeDef *) ICACHE_BASE_S)
#define IWDG_S                          ((IWDG_TypeDef *) IWDG_BASE_S)
#if $U3_LCD$
#define LCD_S                           ((LCD_TypeDef *) LCD_BASE_S)
#endif /* $U3_LCD$ */
#define LPTIM1_S                        ((LPTIM_TypeDef *) LPTIM1_BASE_S)
#define LPTIM2_S                        ((LPTIM_TypeDef *) LPTIM2_BASE_S)
#define LPTIM3_S                        ((LPTIM_TypeDef *) LPTIM3_BASE_S)
#define LPTIM4_S                        ((LPTIM_TypeDef *) LPTIM4_BASE_S)
#define LPUART1_S                       ((USART_TypeDef *) LPUART1_BASE_S)
#define OCTOSPI1_S                      ((OCTOSPI_TypeDef *) OCTOSPI1_R_BASE_S)
#define OPAMP1_S                        ((OPAMP_TypeDef *) OPAMP1_BASE_S)
#define OPAMP2_S                        ((OPAMP_TypeDef *) OPAMP2_BASE_S)
#define OPAMP12_COMMON_S                ((OPAMP_Common_TypeDef *) OPAMP1_BASE_S)
#if !$U3_256K$
#define PKA_S                           ((PKA_TypeDef *) PKA_BASE_S)
#endif /*!$U3_256K$*/
#define PWR_S                           ((PWR_TypeDef *) PWR_BASE_S)
#define RAMCFG_SRAM1_S                  ((RAMCFG_TypeDef *) RAMCFG_SRAM1_BASE_S)
#define RAMCFG_SRAM2_S                  ((RAMCFG_TypeDef *) RAMCFG_SRAM2_BASE_S)
#if $U3_2M$ || $U3_1M5$
#define RAMCFG_SRAM3_S                  ((RAMCFG_TypeDef *) RAMCFG_SRAM3_BASE_S)
#endif /* $U3_2M$ || $U3_1M5$ */
#define RCC_S                           ((RCC_TypeDef *) RCC_BASE_S)
#define RNG_S                           ((RNG_TypeDef *) RNG_BASE_S)
#define RTC_S                           ((RTC_TypeDef *) RTC_BASE_S)
#if $U3_CRYPTO$ && !$U3_256K$
#define SAES_S                          ((AES_TypeDef *) SAES_BASE_S)
#endif /* $U3_CRYPTO$ && !$U3_256K$*/
#if !$U3_512K$ && !$U3_256K$
#define SAI1_S                          ((SAI_TypeDef *) SAI1_BASE_S)
#define SAI1_Block_A_S                  ((SAI_Block_TypeDef *)SAI1_Block_A_BASE_S)
#define SAI1_Block_B_S                  ((SAI_Block_TypeDef *)SAI1_Block_B_BASE_S)
#endif /* !$U3_512K$ && !$U3_256K$*/
#if !$U3_512K$ && !$U3_256K$
#define SDMMC1_S                        ((SDMMC_TypeDef *) SDMMC1_BASE_S)
#endif /* !$U3_512K$ && !$U3_256K$*/
#define SPI1_S                          ((SPI_TypeDef *) SPI1_BASE_S)
#define SPI2_S                          ((SPI_TypeDef *) SPI2_BASE_S)
#if !$U3_256K$
#define SPI3_S                          ((SPI_TypeDef *) SPI3_BASE_S)
#endif /*!$U3_256K$*/
#if $U3_2M$
#define SPI4_S                          ((SPI_TypeDef *) SPI4_BASE_S)
#endif /* $U3_2M$ */
#define SYSCFG_S                        ((SYSCFG_TypeDef *) SYSCFG_BASE_S)
#define TAMP_S                          ((TAMP_TypeDef *) TAMP_BASE_S)
#define TIM1_S                          ((TIM_TypeDef *) TIM1_BASE_S)
#define TIM2_S                          ((TIM_TypeDef *) TIM2_BASE_S)
#define TIM3_S                          ((TIM_TypeDef *) TIM3_BASE_S)
#define TIM4_S                          ((TIM_TypeDef *) TIM4_BASE_S)
#define TIM6_S                          ((TIM_TypeDef *) TIM6_BASE_S)
#define TIM7_S                          ((TIM_TypeDef *) TIM7_BASE_S)
#if $U3_2M$ || $U3_1M5$
#define TIM12_S                         ((TIM_TypeDef *) TIM12_BASE_S)
#endif /* $U3_2M$ || $U3_1M5$ */
#define TIM15_S                         ((TIM_TypeDef *) TIM15_BASE_S)
#define TIM16_S                         ((TIM_TypeDef *) TIM16_BASE_S)
#define TIM17_S                         ((TIM_TypeDef *) TIM17_BASE_S)
#define TSC_S                           ((TSC_TypeDef *) TSC_BASE_S)
#define UART4_S                         ((USART_TypeDef *) UART4_BASE_S)
#if !$U3_256K$
#define UART5_S                         ((USART_TypeDef *) UART5_BASE_S)
#endif /*!$U3_256K$*/
#if $U3_2M$ || $U3_1M5$
#define TIM8_S                          ((TIM_TypeDef *) TIM8_BASE_S)
#endif /* $U3_2M$ || $U3_1M5$ */
#define USART1_S                        ((USART_TypeDef *) USART1_BASE_S)
#if $U3_2M$ || $U3_1M5$
#define USART2_S                        ((USART_TypeDef *) USART2_BASE_S)
#endif /* $U3_2M$ || $U3_1M5$ */
#define USART3_S                        ((USART_TypeDef *) USART3_BASE_S)
#define USB_DRD_FS_S                    ((USB_DRD_TypeDef *) USB_DRD_BASE_S)
#define USB_DRD_PMA_BUFF_S              ((USB_DRD_PMABuffDescTypeDef *) USB_DRD_PMAADDR_S)
#if !$U3_256K$
#define VREFBUF_S                       ((VREFBUF_TypeDef *) VREFBUF_BASE_S)
#endif /*!$U3_256K$*/
#define WWDG_S                          ((WWDG_TypeDef *) WWDG_BASE_S)

