STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
/*!< Instance aliases and base addresses for Secure peripherals */
#if !$U3_256K$
#define ADC12_COMMON                    ADC12_COMMON_NS
#define ADC12_COMMON_BASE               ADC12_COMMON_BASE_NS
#endif /*!$U3_256K$*/
#define ADC1                            ADC1_NS
#define ADC1_BASE                       ADC1_BASE_NS
#if !$U3_256K$
#define ADC2                            ADC2_NS
#define ADC2_BASE                       ADC2_BASE_NS
#endif /*!$U3_256K$*/
#if !$U3_512K$
#define ADF1                            ADF1_NS
#define ADF1_BASE                       ADF1_BASE_NS
#define ADF1_Filter0                    ADF1_Filter0_NS
#define ADF1_Filter0_BASE               ADF1_Filter0_BASE_NS
#endif /* !$U3_512K$ */
#if $U3_CRYPTO$
#define AES                             AES_NS
#define AES_BASE                        AES_BASE_NS
#if !$U3_256K$
#define CCB                             CCB_NS
#define CCB_BASE                        CCB_BASE_NS
#endif /*!$U3_256K$*/
#endif /* $U3_CRYPTO$ */
#define COMP1                           COMP1_NS
#define COMP1_BASE                      COMP1_BASE_NS
#define COMP2                           COMP2_NS
#define COMP2_BASE                      COMP2_BASE_NS
#define COMP12_COMMON                   COMP12_COMMON_NS
#define COMP12_COMMON_BASE              COMP12_BASE_NS
#define CRC                             CRC_NS
#define CRC_BASE                        CRC_BASE_NS
#define CRS                             CRS_NS
#define CRS_BASE                        CRS_BASE_NS
#define DAC1                            DAC1_NS
#define DAC1_BASE                       DAC1_BASE_NS
#if !$U3_512K$ && !$U3_256K$
#define DLYB_SDMMC1                     DLYB_SDMMC1_NS
#define DLYB_SDMMC1_BASE                DLYB_SDMMC1_BASE_NS
#endif /* !$U3_512K$ && !$U3_256K$ */
#define DLYB_OCTOSPI1                   DLYB_OCTOSPI1_NS
#define DLYB_OCTOSPI1_BASE              DLYB_OCTOSPI1_BASE_NS
#define EXTI                            EXTI_NS
#define EXTI_BASE                       EXTI_BASE_NS
#if !$U3_512K$
#define FDCAN1                          FDCAN1_NS
#define FDCAN1_BASE                     FDCAN1_BASE_NS
#if $U3_2M$
#define FDCAN2                          FDCAN2_NS
#define FDCAN2_BASE                     FDCAN2_BASE_NS
#endif /* $U3_2M$ */
#define FDCAN_CONFIG                    FDCAN_CONFIG_NS
#define FDCAN_CONFIG_BASE               FDCAN_CONFIG_BASE_NS
#endif /* !$U3_512K$ */
#define FLASH                           FLASH_NS
#define FLASH_R_BASE                    FLASH_R_BASE_NS
#define GPDMA1                          GPDMA1_NS
#define GPDMA1_BASE                     GPDMA1_BASE_NS
#define GPDMA1_Channel0                 GPDMA1_Channel0_NS
#define GPDMA1_Channel0_BASE            GPDMA1_Channel0_BASE_NS
#define GPDMA1_Channel1                 GPDMA1_Channel1_NS
#define GPDMA1_Channel1_BASE            GPDMA1_Channel1_BASE_NS
#define GPDMA1_Channel2                 GPDMA1_Channel2_NS
#define GPDMA1_Channel2_BASE            GPDMA1_Channel2_BASE_NS
#define GPDMA1_Channel3                 GPDMA1_Channel3_NS
#define GPDMA1_Channel3_BASE            GPDMA1_Channel3_BASE_NS
#define GPDMA1_Channel4                 GPDMA1_Channel4_NS
#define GPDMA1_Channel4_BASE            GPDMA1_Channel4_BASE_NS
#define GPDMA1_Channel5                 GPDMA1_Channel5_NS
#define GPDMA1_Channel5_BASE            GPDMA1_Channel5_BASE_NS
#define GPDMA1_Channel6                 GPDMA1_Channel6_NS
#define GPDMA1_Channel6_BASE            GPDMA1_Channel6_BASE_NS
#define GPDMA1_Channel7                 GPDMA1_Channel7_NS
#define GPDMA1_Channel7_BASE            GPDMA1_Channel7_BASE_NS
#define GPDMA1_Channel8                 GPDMA1_Channel8_NS
#define GPDMA1_Channel8_BASE            GPDMA1_Channel8_BASE_NS
#define GPDMA1_Channel9                 GPDMA1_Channel9_NS
#define GPDMA1_Channel9_BASE            GPDMA1_Channel9_BASE_NS
#define GPDMA1_Channel10                GPDMA1_Channel10_NS
#define GPDMA1_Channel10_BASE           GPDMA1_Channel10_BASE_NS
#define GPDMA1_Channel11                GPDMA1_Channel11_NS
#define GPDMA1_Channel11_BASE           GPDMA1_Channel11_BASE_NS
#define GPIOA                           GPIOA_NS
#define GPIOA_BASE                      GPIOA_BASE_NS
#define GPIOB                           GPIOB_NS
#define GPIOB_BASE                      GPIOB_BASE_NS
#define GPIOC                           GPIOC_NS
#define GPIOC_BASE                      GPIOC_BASE_NS
#define GPIOD                           GPIOD_NS
#define GPIOD_BASE                      GPIOD_BASE_NS
#if !$U3_256K$
#define GPIOE                           GPIOE_NS
#define GPIOE_BASE                      GPIOE_BASE_NS
#endif /*!$U3_256K$*/
#if $U3_2M$ || $U3_1M5$
#define GPIOF                           GPIOF_NS
#define GPIOF_BASE                      GPIOF_BASE_NS
#endif /* $U3_2M$ || $U3_1M5$ */
#if !$U3_512K$ && !$U3_256K$
#define GPIOG                           GPIOG_NS
#define GPIOG_BASE                      GPIOG_BASE_NS
#endif /* !$U3_512K$ && !$U3_256K$ */
#define GPIOH                           GPIOH_NS
#define GPIOH_BASE                      GPIOH_BASE_NS
#define GTZC_MPCBB1                     GTZC_MPCBB1_NS
#define GTZC_MPCBB1_BASE                GTZC_MPCBB1_BASE_NS
#define GTZC_MPCBB2                     GTZC_MPCBB2_NS
#define GTZC_MPCBB2_BASE                GTZC_MPCBB2_BASE_NS
#if $U3_2M$ || $U3_1M5$
#define GTZC_MPCBB3                     GTZC_MPCBB3_NS
#define GTZC_MPCBB3_BASE                GTZC_MPCBB3_BASE_NS
#define GTZC_MPCBB4                     GTZC_MPCBB4_NS
#define GTZC_MPCBB4_BASE                GTZC_MPCBB4_BASE_NS
#endif /* $U3_2M$ || $U3_1M5$ */
#define GTZC_TZSC1                      GTZC_TZSC1_NS
#define GTZC_TZSC1_BASE                 GTZC_TZSC1_BASE_NS
#define HASH                            HASH_NS
#define HASH_BASE                       HASH_BASE_NS
#define HASH_DIGEST                     HASH_DIGEST_NS
#define HASH_DIGEST_BASE                HASH_DIGEST_BASE_NS
#define I2C1                            I2C1_NS
#define I2C1_BASE                       I2C1_BASE_NS
#if !$U3_512K$ && !$U3_256K$
#define I2C2                            I2C2_NS
#define I2C2_BASE                       I2C2_BASE_NS
#endif /* !$U3_512K$ && !$U3_256K$*/
#define I2C3                            I2C3_NS
#define I2C3_BASE                       I2C3_BASE_NS
#if $U3_2M$
#define I2C4                            I2C4_NS
#define I2C4_BASE                       I2C4_BASE_NS
#endif /* $U3_2M$ */
#define I3C1                            I3C1_NS
#define I3C1_BASE                       I3C1_BASE_NS
#if !$U3_512K$ && !$U3_256K$
#define I3C2                            I3C2_NS
#define I3C2_BASE                       I3C2_BASE_NS
#endif /* !$U3_512K$ && !$U3_256K$ */
#if $U3_2M$ || $U3_1M5$
#define HSP1                            HSP1_NS
#define HSP1_BASE                       HSP1_BASE_NS
#endif /* $U3_2M$ || $U3_1M5$ */
#define ICACHE                          ICACHE_NS
#define ICACHE_BASE                     ICACHE_BASE_NS
#define IWDG                            IWDG_NS
#define IWDG_BASE                       IWDG_BASE_NS
#if $U3_LCD$
#define LCD                             LCD_NS
#define LCD_BASE                        LCD_BASE_NS
#endif /* $U3_LCD */
#define LPTIM1                          LPTIM1_NS
#define LPTIM1_BASE                     LPTIM1_BASE_NS
#define LPTIM2                          LPTIM2_NS
#define LPTIM2_BASE                     LPTIM2_BASE_NS
#define LPTIM3                          LPTIM3_NS
#define LPTIM3_BASE                     LPTIM3_BASE_NS
#define LPTIM4                          LPTIM4_NS
#define LPTIM4_BASE                     LPTIM4_BASE_NS
#define LPUART1                         LPUART1_NS
#define LPUART1_BASE                    LPUART1_BASE_NS
#define OCTOSPI1                        OCTOSPI1_NS
#define OCTOSPI1_R_BASE                 OCTOSPI1_R_BASE_NS
#define OPAMP1                          OPAMP1_NS
#define OPAMP1_BASE                     OPAMP1_BASE_NS
#define OPAMP2                          OPAMP2_NS
#define OPAMP2_BASE                     OPAMP2_BASE_NS
#define OPAMP12_COMMON                  OPAMP12_COMMON_NS
#define OPAMP12_COMMON_BASE             OPAMP12_COMMON_BASE_NS
#if !$U3_256K$
#define PKA                             PKA_NS
#define PKA_BASE                        PKA_BASE_NS
#define PKA_RAM_BASE                    PKA_RAM_BASE_NS
#endif /*!$U3_256K$*/
#define PWR                             PWR_NS
#define PWR_BASE                        PWR_BASE_NS
#define RAMCFG_SRAM1                    RAMCFG_SRAM1_NS
#define RAMCFG_SRAM1_BASE               RAMCFG_SRAM1_BASE_NS
#define RAMCFG_SRAM2                    RAMCFG_SRAM2_NS
#define RAMCFG_SRAM2_BASE               RAMCFG_SRAM2_BASE_NS
#if $U3_2M$ || $U3_1M5$
#define RAMCFG_SRAM3                    RAMCFG_SRAM3_NS
#define RAMCFG_SRAM3_BASE               RAMCFG_SRAM3_BASE_NS
#endif /* $U3_2M$ || $U3_1M5$ */
#define RCC                             RCC_NS
#define RCC_BASE                        RCC_BASE_NS
#define RNG                             RNG_NS
#define RNG_BASE                        RNG_BASE_NS
#define RTC                             RTC_NS
#define RTC_BASE                        RTC_BASE_NS
#if $U3_CRYPTO$ && !$U3_256K$
#define SAES                            SAES_NS
#define SAES_BASE                       SAES_BASE_NS
#endif /* $U3_CRYPTO$ && !$U3_256K$*/
#if !$U3_512K$ && !$U3_256K$
#define SAI1                            SAI1_NS
#define SAI1_BASE                       SAI1_BASE_NS
#define SAI1_Block_A                    SAI1_Block_A_NS
#define SAI1_Block_A_BASE               SAI1_Block_A_BASE_NS
#define SAI1_Block_B                    SAI1_Block_B_NS
#define SAI1_Block_B_BASE               SAI1_Block_B_BASE_NS
#endif /* !$U3_512K$ && !$U3_256K$*/
#if !$U3_512K$ && !$U3_256K$
#define SDMMC1                          SDMMC1_NS
#define SDMMC1_BASE                     SDMMC1_BASE_NS
#endif /* !$U3_512K$ && !$U3_256K$*/
#define SPI1                            SPI1_NS
#define SPI1_BASE                       SPI1_BASE_NS
#define SPI2                            SPI2_NS
#define SPI2_BASE                       SPI2_BASE_NS
#if !$U3_256K$
#define SPI3                            SPI3_NS
#define SPI3_BASE                       SPI3_BASE_NS
#endif /*!$U3_256K$*/
#if $U3_2M$
#define SPI4                            SPI4_NS
#define SPI4_BASE                       SPI4_BASE_NS
#endif /* $U3_2M$ */
#define SRAMCAN_BASE                    SRAMCAN_BASE_NS
#define SYSCFG                          SYSCFG_NS
#define SYSCFG_BASE                     SYSCFG_BASE_NS
#define TAMP                            TAMP_NS
#define TAMP_BASE                       TAMP_BASE_NS
#define TIM1                            TIM1_NS
#define TIM1_BASE                       TIM1_BASE_NS
#define TIM2                            TIM2_NS
#define TIM2_BASE                       TIM2_BASE_NS
#define TIM3                            TIM3_NS
#define TIM3_BASE                       TIM3_BASE_NS
#define TIM4                            TIM4_NS
#define TIM4_BASE                       TIM4_BASE_NS
#define TIM6                            TIM6_NS
#define TIM6_BASE                       TIM6_BASE_NS
#define TIM7                            TIM7_NS
#define TIM7_BASE                       TIM7_BASE_NS
#if $U3_2M$ || $U3_1M5$
#define TIM12                           TIM12_NS
#define TIM12_BASE                      TIM12_BASE_NS
#endif /* $U3_2M$ || $U3_1M5$ */
#define TIM15                           TIM15_NS
#define TIM15_BASE                      TIM15_BASE_NS
#define TIM16                           TIM16_NS
#define TIM16_BASE                      TIM16_BASE_NS
#define TIM17                           TIM17_NS
#define TIM17_BASE                      TIM17_BASE_NS
#define TSC                             TSC_NS
#define TSC_BASE                        TSC_BASE_NS
#define UART4                           UART4_NS
#define UART4_BASE                      UART4_BASE_NS
#if !$U3_256K$
#define UART5                           UART5_NS
#define UART5_BASE                      UART5_BASE_NS
#endif /*!$U3_256K$*/
#if $U3_2M$ || $U3_1M5$
#define TIM8                            TIM8_NS
#define TIM8_BASE                       TIM8_BASE_NS
#endif /* $U3_2M$ || $U3_1M5$*/
#define USART1                          USART1_NS
#define USART1_BASE                     USART1_BASE_NS
#if $U3_2M$ || $U3_1M5$
#define USART2                          USART2_NS
#define USART2_BASE                     USART2_BASE_NS
#endif /* $U3_2M$ || $U3_1M5$ */
#define USART3                          USART3_NS
#define USART3_BASE                     USART3_BASE_NS
#define USB_DRD_FS                      USB_DRD_FS_NS
#define USB_DRD_BASE                    USB_DRD_BASE_NS
#define USB_DRD_PMAADDR                 USB_DRD_PMAADDR_NS
#define USB_DRD_PMA_BUFF                USB_DRD_PMA_BUFF_NS
#if !$U3_256K$
#define VREFBUF                         VREFBUF_NS
#define VREFBUF_BASE                    VREFBUF_BASE_NS
#endif /*!$U3_256K$*/
#define WWDG                            WWDG_NS
#define WWDG_BASE                       WWDG_BASE_NS
#endif /* CPU_IN_SECURE_STATE */

/** @addtogroup Exported_constants
  * @{
  */

/** @addtogroup Hardware_Constant_Definition
  * @{
  */
#define LSI_STARTUP_TIME                16000U /*!< LSI Maximum startup time in us : 4 cycles @ 250 Hz = 16 ms */
/**
  * @}
  */

/** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter (ADC)                   */
/*                                                                            */
/******************************************************************************/

/* Specific device feature definitions */
#if !$U3_256K$
#define ADC_MULTIMODE_SUPPORT         /*!< ADC feature available only on specific devices: multimode available on devices with several ADC instances */
#endif/*!$U3_256K$*/

/********************  Bit definition for ADC_ISR register  *******************/
#define ADC_ISR_ADRDY_Pos                   (0UL)
#define ADC_ISR_ADRDY_Msk                   (0x1UL << ADC_ISR_ADRDY_Pos)            /*!< 0x00000001 */
#define ADC_ISR_ADRDY                       ADC_ISR_ADRDY_Msk                       /*!< ADC ready flag */
#define ADC_ISR_EOSMP_Pos                   (1UL)
#define ADC_ISR_EOSMP_Msk                   (0x1UL << ADC_ISR_EOSMP_Pos)            /*!< 0x00000002 */
#define ADC_ISR_EOSMP                       ADC_ISR_EOSMP_Msk                       /*!< ADC group regular end of sampling flag */
#define ADC_ISR_EOC_Pos                     (2UL)
#define ADC_ISR_EOC_Msk                     (0x1UL << ADC_ISR_EOC_Pos)              /*!< 0x00000004 */
#define ADC_ISR_EOC                         ADC_ISR_EOC_Msk                         /*!< ADC group regular end of unitary conversion flag */
#define ADC_ISR_EOS_Pos                     (3UL)
#define ADC_ISR_EOS_Msk                     (0x1UL << ADC_ISR_EOS_Pos)              /*!< 0x00000008 */
#define ADC_ISR_EOS                         ADC_ISR_EOS_Msk                         /*!< ADC group regular end of sequence conversions flag */
#define ADC_ISR_OVR_Pos                     (4UL)
#define ADC_ISR_OVR_Msk                     (0x1UL << ADC_ISR_OVR_Pos)              /*!< 0x00000010 */
#define ADC_ISR_OVR                         ADC_ISR_OVR_Msk                         /*!< ADC group regular overrun flag */
#define ADC_ISR_JEOC_Pos                    (5UL)
#define ADC_ISR_JEOC_Msk                    (0x1UL << ADC_ISR_JEOC_Pos)             /*!< 0x00000020 */
#define ADC_ISR_JEOC                        ADC_ISR_JEOC_Msk                        /*!< ADC group injected end of unitary conversion flag */
#define ADC_ISR_JEOS_Pos                    (6UL)
#define ADC_ISR_JEOS_Msk                    (0x1UL << ADC_ISR_JEOS_Pos)             /*!< 0x00000040 */
#define ADC_ISR_JEOS                        ADC_ISR_JEOS_Msk                        /*!< ADC group injected end of sequence conversions flag */
#define ADC_ISR_AWD1_Pos                    (7UL)
#define ADC_ISR_AWD1_Msk                    (0x1UL << ADC_ISR_AWD1_Pos)             /*!< 0x00000080 */
#define ADC_ISR_AWD1                        ADC_ISR_AWD1_Msk                        /*!< ADC analog watchdog 1 flag */
#define ADC_ISR_AWD2_Pos                    (8UL)
#define ADC_ISR_AWD2_Msk                    (0x1UL << ADC_ISR_AWD2_Pos)             /*!< 0x00000100 */
#define ADC_ISR_AWD2                        ADC_ISR_AWD2_Msk                        /*!< ADC analog watchdog 2 flag */
#define ADC_ISR_AWD3_Pos                    (9UL)
#define ADC_ISR_AWD3_Msk                    (0x1UL << ADC_ISR_AWD3_Pos)             /*!< 0x00000200 */
#define ADC_ISR_AWD3                        ADC_ISR_AWD3_Msk                        /*!< ADC analog watchdog 3 flag */
#define ADC_ISR_JQOVF_Pos                   (10UL)
#define ADC_ISR_JQOVF_Msk                   (0x1UL << ADC_ISR_JQOVF_Pos)            /*!< 0x00000400 */
#define ADC_ISR_JQOVF                       ADC_ISR_JQOVF_Msk                       /*!< ADC group injected contexts queue overflow flag */
#define ADC_ISR_LDORDY_Pos                  (12UL)
#define ADC_ISR_LDORDY_Msk                  (0x1UL << ADC_ISR_LDORDY_Pos)           /*!< 0x00001000 */
#define ADC_ISR_LDORDY                      ADC_ISR_LDORDY_Msk                      /*!< ADC internal voltage regulator output ready flag */

/********************  Bit definition for ADC_IER register  *******************/
#define ADC_IER_ADRDYIE_Pos                 (0UL)
#define ADC_IER_ADRDYIE_Msk                 (0x1UL << ADC_IER_ADRDYIE_Pos)          /*!< 0x00000001 */
#define ADC_IER_ADRDYIE                     ADC_IER_ADRDYIE_Msk                     /*!< ADC ready interrupt */
#define ADC_IER_EOSMPIE_Pos                 (1UL)
#define ADC_IER_EOSMPIE_Msk                 (0x1UL << ADC_IER_EOSMPIE_Pos)          /*!< 0x00000002 */
#define ADC_IER_EOSMPIE                     ADC_IER_EOSMPIE_Msk                     /*!< ADC group regular end of sampling interrupt */
#define ADC_IER_EOCIE_Pos                   (2UL)
#define ADC_IER_EOCIE_Msk                   (0x1UL << ADC_IER_EOCIE_Pos)            /*!< 0x00000004 */
#define ADC_IER_EOCIE                       ADC_IER_EOCIE_Msk                       /*!< ADC group regular end of unitary conversion interrupt */
#define ADC_IER_EOSIE_Pos                   (3UL)
#define ADC_IER_EOSIE_Msk                   (0x1UL << ADC_IER_EOSIE_Pos)            /*!< 0x00000008 */
#define ADC_IER_EOSIE                       ADC_IER_EOSIE_Msk                       /*!< ADC group regular end of sequence conversions interrupt */
#define ADC_IER_OVRIE_Pos                   (4UL)
#define ADC_IER_OVRIE_Msk                   (0x1UL << ADC_IER_OVRIE_Pos)            /*!< 0x00000010 */
#define ADC_IER_OVRIE                       ADC_IER_OVRIE_Msk                       /*!< ADC group regular overrun interrupt */
#define ADC_IER_JEOCIE_Pos                  (5UL)
#define ADC_IER_JEOCIE_Msk                  (0x1UL << ADC_IER_JEOCIE_Pos)           /*!< 0x00000020 */
#define ADC_IER_JEOCIE                      ADC_IER_JEOCIE_Msk                      /*!< ADC group injected end of unitary conversion interrupt */
#define ADC_IER_JEOSIE_Pos                  (6UL)
#define ADC_IER_JEOSIE_Msk                  (0x1UL << ADC_IER_JEOSIE_Pos)           /*!< 0x00000040 */
#define ADC_IER_JEOSIE                      ADC_IER_JEOSIE_Msk                      /*!< ADC group injected end of sequence conversions interrupt */
#define ADC_IER_AWD1IE_Pos                  (7UL)
#define ADC_IER_AWD1IE_Msk                  (0x1UL << ADC_IER_AWD1IE_Pos)           /*!< 0x00000080 */
#define ADC_IER_AWD1IE                      ADC_IER_AWD1IE_Msk                      /*!< ADC analog watchdog 1 interrupt */
#define ADC_IER_AWD2IE_Pos                  (8UL)
#define ADC_IER_AWD2IE_Msk                  (0x1UL << ADC_IER_AWD2IE_Pos)           /*!< 0x00000100 */
#define ADC_IER_AWD2IE                      ADC_IER_AWD2IE_Msk                      /*!< ADC analog watchdog 2 interrupt */
#define ADC_IER_AWD3IE_Pos                  (9UL)
#define ADC_IER_AWD3IE_Msk                  (0x1UL << ADC_IER_AWD3IE_Pos)           /*!< 0x00000200 */
#define ADC_IER_AWD3IE                      ADC_IER_AWD3IE_Msk                      /*!< ADC analog watchdog 3 interrupt */
#define ADC_IER_JQOVFIE_Pos                 (10UL)
#define ADC_IER_JQOVFIE_Msk                 (0x1UL << ADC_IER_JQOVFIE_Pos)          /*!< 0x00000400 */
#define ADC_IER_JQOVFIE                     ADC_IER_JQOVFIE_Msk                     /*!< ADC group injected contexts queue overflow interrupt */
#define ADC_IER_LDORDYIE_Pos                (12UL)
#define ADC_IER_LDORDYIE_Msk                (0x1UL << ADC_IER_LDORDYIE_Pos)         /*!< 0x00001000 */
#define ADC_IER_LDORDYIE                    ADC_IER_LDORDYIE_Msk                    /*!< ADC internal voltage regulator interrupt*/

/********************  Bit definition for ADC_CR register  ********************/
#define ADC_CR_ADEN_Pos                     (0UL)
#define ADC_CR_ADEN_Msk                     (0x1UL << ADC_CR_ADEN_Pos)              /*!< 0x00000001 */
#define ADC_CR_ADEN                         ADC_CR_ADEN_Msk                         /*!< ADC enable */
#define ADC_CR_ADDIS_Pos                    (1UL)
#define ADC_CR_ADDIS_Msk                    (0x1UL << ADC_CR_ADDIS_Pos)             /*!< 0x00000002 */
#define ADC_CR_ADDIS                        ADC_CR_ADDIS_Msk                        /*!< ADC disable */
#define ADC_CR_ADSTART_Pos                  (2UL)
#define ADC_CR_ADSTART_Msk                  (0x1UL << ADC_CR_ADSTART_Pos)           /*!< 0x00000004 */
#define ADC_CR_ADSTART                      ADC_CR_ADSTART_Msk                      /*!< ADC group regular conversion start */
#define ADC_CR_JADSTART_Pos                 (3UL)
#define ADC_CR_JADSTART_Msk                 (0x1UL << ADC_CR_JADSTART_Pos)          /*!< 0x00000008 */
#define ADC_CR_JADSTART                     ADC_CR_JADSTART_Msk                     /*!< ADC group injected conversion start */
#define ADC_CR_ADSTP_Pos                    (4UL)
#define ADC_CR_ADSTP_Msk                    (0x1UL << ADC_CR_ADSTP_Pos)             /*!< 0x00000010 */
#define ADC_CR_ADSTP                        ADC_CR_ADSTP_Msk                        /*!< ADC group regular conversion stop */
#define ADC_CR_JADSTP_Pos                   (5UL)
#define ADC_CR_JADSTP_Msk                   (0x1UL << ADC_CR_JADSTP_Pos)            /*!< 0x00000020 */
#define ADC_CR_JADSTP                       ADC_CR_JADSTP_Msk                       /*!< ADC group injected conversion stop */
#define ADC_CR_ADVREGEN_Pos                 (28UL)
#define ADC_CR_ADVREGEN_Msk                 (0x1UL << ADC_CR_ADVREGEN_Pos)          /*!< 0x10000000 */
#define ADC_CR_ADVREGEN                     ADC_CR_ADVREGEN_Msk                     /*!< ADC internal voltage regulator */
#define ADC_CR_DEEPPWD_Pos                  (29UL)
#define ADC_CR_DEEPPWD_Msk                  (0x1UL << ADC_CR_DEEPPWD_Pos)           /*!< 0x20000000 */
#define ADC_CR_DEEPPWD                      ADC_CR_DEEPPWD_Msk                      /*!< ADC deep power down enable */
#define ADC_CR_ADCAL_Pos                    (31UL)
#define ADC_CR_ADCAL_Msk                    (0x1UL << ADC_CR_ADCAL_Pos)             /*!< 0x80000000 */
#define ADC_CR_ADCAL                        ADC_CR_ADCAL_Msk                        /*!< ADC calibration */

