STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
#define ADC_JSQR_JSQ3_Pos                   (21UL)
#define ADC_JSQR_JSQ3_Msk                   (0x1FUL << ADC_JSQR_JSQ3_Pos)           /*!< 0x03E00000 */
#define ADC_JSQR_JSQ3                       ADC_JSQR_JSQ3_Msk                       /*!< ADC group injected sequencer rank 3 */
#define ADC_JSQR_JSQ3_0                     (0x01UL << ADC_JSQR_JSQ3_Pos)           /*!< 0x00200000 */
#define ADC_JSQR_JSQ3_1                     (0x02UL << ADC_JSQR_JSQ3_Pos)           /*!< 0x00400000 */
#define ADC_JSQR_JSQ3_2                     (0x04UL << ADC_JSQR_JSQ3_Pos)           /*!< 0x00800000 */
#define ADC_JSQR_JSQ3_3                     (0x08UL << ADC_JSQR_JSQ3_Pos)           /*!< 0x01000000 */
#define ADC_JSQR_JSQ3_4                     (0x10UL << ADC_JSQR_JSQ3_Pos)           /*!< 0x02000000 */

#define ADC_JSQR_JSQ4_Pos                   (27UL)
#define ADC_JSQR_JSQ4_Msk                   (0x1FUL << ADC_JSQR_JSQ4_Pos)           /*!< 0xF8000000 */
#define ADC_JSQR_JSQ4                       ADC_JSQR_JSQ4_Msk                       /*!< ADC group injected sequencer rank 4 */
#define ADC_JSQR_JSQ4_0                     (0x01UL << ADC_JSQR_JSQ4_Pos)           /*!< 0x08000000 */
#define ADC_JSQR_JSQ4_1                     (0x02UL << ADC_JSQR_JSQ4_Pos)           /*!< 0x10000000 */
#define ADC_JSQR_JSQ4_2                     (0x04UL << ADC_JSQR_JSQ4_Pos)           /*!< 0x20000000 */
#define ADC_JSQR_JSQ4_3                     (0x08UL << ADC_JSQR_JSQ4_Pos)           /*!< 0x40000000 */
#define ADC_JSQR_JSQ4_4                     (0x10UL << ADC_JSQR_JSQ4_Pos)           /*!< 0x80000000 */

/********************  Bit definition for ADC_OFCFGR1 register  ***************/
#define ADC_OFCFGR1_POSOFF_Pos              (24UL)
#define ADC_OFCFGR1_POSOFF_Msk              (0x01UL << ADC_OFCFGR1_POSOFF_Pos)      /*!< 0x01000000 */
#define ADC_OFCFGR1_POSOFF                  ADC_OFCFGR1_POSOFF_Msk                  /*!< ADC offset instance 1 positive offset enable */

#define ADC_OFCFGR1_USAT_Pos                (25UL)
#define ADC_OFCFGR1_USAT_Msk                (0x01UL << ADC_OFCFGR1_USAT_Pos)        /*!< 0x02000000 */
#define ADC_OFCFGR1_USAT                    ADC_OFCFGR1_USAT_Msk                    /*!< ADC offset instance 1  unsigned saturation value */

#define ADC_OFCFGR1_SSAT_Pos                (26UL)
#define ADC_OFCFGR1_SSAT_Msk                (0x01UL << ADC_OFCFGR1_SSAT_Pos)        /*!< 0x04000000 */
#define ADC_OFCFGR1_SSAT                    ADC_OFCFGR1_SSAT_Msk                    /*!< ADC offset instance 1 signed satuaration enable */

#define ADC_OFCFGR1_OFFSET_CH_Pos           (27UL)
#define ADC_OFCFGR1_OFFSET_CH_Msk           (0x1FUL << ADC_OFCFGR1_OFFSET_CH_Pos)   /*!< 0xF8000000 */
#define ADC_OFCFGR1_OFFSET_CH               ADC_OFCFGR1_OFFSET_CH_Msk               /*!< ADC offset instance 1 channel selection */
#define ADC_OFCFGR1_OFFSET_CH_0             (0x01UL << ADC_OFCFGR1_OFFSET_CH_Pos)   /*!< 0x08000000 */
#define ADC_OFCFGR1_OFFSET_CH_1             (0x02UL << ADC_OFCFGR1_OFFSET_CH_Pos)   /*!< 0x10000000 */
#define ADC_OFCFGR1_OFFSET_CH_2             (0x03UL << ADC_OFCFGR1_OFFSET_CH_Pos)   /*!< 0x20000000 */
#define ADC_OFCFGR1_OFFSET_CH_3             (0x04UL << ADC_OFCFGR1_OFFSET_CH_Pos)   /*!< 0x40000000 */
#define ADC_OFCFGR1_OFFSET_CH_4             (0x05UL << ADC_OFCFGR1_OFFSET_CH_Pos)   /*!< 0x80000000 */

/********************  Bit definition for ADC_OFCFGR2 register  ***************/
#define ADC_OFCFGR2_POSOFF_Pos              (24UL)
#define ADC_OFCFGR2_POSOFF_Msk              (0x01UL << ADC_OFCFGR2_POSOFF_Pos)      /*!< 0x01000000 */
#define ADC_OFCFGR2_POSOFF                  ADC_OFCFGR2_POSOFF_Msk                  /*!< ADC offset instance 2 positive offset enable */

#define ADC_OFCFGR2_USAT_Pos                (25UL)
#define ADC_OFCFGR2_USAT_Msk                (0x01UL << ADC_OFCFGR2_USAT_Pos)        /*!< 0x02000000 */
#define ADC_OFCFGR2_USAT                    ADC_OFCFGR2_USAT_Msk                    /*!< ADC offset instance 2 unsigned saturation value */

#define ADC_OFCFGR2_SSAT_Pos                (26UL)
#define ADC_OFCFGR2_SSAT_Msk                (0x01UL << ADC_OFCFGR2_SSAT_Pos)        /*!< 0x04000000 */
#define ADC_OFCFGR2_SSAT                    ADC_OFCFGR2_SSAT_Msk                    /*!< ADC offset instance 2 signed satuaration enable */

#define ADC_OFCFGR2_OFFSET_CH_Pos           (27UL)
#define ADC_OFCFGR2_OFFSET_CH_Msk           (0x1FUL << ADC_OFCFGR2_OFFSET_CH_Pos)   /*!< 0xF8000000 */
#define ADC_OFCFGR2_OFFSET_CH               ADC_OFCFGR2_OFFSET_CH_Msk               /*!< ADC offset instance 2 channel selection */
#define ADC_OFCFGR2_OFFSET_CH_0             (0x01UL << ADC_OFCFGR2_OFFSET_CH_Pos)   /*!< 0x08000000 */
#define ADC_OFCFGR2_OFFSET_CH_1             (0x02UL << ADC_OFCFGR2_OFFSET_CH_Pos)   /*!< 0x10000000 */
#define ADC_OFCFGR2_OFFSET_CH_2             (0x03UL << ADC_OFCFGR2_OFFSET_CH_Pos)   /*!< 0x20000000 */
#define ADC_OFCFGR2_OFFSET_CH_3             (0x04UL << ADC_OFCFGR2_OFFSET_CH_Pos)   /*!< 0x40000000 */
#define ADC_OFCFGR2_OFFSET_CH_4             (0x05UL << ADC_OFCFGR2_OFFSET_CH_Pos)   /*!< 0x80000000 */

/********************  Bit definition for ADC_OFCFGR3 register  ***************/
#define ADC_OFCFGR3_POSOFF_Pos              (24UL)
#define ADC_OFCFGR3_POSOFF_Msk              (0x01UL << ADC_OFCFGR3_POSOFF_Pos)      /*!< 0x01000000 */
#define ADC_OFCFGR3_POSOFF                  ADC_OFCFGR3_POSOFF_Msk                  /*!< ADC offset instance 3 positive offset enable */

#define ADC_OFCFGR3_USAT_Pos                (25UL)
#define ADC_OFCFGR3_USAT_Msk                (0x01UL << ADC_OFCFGR3_USAT_Pos)        /*!< 0x02000000 */
#define ADC_OFCFGR3_USAT                    ADC_OFCFGR3_USAT_Msk                    /*!< ADC offset instance 3 unsigned saturation value */

#define ADC_OFCFGR3_SSAT_Pos                (26UL)
#define ADC_OFCFGR3_SSAT_Msk                (0x01UL << ADC_OFCFGR3_SSAT_Pos)        /*!< 0x04000000 */
#define ADC_OFCFGR3_SSAT                    ADC_OFCFGR3_SSAT_Msk                    /*!< ADC offset instance 3 signed satuaration enable */

#define ADC_OFCFGR3_OFFSET_CH_Pos           (27UL)
#define ADC_OFCFGR3_OFFSET_CH_Msk           (0x1FUL << ADC_OFCFGR3_OFFSET_CH_Pos)   /*!< 0xF8000000 */
#define ADC_OFCFGR3_OFFSET_CH               ADC_OFCFGR3_OFFSET_CH_Msk               /*!< ADC offset instance 3 channel selection for the data offset */
#define ADC_OFCFGR3_OFFSET_CH_0             (0x01UL << ADC_OFCFGR3_OFFSET_CH_Pos)   /*!< 0x08000000 */
#define ADC_OFCFGR3_OFFSET_CH_1             (0x02UL << ADC_OFCFGR3_OFFSET_CH_Pos)   /*!< 0x10000000 */
#define ADC_OFCFGR3_OFFSET_CH_2             (0x03UL << ADC_OFCFGR3_OFFSET_CH_Pos)   /*!< 0x20000000 */
#define ADC_OFCFGR3_OFFSET_CH_3             (0x04UL << ADC_OFCFGR3_OFFSET_CH_Pos)   /*!< 0x40000000 */
#define ADC_OFCFGR3_OFFSET_CH_4             (0x05UL << ADC_OFCFGR3_OFFSET_CH_Pos)   /*!< 0x80000000 */

/********************  Bit definition for ADC_OFCFGR4 register  ***************/
#define ADC_OFCFGR4_POSOFF_Pos              (24UL)
#define ADC_OFCFGR4_POSOFF_Msk              (0x01UL << ADC_OFCFGR4_POSOFF_Pos)      /*!< 0x01000000 */
#define ADC_OFCFGR4_POSOFF                  ADC_OFCFGR4_POSOFF_Msk                  /*!< ADC offset instance 4 positive offset enable */

#define ADC_OFCFGR4_USAT_Pos                (25UL)
#define ADC_OFCFGR4_USAT_Msk                (0x01UL << ADC_OFCFGR4_USAT_Pos)        /*!< 0x02000000 */
#define ADC_OFCFGR4_USAT                    ADC_OFCFGR4_USAT_Msk                    /*!< ADC offset instance 4 unsigned saturation value */

#define ADC_OFCFGR4_SSAT_Pos                (26UL)
#define ADC_OFCFGR4_SSAT_Msk                (0x01UL << ADC_OFCFGR4_SSAT_Pos)        /*!< 0x04000000 */
#define ADC_OFCFGR4_SSAT                    ADC_OFCFGR4_SSAT_Msk                    /*!< ADC offset instance 4 signed satuaration enable */

