STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
#endif /* $U3_512K$ */
#if $U3_2M$
/*******************  Bit definition for FLASH_SECBB2R5 register  ******************/
#define FLASH_SECBB2R5_SEC0_Pos                   (0UL)
#define FLASH_SECBB2R5_SEC0_Msk                   (0x1UL << FLASH_SECBB2R5_SEC0_Pos)            /*!< 0x00000001 */
#define FLASH_SECBB2R5_SEC0                       FLASH_SECBB2R5_SEC0_Msk                       /*!< Page 96 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC1_Pos                   (1UL)
#define FLASH_SECBB2R5_SEC1_Msk                   (0x1UL << FLASH_SECBB2R5_SEC1_Pos)            /*!< 0x00000002 */
#define FLASH_SECBB2R5_SEC1                       FLASH_SECBB2R5_SEC1_Msk                       /*!< Page 97 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC2_Pos                   (2UL)
#define FLASH_SECBB2R5_SEC2_Msk                   (0x1UL << FLASH_SECBB2R5_SEC2_Pos)            /*!< 0x00000004 */
#define FLASH_SECBB2R5_SEC2                       FLASH_SECBB2R5_SEC2_Msk                       /*!< Page 98 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC3_Pos                   (3UL)
#define FLASH_SECBB2R5_SEC3_Msk                   (0x1UL << FLASH_SECBB2R5_SEC3_Pos)            /*!< 0x00000008 */
#define FLASH_SECBB2R5_SEC3                       FLASH_SECBB2R5_SEC3_Msk                       /*!< Page 99 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC4_Pos                   (4UL)
#define FLASH_SECBB2R5_SEC4_Msk                   (0x1UL << FLASH_SECBB2R5_SEC4_Pos)            /*!< 0x00000010 */
#define FLASH_SECBB2R5_SEC4                       FLASH_SECBB2R5_SEC4_Msk                       /*!< Page 100 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC5_Pos                   (5UL)
#define FLASH_SECBB2R5_SEC5_Msk                   (0x1UL << FLASH_SECBB2R5_SEC5_Pos)            /*!< 0x00000020 */
#define FLASH_SECBB2R5_SEC5                       FLASH_SECBB2R5_SEC5_Msk                       /*!< Page 101 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC6_Pos                   (6UL)
#define FLASH_SECBB2R5_SEC6_Msk                   (0x1UL << FLASH_SECBB2R5_SEC6_Pos)            /*!< 0x00000040 */
#define FLASH_SECBB2R5_SEC6                       FLASH_SECBB2R5_SEC6_Msk                       /*!< Page 102 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC7_Pos                   (7UL)
#define FLASH_SECBB2R5_SEC7_Msk                   (0x1UL << FLASH_SECBB2R5_SEC7_Pos)            /*!< 0x00000080 */
#define FLASH_SECBB2R5_SEC7                       FLASH_SECBB2R5_SEC7_Msk                       /*!< Page 103 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC8_Pos                   (8UL)
#define FLASH_SECBB2R5_SEC8_Msk                   (0x1UL << FLASH_SECBB2R5_SEC8_Pos)            /*!< 0x00000100 */
#define FLASH_SECBB2R5_SEC8                       FLASH_SECBB2R5_SEC8_Msk                       /*!< Page 104 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC9_Pos                   (9UL)
#define FLASH_SECBB2R5_SEC9_Msk                   (0x1UL << FLASH_SECBB2R5_SEC9_Pos)            /*!< 0x00000200 */
#define FLASH_SECBB2R5_SEC9                       FLASH_SECBB2R5_SEC9_Msk                       /*!< Page 105 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC10_Pos                  (10UL)
#define FLASH_SECBB2R5_SEC10_Msk                  (0x1UL << FLASH_SECBB2R5_SEC10_Pos)           /*!< 0x00000400 */
#define FLASH_SECBB2R5_SEC10                      FLASH_SECBB2R5_SEC10_Msk                      /*!< Page 106 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC11_Pos                  (11UL)
#define FLASH_SECBB2R5_SEC11_Msk                  (0x1UL << FLASH_SECBB2R5_SEC11_Pos)           /*!< 0x00000800 */
#define FLASH_SECBB2R5_SEC11                      FLASH_SECBB2R5_SEC11_Msk                      /*!< Page 107 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC12_Pos                  (12UL)
#define FLASH_SECBB2R5_SEC12_Msk                  (0x1UL << FLASH_SECBB2R5_SEC12_Pos)           /*!< 0x00001000 */
#define FLASH_SECBB2R5_SEC12                      FLASH_SECBB2R5_SEC12_Msk                      /*!< Page 108 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC13_Pos                  (13UL)
#define FLASH_SECBB2R5_SEC13_Msk                  (0x1UL << FLASH_SECBB2R5_SEC13_Pos)           /*!< 0x00002000 */
#define FLASH_SECBB2R5_SEC13                      FLASH_SECBB2R5_SEC13_Msk                      /*!< Page 109 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC14_Pos                  (14UL)
#define FLASH_SECBB2R5_SEC14_Msk                  (0x1UL << FLASH_SECBB2R5_SEC14_Pos)           /*!< 0x00004000 */
#define FLASH_SECBB2R5_SEC14                      FLASH_SECBB2R5_SEC14_Msk                      /*!< Page 110 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC15_Pos                  (15UL)
#define FLASH_SECBB2R5_SEC15_Msk                  (0x1UL << FLASH_SECBB2R5_SEC15_Pos)           /*!< 0x00008000 */
#define FLASH_SECBB2R5_SEC15                      FLASH_SECBB2R5_SEC15_Msk                      /*!< Page 111 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC16_Pos                  (16UL)
#define FLASH_SECBB2R5_SEC16_Msk                  (0x1UL << FLASH_SECBB2R5_SEC16_Pos)           /*!< 0x00010000 */
#define FLASH_SECBB2R5_SEC16                      FLASH_SECBB2R5_SEC16_Msk                      /*!< Page 112 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC17_Pos                  (17UL)
#define FLASH_SECBB2R5_SEC17_Msk                  (0x1UL << FLASH_SECBB2R5_SEC17_Pos)           /*!< 0x00020000 */
#define FLASH_SECBB2R5_SEC17                      FLASH_SECBB2R5_SEC17_Msk                      /*!< Page 113 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC18_Pos                  (18UL)
#define FLASH_SECBB2R5_SEC18_Msk                  (0x1UL << FLASH_SECBB2R5_SEC18_Pos)           /*!< 0x00040000 */
#define FLASH_SECBB2R5_SEC18                      FLASH_SECBB2R5_SEC18_Msk                      /*!< Page 114 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC19_Pos                  (19UL)
#define FLASH_SECBB2R5_SEC19_Msk                  (0x1UL << FLASH_SECBB2R5_SEC19_Pos)           /*!< 0x00080000 */
#define FLASH_SECBB2R5_SEC19                      FLASH_SECBB2R5_SEC19_Msk                      /*!< Page 115 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC20_Pos                  (20UL)
#define FLASH_SECBB2R5_SEC20_Msk                  (0x1UL << FLASH_SECBB2R5_SEC20_Pos)           /*!< 0x00100000 */
#define FLASH_SECBB2R5_SEC20                      FLASH_SECBB2R5_SEC20_Msk                      /*!< Page 116 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC21_Pos                  (21UL)
#define FLASH_SECBB2R5_SEC21_Msk                  (0x1UL << FLASH_SECBB2R5_SEC21_Pos)           /*!< 0x00200000 */
#define FLASH_SECBB2R5_SEC21                      FLASH_SECBB2R5_SEC21_Msk                      /*!< Page 117 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC22_Pos                  (22UL)
#define FLASH_SECBB2R5_SEC22_Msk                  (0x1UL << FLASH_SECBB2R5_SEC22_Pos)           /*!< 0x00400000 */
#define FLASH_SECBB2R5_SEC22                      FLASH_SECBB2R5_SEC22_Msk                      /*!< Page 118 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC23_Pos                  (23UL)
#define FLASH_SECBB2R5_SEC23_Msk                  (0x1UL << FLASH_SECBB2R5_SEC23_Pos)           /*!< 0x00800000 */
#define FLASH_SECBB2R5_SEC23                      FLASH_SECBB2R5_SEC23_Msk                      /*!< Page 119 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC24_Pos                  (24UL)
#define FLASH_SECBB2R5_SEC24_Msk                  (0x1UL << FLASH_SECBB2R5_SEC24_Pos)           /*!< 0x01000000 */
#define FLASH_SECBB2R5_SEC24                      FLASH_SECBB2R5_SEC24_Msk                      /*!< Page 120 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC25_Pos                  (25UL)
#define FLASH_SECBB2R5_SEC25_Msk                  (0x1UL << FLASH_SECBB2R5_SEC25_Pos)           /*!< 0x02000000 */
#define FLASH_SECBB2R5_SEC25                      FLASH_SECBB2R5_SEC25_Msk                      /*!< Page 121 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC26_Pos                  (26UL)
#define FLASH_SECBB2R5_SEC26_Msk                  (0x1UL << FLASH_SECBB2R5_SEC26_Pos)           /*!< 0x04000000 */
#define FLASH_SECBB2R5_SEC26                      FLASH_SECBB2R5_SEC26_Msk                      /*!< Page 122 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC27_Pos                  (27UL)
#define FLASH_SECBB2R5_SEC27_Msk                  (0x1UL << FLASH_SECBB2R5_SEC27_Pos)           /*!< 0x08000000 */
#define FLASH_SECBB2R5_SEC27                      FLASH_SECBB2R5_SEC27_Msk                      /*!< Page 123 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC28_Pos                  (28UL)
#define FLASH_SECBB2R5_SEC28_Msk                  (0x1UL << FLASH_SECBB2R5_SEC28_Pos)           /*!< 0x10000000 */
#define FLASH_SECBB2R5_SEC28                      FLASH_SECBB2R5_SEC28_Msk                      /*!< Page 124 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC29_Pos                  (29UL)
#define FLASH_SECBB2R5_SEC29_Msk                  (0x1UL << FLASH_SECBB2R5_SEC29_Pos)           /*!< 0x20000000 */
#define FLASH_SECBB2R5_SEC29                      FLASH_SECBB2R5_SEC29_Msk                      /*!< Page 125 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC30_Pos                  (30UL)
#define FLASH_SECBB2R5_SEC30_Msk                  (0x1UL << FLASH_SECBB2R5_SEC30_Pos)           /*!< 0x40000000 */
#define FLASH_SECBB2R5_SEC30                      FLASH_SECBB2R5_SEC30_Msk                      /*!< Page 126 in bank 2 block-based secure */
#define FLASH_SECBB2R5_SEC31_Pos                  (31UL)
#define FLASH_SECBB2R5_SEC31_Msk                  (0x1UL << FLASH_SECBB2R5_SEC31_Pos)           /*!< 0x80000000 */
#define FLASH_SECBB2R5_SEC31                      FLASH_SECBB2R5_SEC31_Msk                      /*!< Page 127 in bank 2 block-based secure */

