STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
#endif /* $U3_512K$ */
#if $U3_2M$
/*******************  Bit definition for FLASH_PRIVBB1R5 register  ******************/
#define FLASH_PRIVBB1R5_PRIV0_Pos                   (0UL)
#define FLASH_PRIVBB1R5_PRIV0_Msk                   (0x1UL << FLASH_PRIVBB1R5_PRIV0_Pos)            /*!< 0x00000001 */
#define FLASH_PRIVBB1R5_PRIV0                       FLASH_PRIVBB1R5_PRIV0_Msk                       /*!< Page 96 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV1_Pos                   (1UL)
#define FLASH_PRIVBB1R5_PRIV1_Msk                   (0x1UL << FLASH_PRIVBB1R5_PRIV1_Pos)            /*!< 0x00000002 */
#define FLASH_PRIVBB1R5_PRIV1                       FLASH_PRIVBB1R5_PRIV1_Msk                       /*!< Page 97 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV2_Pos                   (2UL)
#define FLASH_PRIVBB1R5_PRIV2_Msk                   (0x1UL << FLASH_PRIVBB1R5_PRIV2_Pos)            /*!< 0x00000004 */
#define FLASH_PRIVBB1R5_PRIV2                       FLASH_PRIVBB1R5_PRIV2_Msk                       /*!< Page 98 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV3_Pos                   (3UL)
#define FLASH_PRIVBB1R5_PRIV3_Msk                   (0x1UL << FLASH_PRIVBB1R5_PRIV3_Pos)            /*!< 0x00000008 */
#define FLASH_PRIVBB1R5_PRIV3                       FLASH_PRIVBB1R5_PRIV3_Msk                       /*!< Page 99 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV4_Pos                   (4UL)
#define FLASH_PRIVBB1R5_PRIV4_Msk                   (0x1UL << FLASH_PRIVBB1R5_PRIV4_Pos)            /*!< 0x00000010 */
#define FLASH_PRIVBB1R5_PRIV4                       FLASH_PRIVBB1R5_PRIV4_Msk                       /*!< Page 100 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV5_Pos                   (5UL)
#define FLASH_PRIVBB1R5_PRIV5_Msk                   (0x1UL << FLASH_PRIVBB1R5_PRIV5_Pos)            /*!< 0x00000020 */
#define FLASH_PRIVBB1R5_PRIV5                       FLASH_PRIVBB1R5_PRIV5_Msk                       /*!< Page 101 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV6_Pos                   (6UL)
#define FLASH_PRIVBB1R5_PRIV6_Msk                   (0x1UL << FLASH_PRIVBB1R5_PRIV6_Pos)            /*!< 0x00000040 */
#define FLASH_PRIVBB1R5_PRIV6                       FLASH_PRIVBB1R5_PRIV6_Msk                       /*!< Page 102 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV7_Pos                   (7UL)
#define FLASH_PRIVBB1R5_PRIV7_Msk                   (0x1UL << FLASH_PRIVBB1R5_PRIV7_Pos)            /*!< 0x00000080 */
#define FLASH_PRIVBB1R5_PRIV7                       FLASH_PRIVBB1R5_PRIV7_Msk                       /*!< Page 103 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV8_Pos                   (8UL)
#define FLASH_PRIVBB1R5_PRIV8_Msk                   (0x1UL << FLASH_PRIVBB1R5_PRIV8_Pos)            /*!< 0x00000100 */
#define FLASH_PRIVBB1R5_PRIV8                       FLASH_PRIVBB1R5_PRIV8_Msk                       /*!< Page 104 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV9_Pos                   (9UL)
#define FLASH_PRIVBB1R5_PRIV9_Msk                   (0x1UL << FLASH_PRIVBB1R5_PRIV9_Pos)            /*!< 0x00000200 */
#define FLASH_PRIVBB1R5_PRIV9                       FLASH_PRIVBB1R5_PRIV9_Msk                       /*!< Page 105 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV10_Pos                  (10UL)
#define FLASH_PRIVBB1R5_PRIV10_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV10_Pos)           /*!< 0x00000400 */
#define FLASH_PRIVBB1R5_PRIV10                      FLASH_PRIVBB1R5_PRIV10_Msk                      /*!< Page 106 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV11_Pos                  (11UL)
#define FLASH_PRIVBB1R5_PRIV11_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV11_Pos)           /*!< 0x00000800 */
#define FLASH_PRIVBB1R5_PRIV11                      FLASH_PRIVBB1R5_PRIV11_Msk                      /*!< Page 107 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV12_Pos                  (12UL)
#define FLASH_PRIVBB1R5_PRIV12_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV12_Pos)           /*!< 0x00001000 */
#define FLASH_PRIVBB1R5_PRIV12                      FLASH_PRIVBB1R5_PRIV12_Msk                      /*!< Page 108 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV13_Pos                  (13UL)
#define FLASH_PRIVBB1R5_PRIV13_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV13_Pos)           /*!< 0x00002000 */
#define FLASH_PRIVBB1R5_PRIV13                      FLASH_PRIVBB1R5_PRIV13_Msk                      /*!< Page 109 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV14_Pos                  (14UL)
#define FLASH_PRIVBB1R5_PRIV14_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV14_Pos)           /*!< 0x00004000 */
#define FLASH_PRIVBB1R5_PRIV14                      FLASH_PRIVBB1R5_PRIV14_Msk                      /*!< Page 110 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV15_Pos                  (15UL)
#define FLASH_PRIVBB1R5_PRIV15_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV15_Pos)           /*!< 0x00008000 */
#define FLASH_PRIVBB1R5_PRIV15                      FLASH_PRIVBB1R5_PRIV15_Msk                      /*!< Page 111 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV16_Pos                  (16UL)
#define FLASH_PRIVBB1R5_PRIV16_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV16_Pos)           /*!< 0x00010000 */
#define FLASH_PRIVBB1R5_PRIV16                      FLASH_PRIVBB1R5_PRIV16_Msk                      /*!< Page 112 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV17_Pos                  (17UL)
#define FLASH_PRIVBB1R5_PRIV17_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV17_Pos)           /*!< 0x00020000 */
#define FLASH_PRIVBB1R5_PRIV17                      FLASH_PRIVBB1R5_PRIV17_Msk                      /*!< Page 113 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV18_Pos                  (18UL)
#define FLASH_PRIVBB1R5_PRIV18_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV18_Pos)           /*!< 0x00040000 */
#define FLASH_PRIVBB1R5_PRIV18                      FLASH_PRIVBB1R5_PRIV18_Msk                      /*!< Page 114 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV19_Pos                  (19UL)
#define FLASH_PRIVBB1R5_PRIV19_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV19_Pos)           /*!< 0x00080000 */
#define FLASH_PRIVBB1R5_PRIV19                      FLASH_PRIVBB1R5_PRIV19_Msk                      /*!< Page 115 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV20_Pos                  (20UL)
#define FLASH_PRIVBB1R5_PRIV20_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV20_Pos)           /*!< 0x00100000 */
#define FLASH_PRIVBB1R5_PRIV20                      FLASH_PRIVBB1R5_PRIV20_Msk                      /*!< Page 116 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV21_Pos                  (21UL)
#define FLASH_PRIVBB1R5_PRIV21_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV21_Pos)           /*!< 0x00200000 */
#define FLASH_PRIVBB1R5_PRIV21                      FLASH_PRIVBB1R5_PRIV21_Msk                      /*!< Page 117 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV22_Pos                  (22UL)
#define FLASH_PRIVBB1R5_PRIV22_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV22_Pos)           /*!< 0x00400000 */
#define FLASH_PRIVBB1R5_PRIV22                      FLASH_PRIVBB1R5_PRIV22_Msk                      /*!< Page 118 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV23_Pos                  (23UL)
#define FLASH_PRIVBB1R5_PRIV23_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV23_Pos)           /*!< 0x00800000 */
#define FLASH_PRIVBB1R5_PRIV23                      FLASH_PRIVBB1R5_PRIV23_Msk                      /*!< Page 119 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV24_Pos                  (24UL)
#define FLASH_PRIVBB1R5_PRIV24_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV24_Pos)           /*!< 0x01000000 */
#define FLASH_PRIVBB1R5_PRIV24                      FLASH_PRIVBB1R5_PRIV24_Msk                      /*!< Page 120 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV25_Pos                  (25UL)
#define FLASH_PRIVBB1R5_PRIV25_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV25_Pos)           /*!< 0x02000000 */
#define FLASH_PRIVBB1R5_PRIV25                      FLASH_PRIVBB1R5_PRIV25_Msk                      /*!< Page 121 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV26_Pos                  (26UL)
#define FLASH_PRIVBB1R5_PRIV26_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV26_Pos)           /*!< 0x04000000 */
#define FLASH_PRIVBB1R5_PRIV26                      FLASH_PRIVBB1R5_PRIV26_Msk                      /*!< Page 122 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV27_Pos                  (27UL)
#define FLASH_PRIVBB1R5_PRIV27_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV27_Pos)           /*!< 0x08000000 */
#define FLASH_PRIVBB1R5_PRIV27                      FLASH_PRIVBB1R5_PRIV27_Msk                      /*!< Page 123 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV28_Pos                  (28UL)
#define FLASH_PRIVBB1R5_PRIV28_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV28_Pos)           /*!< 0x10000000 */
#define FLASH_PRIVBB1R5_PRIV28                      FLASH_PRIVBB1R5_PRIV28_Msk                      /*!< Page 124 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV29_Pos                  (29UL)
#define FLASH_PRIVBB1R5_PRIV29_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV29_Pos)           /*!< 0x20000000 */
#define FLASH_PRIVBB1R5_PRIV29                      FLASH_PRIVBB1R5_PRIV29_Msk                      /*!< Page 125 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV30_Pos                  (30UL)
#define FLASH_PRIVBB1R5_PRIV30_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV30_Pos)           /*!< 0x40000000 */
#define FLASH_PRIVBB1R5_PRIV30                      FLASH_PRIVBB1R5_PRIV30_Msk                      /*!< Page 126 in bank 1 block-based privilege */
#define FLASH_PRIVBB1R5_PRIV31_Pos                  (31UL)
#define FLASH_PRIVBB1R5_PRIV31_Msk                  (0x1UL << FLASH_PRIVBB1R5_PRIV31_Pos)           /*!< 0x80000000 */
#define FLASH_PRIVBB1R5_PRIV31                      FLASH_PRIVBB1R5_PRIV31_Msk                      /*!< Page 127 in bank 1 block-based privilege */

