STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
/*******************  Bits definition for GTZC_TZSC1_PRIVCFGR3 register  ***************/
#define GTZC_TZSC1_PRIVCFGR3_CRC_Pos            GTZC_CFGR3_CRC_Pos
#define GTZC_TZSC1_PRIVCFGR3_CRC_Msk            GTZC_CFGR3_CRC_Msk
#define GTZC_TZSC1_PRIVCFGR3_TSC_Pos            GTZC_CFGR3_TSC_Pos
#define GTZC_TZSC1_PRIVCFGR3_TSC_Msk            GTZC_CFGR3_TSC_Msk
#define GTZC_TZSC1_PRIVCFGR3_ICACHE_REG_Pos     GTZC_CFGR3_ICACHE_REG_Pos
#define GTZC_TZSC1_PRIVCFGR3_ICACHE_REG_Msk     GTZC_CFGR3_ICACHE_REG_Msk
#if !$U3_256K$
#define GTZC_TZSC1_PRIVCFGR3_ADC12_Pos          GTZC_CFGR3_ADC12_Pos
#define GTZC_TZSC1_PRIVCFGR3_ADC12_Msk          GTZC_CFGR3_ADC12_Msk
#endif /*!$U3_256K$*/
#if $U3_CRYPTO$
#define GTZC_TZSC1_PRIVCFGR3_AES_Pos            GTZC_CFGR3_AES_Pos
#define GTZC_TZSC1_PRIVCFGR3_AES_Msk            GTZC_CFGR3_AES_Msk
#endif /* $U3_CRYPTO$ */
#define GTZC_TZSC1_PRIVCFGR3_HASH_Pos           GTZC_CFGR3_HASH_Pos
#define GTZC_TZSC1_PRIVCFGR3_HASH_Msk           GTZC_CFGR3_HASH_Msk
#define GTZC_TZSC1_PRIVCFGR3_RNG_Pos            GTZC_CFGR3_RNG_Pos
#define GTZC_TZSC1_PRIVCFGR3_RNG_Msk            GTZC_CFGR3_RNG_Msk
#if !$U3_256K$
#define GTZC_TZSC1_PRIVCFGR3_PKA_Pos            GTZC_CFGR3_PKA_Pos
#define GTZC_TZSC1_PRIVCFGR3_PKA_Msk            GTZC_CFGR3_PKA_Msk
#endif /*!$U3_256K$*/
#if $U3_CRYPTO$ && !$U3_256K$
#define GTZC_TZSC1_PRIVCFGR3_SAES_Pos           GTZC_CFGR3_SAES_Pos
#define GTZC_TZSC1_PRIVCFGR3_SAES_Msk           GTZC_CFGR3_SAES_Msk
#define GTZC_TZSC1_PRIVCFGR3_CCB_Pos            GTZC_CFGR3_CCB_Pos
#define GTZC_TZSC1_PRIVCFGR3_CCB_Msk            GTZC_CFGR3_CCB_Msk
#endif /* $U3_CRYPTO$ && !$U3_256K$*/
#if !$U3_512K$ && !$U3_256K$
#define GTZC_TZSC1_PRIVCFGR3_SDMMC1_Pos         GTZC_CFGR3_SDMMC1_Pos
#define GTZC_TZSC1_PRIVCFGR3_SDMMC1_Msk         GTZC_CFGR3_SDMMC1_Msk
#endif /* !$U3_512K$ && !$U3_256K$*/
#define GTZC_TZSC1_PRIVCFGR3_OCTOSPI1_REG_Pos   GTZC_CFGR3_OCTOSPI1_REG_Pos
#define GTZC_TZSC1_PRIVCFGR3_OCTOSPI1_REG_Msk   GTZC_CFGR3_OCTOSPI1_REG_Msk
#define GTZC_TZSC1_PRIVCFGR3_RAMCFG_Pos         GTZC_CFGR3_RAMCFG_Pos
#define GTZC_TZSC1_PRIVCFGR3_RAMCFG_Msk         GTZC_CFGR3_RAMCFG_Msk
#define GTZC_TZSC1_PRIVCFGR3_DAC1_Pos           GTZC_CFGR3_DAC1_Pos
#define GTZC_TZSC1_PRIVCFGR3_DAC1_Msk           GTZC_CFGR3_DAC1_Msk
#if !$U3_512K$
#define GTZC_TZSC1_PRIVCFGR3_ADF1_Pos           GTZC_CFGR3_ADF1_Pos
#define GTZC_TZSC1_PRIVCFGR3_ADF1_Msk           GTZC_CFGR3_ADF1_Msk
#endif /* !$U3_512K$ */
#if $U3_2M$ || $U3_1M5$
#define GTZC_TZSC1_PRIVCFGR3_HSP1_Pos           GTZC_CFGR3_HSP1_Pos
#define GTZC_TZSC1_PRIVCFGR3_HSP1_Msk           GTZC_CFGR3_HSP1_Msk
#endif /* $U3_2M$ || $U3_1M5$ */

/*******************  Bits definition for GTZC_TZIC1_IER1 register  ***************/
#define GTZC_TZIC1_IER1_TIM2_Pos                GTZC_CFGR1_TIM2_Pos
#define GTZC_TZIC1_IER1_TIM2_Msk                GTZC_CFGR1_TIM2_Msk
#define GTZC_TZIC1_IER1_TIM3_Pos                GTZC_CFGR1_TIM3_Pos
#define GTZC_TZIC1_IER1_TIM3_Msk                GTZC_CFGR1_TIM3_Msk
#define GTZC_TZIC1_IER1_TIM4_Pos                GTZC_CFGR1_TIM4_Pos
#define GTZC_TZIC1_IER1_TIM4_Msk                GTZC_CFGR1_TIM4_Msk
#define GTZC_TZIC1_IER1_TIM5_Pos                GTZC_CFGR1_TIM5_Pos
#define GTZC_TZIC1_IER1_TIM5_Msk                GTZC_CFGR1_TIM5_Msk
#define GTZC_TZIC1_IER1_TIM6_Pos                GTZC_CFGR1_TIM6_Pos
#define GTZC_TZIC1_IER1_TIM6_Msk                GTZC_CFGR1_TIM6_Msk
#define GTZC_TZIC1_IER1_TIM7_Pos                GTZC_CFGR1_TIM7_Pos
#define GTZC_TZIC1_IER1_TIM7_Msk                GTZC_CFGR1_TIM7_Msk
#define GTZC_TZIC1_IER1_WWDG_Pos                GTZC_CFGR1_WWDG_Pos
#define GTZC_TZIC1_IER1_WWDG_Msk                GTZC_CFGR1_WWDG_Msk
#define GTZC_TZIC1_IER1_IWDG_Pos                GTZC_CFGR1_IWDG_Pos
#define GTZC_TZIC1_IER1_IWDG_Msk                GTZC_CFGR1_IWDG_Msk
#define GTZC_TZIC1_IER1_SPI2_Pos                GTZC_CFGR1_SPI2_Pos
#define GTZC_TZIC1_IER1_SPI2_Msk                GTZC_CFGR1_SPI2_Msk
#if $U3_2M$ || $U3_1M5$
#define GTZC_TZSC1_IER1_USART2_Pos              GTZC_CFGR1_USART2_Pos
#define GTZC_TZSC1_IER1_USART2_Msk              GTZC_CFGR1_USART2_Msk
#endif /* $U3_2M$ || $U3_1M5$ */
#define GTZC_TZIC1_IER1_USART3_Pos              GTZC_CFGR1_USART3_Pos
#define GTZC_TZIC1_IER1_USART3_Msk              GTZC_CFGR1_USART3_Msk
#define GTZC_TZIC1_IER1_UART4_Pos               GTZC_CFGR1_UART4_Pos
#define GTZC_TZIC1_IER1_UART4_Msk               GTZC_CFGR1_UART4_Msk
#if !$U3_256K$
#define GTZC_TZIC1_IER1_UART5_Pos               GTZC_CFGR1_UART5_Pos
#define GTZC_TZIC1_IER1_UART5_Msk               GTZC_CFGR1_UART5_Msk
#endif /*!$U3_256K$*/
#define GTZC_TZIC1_IER1_I2C1_Pos                GTZC_CFGR1_I2C1_Pos
#define GTZC_TZIC1_IER1_I2C1_Msk                GTZC_CFGR1_I2C1_Msk
#if !$U3_512K$ && !$U3_256K$
#define GTZC_TZIC1_IER1_I2C2_Pos                GTZC_CFGR1_I2C2_Pos
#define GTZC_TZIC1_IER1_I2C2_Msk                GTZC_CFGR1_I2C2_Msk
#endif /* !$U3_512K$ && !$U3_256K$ */
#define GTZC_TZIC1_IER1_CRS_Pos                 GTZC_CFGR1_CRS_Pos
#define GTZC_TZIC1_IER1_CRS_Msk                 GTZC_CFGR1_CRS_Msk
#if $U3_2M$
#define GTZC_TZSC1_IER1_I2C4_Pos                GTZC_CFGR1_I2C4_Pos
#define GTZC_TZSC1_IER1_I2C4_Msk                GTZC_CFGR1_I2C4_Msk
#endif /* $U3_2M$ */
#define GTZC_TZIC1_IER1_LPTIM2_Pos              GTZC_CFGR1_LPTIM2_Pos
#define GTZC_TZIC1_IER1_LPTIM2_Msk              GTZC_CFGR1_LPTIM2_Msk
#if !$U3_512K$
#define GTZC_TZIC1_IER1_FDCAN1_Pos              GTZC_CFGR1_FDCAN1_Pos
#define GTZC_TZIC1_IER1_FDCAN1_Msk              GTZC_CFGR1_FDCAN1_Msk
#endif /* !$U3_512K$ */
#if $U3_2M$
#define GTZC_TZIC1_IER1_FDCAN2_Pos              GTZC_CFGR1_FDCAN2_Pos
#define GTZC_TZIC1_IER1_FDCAN2_Msk              GTZC_CFGR1_FDCAN2_Msk
#endif /* $U3_2M$ */
#if !$U3_256K$
#define GTZC_TZIC1_IER1_SPI3_Pos                GTZC_CFGR1_SPI3_Pos
#define GTZC_TZIC1_IER1_SPI3_Msk                GTZC_CFGR1_SPI3_Msk
#endif /*!$U3_256K$*/
#define GTZC_TZIC1_IER1_I3C1_Pos                GTZC_CFGR1_I3C1_Pos
#define GTZC_TZIC1_IER1_I3C1_Msk                GTZC_CFGR1_I3C1_Msk
#define GTZC_TZIC1_IER1_OPAMP_Pos               GTZC_CFGR1_OPAMP_Pos
#define GTZC_TZIC1_IER1_OPAMP_Msk               GTZC_CFGR1_OPAMP_Msk
#if !$U3_256K$
#define GTZC_TZIC1_IER1_VREFBUF_Pos             GTZC_CFGR1_VREFBUF_Pos
#define GTZC_TZIC1_IER1_VREFBUF_Msk             GTZC_CFGR1_VREFBUF_Msk
#endif /*!$U3_256K$*/
#if $U3_2M$
#define GTZC_TZSC1_IER1_SPI4_Pos                GTZC_CFGR1_SPI4_Pos
#define GTZC_TZSC1_IER1_SPI4_Msk                GTZC_CFGR1_SPI4_Msk
#endif /* $U3_2M$ */

