STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
/*******************  Bits definition for GTZC_TZIC1_IER2 register  ***************/
#define GTZC_TZIC1_IER2_TIM1_Pos                GTZC_CFGR2_TIM1_Pos
#define GTZC_TZIC1_IER2_TIM1_Msk                GTZC_CFGR2_TIM1_Msk
#define GTZC_TZIC1_IER2_SPI1_Pos                GTZC_CFGR2_SPI1_Pos
#define GTZC_TZIC1_IER2_SPI1_Msk                GTZC_CFGR2_SPI1_Msk
#if $U3_2M$ || $U3_1M5$
#define GTZC_TZSC1_IER2_TIM8_Pos                GTZC_CFGR2_TIM8_Pos
#define GTZC_TZSC1_IER2_TIM8_Msk                GTZC_CFGR2_TIM8_Msk
#endif /* $U3_2M$ || $U3_1M5$ */
#define GTZC_TZIC1_IER2_USART1_Pos              GTZC_CFGR2_USART1_Pos
#define GTZC_TZIC1_IER2_USART1_Msk              GTZC_CFGR2_USART1_Msk
#define GTZC_TZIC1_IER2_TIM15_Pos               GTZC_CFGR2_TIM15_Pos
#define GTZC_TZIC1_IER2_TIM15_Msk               GTZC_CFGR2_TIM15_Msk
#define GTZC_TZIC1_IER2_TIM16_Pos               GTZC_CFGR2_TIM16_Pos
#define GTZC_TZIC1_IER2_TIM16_Msk               GTZC_CFGR2_TIM16_Msk
#define GTZC_TZIC1_IER2_TIM17_Pos               GTZC_CFGR2_TIM17_Pos
#define GTZC_TZIC1_IER2_TIM17_Msk               GTZC_CFGR2_TIM17_Msk
#if !$U3_512K$ && !$U3_256K$
#define GTZC_TZIC1_IER2_SAI1_Pos                GTZC_CFGR2_SAI1_Pos
#define GTZC_TZIC1_IER2_SAI1_Msk                GTZC_CFGR2_SAI1_Msk
#endif /* !$U3_512K$ && !$U3_256K$*/
#if $U3_2M$ || $U3_1M5$
#define GTZC_TZSC1_IER2_TIM12_Pos               GTZC_CFGR2_TIM12_Pos
#define GTZC_TZSC1_IER2_TIM12_Msk               GTZC_CFGR2_TIM12_Msk
#endif /* $U3_2M$ || $U3_1M5$ */
#define GTZC_TZIC1_IER2_USB_Pos                 GTZC_CFGR2_USB_Pos
#define GTZC_TZIC1_IER2_USB_Msk                 GTZC_CFGR2_USB_Msk
#if !$U3_512K$ && !$U3_256K$
#define GTZC_TZIC1_IER2_I3C2_Pos                GTZC_CFGR2_I3C2_Pos
#define GTZC_TZIC1_IER2_I3C2_Msk                GTZC_CFGR2_I3C2_Msk
#endif /* !$U3_512K$ && !$U3_256K$*/
#define GTZC_TZIC1_IER2_LPUART1_Pos             GTZC_CFGR2_LPUART1_Pos
#define GTZC_TZIC1_IER2_LPUART1_Msk             GTZC_CFGR2_LPUART1_Msk
#define GTZC_TZIC1_IER2_I2C3_Pos                GTZC_CFGR2_I2C3_Pos
#define GTZC_TZIC1_IER2_I2C3_Msk                GTZC_CFGR2_I2C3_Msk
#define GTZC_TZIC1_IER2_LPTIM1_Pos              GTZC_CFGR2_LPTIM1_Pos
#define GTZC_TZIC1_IER2_LPTIM1_Msk              GTZC_CFGR2_LPTIM1_Msk
#define GTZC_TZIC1_IER2_LPTIM3_Pos              GTZC_CFGR2_LPTIM3_Pos
#define GTZC_TZIC1_IER2_LPTIM3_Msk              GTZC_CFGR2_LPTIM3_Msk
#define GTZC_TZIC1_IER2_LPTIM4_Pos              GTZC_CFGR2_LPTIM4_Pos
#define GTZC_TZIC1_IER2_LPTIM4_Msk              GTZC_CFGR2_LPTIM4_Msk
#define GTZC_TZIC1_IER2_COMP_Pos                GTZC_CFGR2_COMP_Pos
#define GTZC_TZIC1_IER2_COMP_Msk                GTZC_CFGR2_COMP_Msk

/*******************  Bits definition for GTZC_TZIC1_IER3 register  ***************/
#define GTZC_TZIC1_IER3_CRC_Pos                 GTZC_CFGR3_CRC_Pos
#define GTZC_TZIC1_IER3_CRC_Msk                 GTZC_CFGR3_CRC_Msk
#define GTZC_TZIC1_IER3_TSC_Pos                 GTZC_CFGR3_TSC_Pos
#define GTZC_TZIC1_IER3_TSC_Msk                 GTZC_CFGR3_TSC_Msk
#define GTZC_TZIC1_IER3_ICACHE_REG_Pos          GTZC_CFGR3_ICACHE_REG_Pos
#define GTZC_TZIC1_IER3_ICACHE_REG_Msk          GTZC_CFGR3_ICACHE_REG_Msk
#if !$U3_256K$
#define GTZC_TZIC1_IER3_ADC12_Pos               GTZC_CFGR3_ADC12_Pos
#define GTZC_TZIC1_IER3_ADC12_Msk               GTZC_CFGR3_ADC12_Msk
#endif /*!$U3_256K$*/
#if $U3_CRYPTO$
#define GTZC_TZIC1_IER3_AES_Pos                 GTZC_CFGR3_AES_Pos
#define GTZC_TZIC1_IER3_AES_Msk                 GTZC_CFGR3_AES_Msk
#endif /* $U3_CRYPTO$ */
#define GTZC_TZIC1_IER3_HASH_Pos                GTZC_CFGR3_HASH_Pos
#define GTZC_TZIC1_IER3_HASH_Msk                GTZC_CFGR3_HASH_Msk
#define GTZC_TZIC1_IER3_RNG_Pos                 GTZC_CFGR3_RNG_Pos
#define GTZC_TZIC1_IER3_RNG_Msk                 GTZC_CFGR3_RNG_Msk
#if !$U3_256K$
#define GTZC_TZIC1_IER3_PKA_Pos                 GTZC_CFGR3_PKA_Pos
#define GTZC_TZIC1_IER3_PKA_Msk                 GTZC_CFGR3_PKA_Msk
#endif /*!$U3_256K$*/
#if $U3_CRYPTO$ && !$U3_256K$
#define GTZC_TZIC1_IER3_SAES_Pos                GTZC_CFGR3_SAES_Pos
#define GTZC_TZIC1_IER3_SAES_Msk                GTZC_CFGR3_SAES_Msk
#define GTZC_TZIC1_IER3_CCB_Pos                 GTZC_CFGR3_CCB_Pos
#define GTZC_TZIC1_IER3_CCB_Msk                 GTZC_CFGR3_CCB_Msk
#endif /* $U3_CRYPTO$ && !$U3_256K$*/
#if !$U3_512K$ && !$U3_256K$
#define GTZC_TZIC1_IER3_SDMMC1_Pos              GTZC_CFGR3_SDMMC1_Pos
#define GTZC_TZIC1_IER3_SDMMC1_Msk              GTZC_CFGR3_SDMMC1_Msk
#endif /* !$U3_512K$ && !$U3_256K$*/
#define GTZC_TZIC1_IER3_OCTOSPI1_REG_Pos        GTZC_CFGR3_OCTOSPI1_REG_Pos
#define GTZC_TZIC1_IER3_OCTOSPI1_REG_Msk        GTZC_CFGR3_OCTOSPI1_REG_Msk
#define GTZC_TZIC1_IER3_RAMCFG_Pos              GTZC_CFGR3_RAMCFG_Pos
#define GTZC_TZIC1_IER3_RAMCFG_Msk              GTZC_CFGR3_RAMCFG_Msk
#define GTZC_TZIC1_IER3_DAC1_Pos                GTZC_CFGR3_DAC1_Pos
#define GTZC_TZIC1_IER3_DAC1_Msk                GTZC_CFGR3_DAC1_Msk
#if !$U3_512K$
#define GTZC_TZIC1_IER3_ADF1_Pos                GTZC_CFGR3_ADF1_Pos
#define GTZC_TZIC1_IER3_ADF1_Msk                GTZC_CFGR3_ADF1_Msk
#endif /* !$U3_512K$ */
#if $U3_2M$ || $U3_1M5$
#define GTZC_TZSC1_IER3_HSP1_Pos                GTZC_CFGR3_HSP1_Pos
#define GTZC_TZSC1_IER3_HSP1_Msk                GTZC_CFGR3_HSP1_Msk
#endif /* $U3_2M$ || $U3_1M5$ */

/*******************  Bits definition for GTZC_TZIC1_IER4 register  ***************/
#define GTZC_TZIC1_IER4_GPDMA1_Pos              GTZC_CFGR4_GPDMA1_Pos
#define GTZC_TZIC1_IER4_GPDMA1_Msk              GTZC_CFGR4_GPDMA1_Msk
#define GTZC_TZIC1_IER4_FLASH_REG_Pos           GTZC_CFGR4_FLASH_REG_Pos
#define GTZC_TZIC1_IER4_FLASH_REG_Msk           GTZC_CFGR4_FLASH_REG_Msk
#define GTZC_TZIC1_IER4_FLASH_Pos               GTZC_CFGR4_FLASH_Pos
#define GTZC_TZIC1_IER4_FLASH_Msk               GTZC_CFGR4_FLASH_Msk
#define GTZC_TZIC1_IER4_PWR_Pos                 GTZC_CFGR4_PWR_Pos
#define GTZC_TZIC1_IER4_PWR_Msk                 GTZC_CFGR4_PWR_Msk
#define GTZC_TZIC1_IER4_RCC_Pos                 GTZC_CFGR4_RCC_Pos
#define GTZC_TZIC1_IER4_RCC_Msk                 GTZC_CFGR4_RCC_Msk
#define GTZC_TZIC1_IER4_SYSCFG_Pos              GTZC_CFGR4_SYSCFG_Pos
#define GTZC_TZIC1_IER4_SYSCFG_Msk              GTZC_CFGR4_SYSCFG_Msk
#define GTZC_TZIC1_IER4_EXTI_Pos                GTZC_CFGR4_EXTI_Pos
#define GTZC_TZIC1_IER4_EXTI_Msk                GTZC_CFGR4_EXTI_Msk
#define GTZC_TZIC1_IER4_RTC_Pos                 GTZC_CFGR4_RTC_Pos
#define GTZC_TZIC1_IER4_RTC_Msk                 GTZC_CFGR4_RTC_Msk
#define GTZC_TZIC1_IER4_TAMP_Pos                GTZC_CFGR4_TAMP_Pos
#define GTZC_TZIC1_IER4_TAMP_Msk                GTZC_CFGR4_TAMP_Msk
#define GTZC_TZIC1_IER4_TZSC_Pos                GTZC_CFGR4_TZSC_Pos
#define GTZC_TZIC1_IER4_TZSC_Msk                GTZC_CFGR4_TZSC_Msk
#define GTZC_TZIC1_IER4_TZIC_Pos                GTZC_CFGR4_TZIC_Pos
#define GTZC_TZIC1_IER4_TZIC_Msk                GTZC_CFGR4_TZIC_Msk
#define GTZC_TZIC1_IER4_SRAM1_Pos               GTZC_CFGR4_SRAM1_Pos
#define GTZC_TZIC1_IER4_SRAM1_Msk               GTZC_CFGR4_SRAM1_Msk
#define GTZC_TZIC1_IER4_MPCBB1_REG_Pos          GTZC_CFGR4_MPCBB1_REG_Pos
#define GTZC_TZIC1_IER4_MPCBB1_REG_Msk          GTZC_CFGR4_MPCBB1_REG_Msk
#define GTZC_TZIC1_IER4_SRAM2_Pos               GTZC_CFGR4_SRAM2_Pos
#define GTZC_TZIC1_IER4_SRAM2_Msk               GTZC_CFGR4_SRAM2_Msk
#define GTZC_TZIC1_IER4_MPCBB2_REG_Pos          GTZC_CFGR4_MPCBB2_REG_Pos
#define GTZC_TZIC1_IER4_MPCBB2_REG_Msk          GTZC_CFGR4_MPCBB2_REG_Msk
#if $U3_2M$ || $U3_1M5$
#define GTZC_TZIC1_IER4_SRAM3_Pos               GTZC_CFGR4_SRAM3_Pos
#define GTZC_TZIC1_IER4_SRAM3_Msk               GTZC_CFGR4_SRAM3_Msk
#define GTZC_TZIC1_IER4_MPCBB3_REG_Pos          GTZC_CFGR4_MPCBB3_REG_Pos
#define GTZC_TZIC1_IER4_MPCBB3_REG_Msk          GTZC_CFGR4_MPCBB3_REG_Msk
#define GTZC_TZIC1_IER4_SRAM4_Pos               GTZC_CFGR4_SRAM4_Pos
#define GTZC_TZIC1_IER4_SRAM4_Msk               GTZC_CFGR4_SRAM4_Msk
#define GTZC_TZIC1_IER4_MPCBB4_REG_Pos          GTZC_CFGR4_MPCBB4_REG_Pos
#define GTZC_TZIC1_IER4_MPCBB4_REG_Msk          GTZC_CFGR4_MPCBB4_REG_Msk
#endif /* $U3_2M$ || $U3_1M5$ */

