STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
/******************  Bits definition for GTZC_TZIC1_FCR4 register  ***************/
#define GTZC_TZIC1_FCR4_GPDMA1_Pos              GTZC_CFGR4_GPDMA1_Pos
#define GTZC_TZIC1_FCR4_GPDMA1_Msk              GTZC_CFGR4_GPDMA1_Msk
#define GTZC_TZIC1_FCR4_FLASH_REG_Pos           GTZC_CFGR4_FLASH_REG_Pos
#define GTZC_TZIC1_FCR4_FLASH_REG_Msk           GTZC_CFGR4_FLASH_REG_Msk
#define GTZC_TZIC1_FCR4_FLASH_Pos               GTZC_CFGR4_FLASH_Pos
#define GTZC_TZIC1_FCR4_FLASH_Msk               GTZC_CFGR4_FLASH_Msk
#define GTZC_TZIC1_FCR4_PWR_Pos                 GTZC_CFGR4_PWR_Pos
#define GTZC_TZIC1_FCR4_PWR_Msk                 GTZC_CFGR4_PWR_Msk
#define GTZC_TZIC1_FCR4_RCC_Pos                 GTZC_CFGR4_RCC_Pos
#define GTZC_TZIC1_FCR4_RCC_Msk                 GTZC_CFGR4_RCC_Msk
#define GTZC_TZIC1_FCR4_SYSCFG_Pos              GTZC_CFGR4_SYSCFG_Pos
#define GTZC_TZIC1_FCR4_SYSCFG_Msk              GTZC_CFGR4_SYSCFG_Msk
#define GTZC_TZIC1_FCR4_EXTI_Pos                GTZC_CFGR4_EXTI_Pos
#define GTZC_TZIC1_FCR4_EXTI_Msk                GTZC_CFGR4_EXTI_Msk
#define GTZC_TZIC1_FCR4_RTC_Pos                 GTZC_CFGR4_RTC_Pos
#define GTZC_TZIC1_FCR4_RTC_Msk                 GTZC_CFGR4_RTC_Msk
#define GTZC_TZIC1_FCR4_TAMP_Pos                GTZC_CFGR4_TAMP_Pos
#define GTZC_TZIC1_FCR4_TAMP_Msk                GTZC_CFGR4_TAMP_Msk
#define GTZC_TZIC1_FCR4_TZSC_Pos                GTZC_CFGR4_TZSC_Pos
#define GTZC_TZIC1_FCR4_TZSC_Msk                GTZC_CFGR4_TZSC_Msk
#define GTZC_TZIC1_FCR4_TZIC_Pos                GTZC_CFGR4_TZIC_Pos
#define GTZC_TZIC1_FCR4_TZIC_Msk                GTZC_CFGR4_TZIC_Msk
#define GTZC_TZIC1_FCR4_SRAM1_Pos               GTZC_CFGR4_SRAM1_Pos
#define GTZC_TZIC1_FCR4_SRAM1_Msk               GTZC_CFGR4_SRAM1_Msk
#define GTZC_TZIC1_FCR4_MPCBB1_REG_Pos          GTZC_CFGR4_MPCBB1_REG_Pos
#define GTZC_TZIC1_FCR4_MPCBB1_REG_Msk          GTZC_CFGR4_MPCBB1_REG_Msk
#define GTZC_TZIC1_FCR4_SRAM2_Pos               GTZC_CFGR4_SRAM2_Pos
#define GTZC_TZIC1_FCR4_SRAM2_Msk               GTZC_CFGR4_SRAM2_Msk
#define GTZC_TZIC1_FCR4_MPCBB2_REG_Pos          GTZC_CFGR4_MPCBB2_REG_Pos
#define GTZC_TZIC1_FCR4_MPCBB2_REG_Msk          GTZC_CFGR4_MPCBB2_REG_Msk
#if $U3_2M$ || $U3_1M5$
#define GTZC_TZIC1_IER4_SRAM3_Pos               GTZC_CFGR4_SRAM3_Pos
#define GTZC_TZIC1_FCR4_SRAM3_Msk               GTZC_CFGR4_SRAM3_Msk
#define GTZC_TZIC1_FCR4_MPCBB3_REG_Pos          GTZC_CFGR4_MPCBB3_REG_Pos
#define GTZC_TZIC1_FCR4_MPCBB3_REG_Msk          GTZC_CFGR4_MPCBB3_REG_Msk
#define GTZC_TZIC1_FCR4_SRAM4_Pos               GTZC_CFGR4_SRAM4_Pos
#define GTZC_TZIC1_FCR4_SRAM4_Msk               GTZC_CFGR4_SRAM4_Msk
#define GTZC_TZIC1_FCR4_MPCBB4_REG_Pos          GTZC_CFGR4_MPCBB4_REG_Pos
#define GTZC_TZIC1_FCR4_MPCBB4_REG_Msk          GTZC_CFGR4_MPCBB4_REG_Msk
#endif /* $U3_2M$ || $U3_1M5$ */

/*******************  Bits definition for GTZC_MPCBB_CR register  *****************/
#define GTZC_MPCBB_CR_GLOCK_Pos             (0UL)
#define GTZC_MPCBB_CR_GLOCK_Msk             (0x01UL << GTZC_MPCBB_CR_GLOCK_Pos)       /*!< 0x00000001 */
#define GTZC_MPCBB_CR_INVSECSTATE_Pos       (30UL)
#define GTZC_MPCBB_CR_INVSECSTATE_Msk       (0x01UL << GTZC_MPCBB_CR_INVSECSTATE_Pos) /*!< 0x40000000 */
#define GTZC_MPCBB_CR_SRWILADIS_Pos         (31UL)
#define GTZC_MPCBB_CR_SRWILADIS_Msk         (0x01UL << GTZC_MPCBB_CR_SRWILADIS_Pos)   /*!< 0x80000000 */

/*******************  Bits definition for GTZC_MPCBB_CFGLOCKR1 register  ************/
#define GTZC_MPCBB_CFGLOCKR1_SPLCK0_Pos      (0UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK0_Msk      (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK0_Pos) /*!< 0x00000001 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK1_Pos      (1UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK1_Msk      (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK1_Pos) /*!< 0x00000002 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK2_Pos      (2UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK2_Msk      (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK2_Pos) /*!< 0x00000004 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK3_Pos      (3UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK3_Msk      (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK3_Pos) /*!< 0x00000008 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK4_Pos      (4UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK4_Msk      (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK4_Pos) /*!< 0x00000010 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK5_Pos      (5UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK5_Msk      (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK5_Pos) /*!< 0x00000020 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK6_Pos      (6UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK6_Msk      (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK6_Pos) /*!< 0x00000040 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK7_Pos      (7UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK7_Msk      (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK7_Pos) /*!< 0x00000080 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK8_Pos      (8UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK8_Msk      (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK8_Pos) /*!< 0x00000100 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK9_Pos      (9UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK9_Msk      (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK9_Pos) /*!< 0x00000200 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK10_Pos     (10UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK10_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK10_Pos) /*!< 0x00000400 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK11_Pos     (11UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK11_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK11_Pos) /*!< 0x00000800 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK12_Pos     (12UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK12_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK12_Pos) /*!< 0x00001000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK13_Pos     (13UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK13_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK13_Pos) /*!< 0x00002000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK14_Pos     (14UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK14_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK14_Pos) /*!< 0x00004000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK15_Pos     (15UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK15_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK15_Pos) /*!< 0x00008000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK16_Pos     (16UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK16_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK16_Pos) /*!< 0x00010000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK17_Pos     (17UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK17_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK17_Pos) /*!< 0x00020000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK18_Pos     (18UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK18_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK18_Pos) /*!< 0x00040000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK19_Pos     (19UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK19_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK19_Pos) /*!< 0x00080000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK20_Pos     (20UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK20_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK20_Pos) /*!< 0x00100000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK21_Pos     (21UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK21_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK21_Pos) /*!< 0x00200000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK22_Pos     (22UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK22_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK22_Pos) /*!< 0x00400000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK23_Pos     (23UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK23_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK23_Pos) /*!< 0x00800000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK24_Pos     (24UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK24_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK24_Pos) /*!< 0x01000000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK25_Pos     (25UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK25_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK25_Pos) /*!< 0x02000000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK26_Pos     (26UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK26_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK26_Pos) /*!< 0x04000000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK27_Pos     (27UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK27_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK27_Pos) /*!< 0x08000000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK28_Pos     (28UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK28_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK28_Pos) /*!< 0x10000000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK29_Pos     (29UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK29_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK29_Pos) /*!< 0x20000000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK30_Pos     (30UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK30_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK30_Pos) /*!< 0x40000000 */
#define GTZC_MPCBB_CFGLOCKR1_SPLCK31_Pos     (31UL)
#define GTZC_MPCBB_CFGLOCKR1_SPLCK31_Msk     (0x01UL << GTZC_MPCBB_CFGLOCKR1_SPLCK31_Pos) /*!< 0x80000000 */

/*******************  Bits definition for GTZC_MPCBB_SECCFGR register  ************/
#define GTZC_MPCBB_SECCFGR_SEC0_Pos      (0UL)
#define GTZC_MPCBB_SECCFGR_SEC0_Msk      (0x01UL << GTZC_MPCBB_SECCFGR_SEC0_Pos)          /*!< 0x00000001 */
#define GTZC_MPCBB_SECCFGR_SEC1_Pos      (1UL)
#define GTZC_MPCBB_SECCFGR_SEC1_Msk      (0x01UL << GTZC_MPCBB_SECCFGR_SEC1_Pos)          /*!< 0x00000002 */
#define GTZC_MPCBB_SECCFGR_SEC2_Pos      (2UL)
#define GTZC_MPCBB_SECCFGR_SEC2_Msk      (0x01UL << GTZC_MPCBB_SECCFGR_SEC2_Pos)          /*!< 0x00000004 */
#define GTZC_MPCBB_SECCFGR_SEC3_Pos      (3UL)
#define GTZC_MPCBB_SECCFGR_SEC3_Msk      (0x01UL << GTZC_MPCBB_SECCFGR_SEC3_Pos)         /*!< 0x00000008 */
#define GTZC_MPCBB_SECCFGR_SEC4_Pos      (4UL)
#define GTZC_MPCBB_SECCFGR_SEC4_Msk      (0x01UL << GTZC_MPCBB_SECCFGR_SEC4_Pos)         /*!< 0x00000010 */
#define GTZC_MPCBB_SECCFGR_SEC5_Pos      (5UL)
#define GTZC_MPCBB_SECCFGR_SEC5_Msk      (0x01UL << GTZC_MPCBB_SECCFGR_SEC5_Pos)         /*!< 0x00000020 */
#define GTZC_MPCBB_SECCFGR_SEC6_Pos      (6UL)
#define GTZC_MPCBB_SECCFGR_SEC6_Msk      (0x01UL << GTZC_MPCBB_SECCFGR_SEC6_Pos)         /*!< 0x00000040 */
#define GTZC_MPCBB_SECCFGR_SEC7_Pos      (7UL)
#define GTZC_MPCBB_SECCFGR_SEC7_Msk      (0x01UL << GTZC_MPCBB_SECCFGR_SEC7_Pos)         /*!< 0x00000080 */
#define GTZC_MPCBB_SECCFGR_SEC8_Pos      (8UL)
#define GTZC_MPCBB_SECCFGR_SEC8_Msk      (0x01UL << GTZC_MPCBB_SECCFGR_SEC8_Pos)         /*!< 0x00000100 */
#define GTZC_MPCBB_SECCFGR_SEC9_Pos      (9UL)
#define GTZC_MPCBB_SECCFGR_SEC9_Msk      (0x01UL << GTZC_MPCBB_SECCFGR_SEC9_Pos)         /*!< 0x00000200 */
#define GTZC_MPCBB_SECCFGR_SEC10_Pos     (10UL)
#define GTZC_MPCBB_SECCFGR_SEC10_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC10_Pos)        /*!< 0x00000400 */
#define GTZC_MPCBB_SECCFGR_SEC11_Pos     (11UL)
#define GTZC_MPCBB_SECCFGR_SEC11_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC11_Pos)        /*!< 0x00000800 */
#define GTZC_MPCBB_SECCFGR_SEC12_Pos     (12UL)
#define GTZC_MPCBB_SECCFGR_SEC12_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC12_Pos)        /*!< 0x00001000 */
#define GTZC_MPCBB_SECCFGR_SEC13_Pos     (13UL)
#define GTZC_MPCBB_SECCFGR_SEC13_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC13_Pos)        /*!< 0x00002000 */
#define GTZC_MPCBB_SECCFGR_SEC14_Pos     (14UL)
#define GTZC_MPCBB_SECCFGR_SEC14_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC14_Pos)        /*!< 0x00004000 */
#define GTZC_MPCBB_SECCFGR_SEC15_Pos     (15UL)
#define GTZC_MPCBB_SECCFGR_SEC15_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC15_Pos)        /*!< 0x00008000 */
#define GTZC_MPCBB_SECCFGR_SEC16_Pos     (16UL)
#define GTZC_MPCBB_SECCFGR_SEC16_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC16_Pos)        /*!< 0x00010000 */
#define GTZC_MPCBB_SECCFGR_SEC17_Pos     (17UL)
#define GTZC_MPCBB_SECCFGR_SEC17_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC17_Pos)        /*!< 0x00020000 */
#define GTZC_MPCBB_SECCFGR_SEC18_Pos     (18UL)
#define GTZC_MPCBB_SECCFGR_SEC18_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC18_Pos)        /*!< 0x00040000 */
#define GTZC_MPCBB_SECCFGR_SEC19_Pos     (19UL)
#define GTZC_MPCBB_SECCFGR_SEC19_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC19_Pos)        /*!< 0x00080000 */
#define GTZC_MPCBB_SECCFGR_SEC20_Pos     (20UL)
#define GTZC_MPCBB_SECCFGR_SEC20_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC20_Pos)        /*!< 0x00100000 */
#define GTZC_MPCBB_SECCFGR_SEC21_Pos     (21UL)
#define GTZC_MPCBB_SECCFGR_SEC21_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC21_Pos)        /*!< 0x00200000 */
#define GTZC_MPCBB_SECCFGR_SEC22_Pos     (22UL)
#define GTZC_MPCBB_SECCFGR_SEC22_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC22_Pos)        /*!< 0x00400000 */
#define GTZC_MPCBB_SECCFGR_SEC23_Pos     (23UL)
#define GTZC_MPCBB_SECCFGR_SEC23_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC23_Pos)        /*!< 0x00800000 */
#define GTZC_MPCBB_SECCFGR_SEC24_Pos     (24UL)
#define GTZC_MPCBB_SECCFGR_SEC24_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC24_Pos)        /*!< 0x01000000 */
#define GTZC_MPCBB_SECCFGR_SEC25_Pos     (25UL)
#define GTZC_MPCBB_SECCFGR_SEC25_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC25_Pos)        /*!< 0x02000000 */
#define GTZC_MPCBB_SECCFGR_SEC26_Pos     (26UL)
#define GTZC_MPCBB_SECCFGR_SEC26_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC26_Pos)        /*!< 0x04000000 */
#define GTZC_MPCBB_SECCFGR_SEC27_Pos     (27UL)
#define GTZC_MPCBB_SECCFGR_SEC27_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC27_Pos)        /*!< 0x08000000 */
#define GTZC_MPCBB_SECCFGR_SEC28_Pos     (28UL)
#define GTZC_MPCBB_SECCFGR_SEC28_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC28_Pos)        /*!< 0x10000000 */
#define GTZC_MPCBB_SECCFGR_SEC29_Pos     (29UL)
#define GTZC_MPCBB_SECCFGR_SEC29_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC29_Pos)        /*!< 0x20000000 */
#define GTZC_MPCBB_SECCFGR_SEC30_Pos     (30UL)
#define GTZC_MPCBB_SECCFGR_SEC30_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC30_Pos)        /*!< 0x40000000 */
#define GTZC_MPCBB_SECCFGR_SEC31_Pos     (31UL)
#define GTZC_MPCBB_SECCFGR_SEC31_Msk     (0x01UL << GTZC_MPCBB_SECCFGR_SEC31_Pos)        /*!< 0x80000000 */

/*******************  Bits definition for GTZC_MPCBB_PRIVCFGR register  ************/
#define GTZC_MPCBB_PRIVCFGR_PRIV0_Pos      (0UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV0_Msk      (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV0_Pos)     /*!< 0x00000001 */
#define GTZC_MPCBB_PRIVCFGR_PRIV1_Pos      (1UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV1_Msk      (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV1_Pos)     /*!< 0x00000002 */
#define GTZC_MPCBB_PRIVCFGR_PRIV2_Pos      (2UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV2_Msk      (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV2_Pos)     /*!< 0x00000004 */
#define GTZC_MPCBB_PRIVCFGR_PRIV3_Pos      (3UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV3_Msk      (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV3_Pos)     /*!< 0x00000008 */
#define GTZC_MPCBB_PRIVCFGR_PRIV4_Pos      (4UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV4_Msk      (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV4_Pos)     /*!< 0x00000010 */
#define GTZC_MPCBB_PRIVCFGR_PRIV5_Pos      (5UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV5_Msk      (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV5_Pos)     /*!< 0x00000020 */
#define GTZC_MPCBB_PRIVCFGR_PRIV6_Pos      (6UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV6_Msk      (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV6_Pos)     /*!< 0x00000040 */
#define GTZC_MPCBB_PRIVCFGR_PRIV7_Pos      (7UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV7_Msk      (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV7_Pos)     /*!< 0x00000080 */
#define GTZC_MPCBB_PRIVCFGR_PRIV8_Pos      (8UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV8_Msk      (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV8_Pos)     /*!< 0x00000100 */
#define GTZC_MPCBB_PRIVCFGR_PRIV9_Pos      (9UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV9_Msk      (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV9_Pos)     /*!< 0x00000200 */
#define GTZC_MPCBB_PRIVCFGR_PRIV10_Pos     (10UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV10_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV10_Pos)    /*!< 0x00000400 */
#define GTZC_MPCBB_PRIVCFGR_PRIV11_Pos     (11UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV11_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV11_Pos)    /*!< 0x00000800 */
#define GTZC_MPCBB_PRIVCFGR_PRIV12_Pos     (12UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV12_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV12_Pos)    /*!< 0x00001000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV13_Pos     (13UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV13_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV13_Pos)    /*!< 0x00002000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV14_Pos     (14UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV14_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV14_Pos)    /*!< 0x00004000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV15_Pos     (15UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV15_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV15_Pos)    /*!< 0x00008000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV16_Pos     (16UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV16_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV16_Pos)    /*!< 0x00010000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV17_Pos     (17UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV17_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV17_Pos)    /*!< 0x00020000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV18_Pos     (18UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV18_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV18_Pos)    /*!< 0x00040000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV19_Pos     (19UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV19_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV19_Pos)    /*!< 0x00080000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV20_Pos     (20UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV20_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV20_Pos)    /*!< 0x00100000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV21_Pos     (21UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV21_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV21_Pos)    /*!< 0x00200000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV22_Pos     (22UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV22_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV22_Pos)    /*!< 0x00400000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV23_Pos     (23UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV23_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV23_Pos)    /*!< 0x00800000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV24_Pos     (24UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV24_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV24_Pos)    /*!< 0x01000000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV25_Pos     (25UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV25_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV25_Pos)    /*!< 0x02000000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV26_Pos     (26UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV26_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV26_Pos)    /*!< 0x04000000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV27_Pos     (27UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV27_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV27_Pos)    /*!< 0x08000000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV28_Pos     (28UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV28_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV28_Pos)    /*!< 0x10000000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV29_Pos     (29UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV29_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV29_Pos)    /*!< 0x20000000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV30_Pos     (30UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV30_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV30_Pos)    /*!< 0x40000000 */
#define GTZC_MPCBB_PRIVCFGR_PRIV31_Pos     (31UL)
#define GTZC_MPCBB_PRIVCFGR_PRIV31_Msk     (0x01UL << GTZC_MPCBB_PRIVCFGR_PRIV31_Pos)    /*!< 0x80000000 */

/******************************************************************************/
/*                                                                            */
/*                                    HASH                                    */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for HASH_CR register  ********************/
#define HASH_CR_INIT_Pos                    (2UL)
#define HASH_CR_INIT_Msk                    (0x1UL << HASH_CR_INIT_Pos)             /*!< 0x00000004 */
#define HASH_CR_INIT                        HASH_CR_INIT_Msk
#define HASH_CR_DMAE_Pos                    (3UL)
#define HASH_CR_DMAE_Msk                    (0x1UL << HASH_CR_DMAE_Pos)             /*!< 0x00000008 */
#define HASH_CR_DMAE                        HASH_CR_DMAE_Msk
#define HASH_CR_DATATYPE_Pos                (4UL)
#define HASH_CR_DATATYPE_Msk                (0x3UL << HASH_CR_DATATYPE_Pos)         /*!< 0x00000030 */
#define HASH_CR_DATATYPE                    HASH_CR_DATATYPE_Msk
#define HASH_CR_DATATYPE_0                  (0x1UL << HASH_CR_DATATYPE_Pos)         /*!< 0x00000010 */
#define HASH_CR_DATATYPE_1                  (0x2UL << HASH_CR_DATATYPE_Pos)         /*!< 0x00000020 */
#define HASH_CR_MODE_Pos                    (6UL)
#define HASH_CR_MODE_Msk                    (0x1UL << HASH_CR_MODE_Pos)             /*!< 0x00000040 */
#define HASH_CR_MODE                        HASH_CR_MODE_Msk
#define HASH_CR_NBW_Pos                     (8UL)
#define HASH_CR_NBW_Msk                     (0xFUL << HASH_CR_NBW_Pos)              /*!< 0x00000F00 */
#define HASH_CR_NBW                         HASH_CR_NBW_Msk
#define HASH_CR_NBW_0                       (0x1UL << HASH_CR_NBW_Pos)              /*!< 0x00000100 */
#define HASH_CR_NBW_1                       (0x2UL << HASH_CR_NBW_Pos)              /*!< 0x00000200 */
#define HASH_CR_NBW_2                       (0x4UL << HASH_CR_NBW_Pos)              /*!< 0x00000400 */
#define HASH_CR_NBW_3                       (0x8UL << HASH_CR_NBW_Pos)              /*!< 0x00000800 */
#define HASH_CR_DINNE_Pos                   (12UL)
#define HASH_CR_DINNE_Msk                   (0x1UL << HASH_CR_DINNE_Pos)            /*!< 0x00001000 */
#define HASH_CR_DINNE                       HASH_CR_DINNE_Msk
#define HASH_CR_MDMAT_Pos                   (13UL)
#define HASH_CR_MDMAT_Msk                   (0x1UL << HASH_CR_MDMAT_Pos)            /*!< 0x00002000 */
#define HASH_CR_MDMAT                       HASH_CR_MDMAT_Msk
#define HASH_CR_LKEY_Pos                    (16UL)
#define HASH_CR_LKEY_Msk                    (0x1UL << HASH_CR_LKEY_Pos)             /*!< 0x00010000 */
#define HASH_CR_LKEY                        HASH_CR_LKEY_Msk
#define HASH_CR_ALGO_Pos                    (17UL)
#define HASH_CR_ALGO_Msk                    (0xFUL << HASH_CR_ALGO_Pos)             /*!< 0x001E0000 */
#define HASH_CR_ALGO                        HASH_CR_ALGO_Msk
#define HASH_CR_ALGO_0                      (0x1UL << HASH_CR_ALGO_Pos)             /*!< 0x00020000 */
#define HASH_CR_ALGO_1                      (0x2UL << HASH_CR_ALGO_Pos)             /*!< 0x00040000 */
#define HASH_CR_ALGO_2                      (0x4UL << HASH_CR_ALGO_Pos)             /*!< 0x00080000 */
#define HASH_CR_ALGO_3                      (0x8UL << HASH_CR_ALGO_Pos)             /*!< 0x00100000 */

