STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
#define HSP_ESYNC0SRCR_EV4SSRC_Pos (12UL)
#define HSP_ESYNC0SRCR_EV4SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV4SSRC_Pos) /*!< 0x00003000 */
#define HSP_ESYNC0SRCR_EV4SSRC     HSP_ESYNC0SRCR_EV4SSRC_Msk            /*!< EV4SSRC[1:0] bits (Event 4 synchronization source) */
#define HSP_ESYNC0SRCR_EV4SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV4SSRC_Pos) /*!< 0x00001000 */
#define HSP_ESYNC0SRCR_EV4SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV4SSRC_Pos) /*!< 0x00002000 */

#define HSP_ESYNC0SRCR_EV5SSRC_Pos (16UL)
#define HSP_ESYNC0SRCR_EV5SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV5SSRC_Pos) /*!< 0x00030000 */
#define HSP_ESYNC0SRCR_EV5SSRC     HSP_ESYNC0SRCR_EV5SSRC_Msk            /*!< EV5SSRC[1:0] bits (Event 5 synchronization source) */
#define HSP_ESYNC0SRCR_EV5SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV5SSRC_Pos) /*!< 0x00010000 */
#define HSP_ESYNC0SRCR_EV5SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV5SSRC_Pos) /*!< 0x00020000 */

#define HSP_ESYNC0SRCR_EV6SSRC_Pos (20UL)
#define HSP_ESYNC0SRCR_EV6SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV6SSRC_Pos) /*!< 0x00300000 */
#define HSP_ESYNC0SRCR_EV6SSRC     HSP_ESYNC0SRCR_EV6SSRC_Msk            /*!< EV6SSRC[1:0] bits (Event 6 synchronization source) */
#define HSP_ESYNC0SRCR_EV6SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV6SSRC_Pos) /*!< 0x00100000 */
#define HSP_ESYNC0SRCR_EV6SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV6SSRC_Pos) /*!< 0x00200000 */

#define HSP_ESYNC0SRCR_EV7SSRC_Pos (24UL)
#define HSP_ESYNC0SRCR_EV7SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV7SSRC_Pos) /*!< 0x03000000 */
#define HSP_ESYNC0SRCR_EV7SSRC     HSP_ESYNC0SRCR_EV7SSRC_Msk            /*!< EV7SSRC[1:0] bits (Event 7 synchronization source) */
#define HSP_ESYNC0SRCR_EV7SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV7SSRC_Pos) /*!< 0x01000000 */
#define HSP_ESYNC0SRCR_EV7SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV7SSRC_Pos) /*!< 0x02000000 */

#define HSP_ESYNC0SRCR_EV8SSRC_Pos (28UL)
#define HSP_ESYNC0SRCR_EV8SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV8SSRC_Pos) /*!< 0x30000000 */
#define HSP_ESYNC0SRCR_EV8SSRC     HSP_ESYNC0SRCR_EV8SSRC_Msk            /*!< EV8SSRC[1:0] bits (Event 8 synchronization source) */
#define HSP_ESYNC0SRCR_EV8SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV8SSRC_Pos) /*!< 0x10000000 */
#define HSP_ESYNC0SRCR_EV8SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV8SSRC_Pos) /*!< 0x20000000 */

/********************  Bit definition for HSP_ESYNC1SRCR register  ********************/

#define HSP_ESYNC1SRCR_EV9SSRC_Pos  (0UL)
#define HSP_ESYNC1SRCR_EV9SSRC_Msk  (0x3UL << HSP_ESYNC1SRCR_EV9SSRC_Pos)  /*!< 0x00000003 */
#define HSP_ESYNC1SRCR_EV9SSRC      HSP_ESYNC1SRCR_EV9SSRC_Msk             /*!< EV9SSRC[1:0] bits (Event 9 synchronization source) */
#define HSP_ESYNC1SRCR_EV9SSRC_0    (0x1UL << HSP_ESYNC1SRCR_EV9SSRC_Pos)  /*!< 0x00000001 */
#define HSP_ESYNC1SRCR_EV9SSRC_1    (0x2UL << HSP_ESYNC1SRCR_EV9SSRC_Pos)  /*!< 0x00000002 */

#define HSP_ESYNC1SRCR_EV10SSRC_Pos (4UL)
#define HSP_ESYNC1SRCR_EV10SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV10SSRC_Pos) /*!< 0x00000030 */
#define HSP_ESYNC1SRCR_EV10SSRC     HSP_ESYNC1SRCR_EV10SSRC_Msk            /*!< EV10SSRC[1:0] bits (Event 10 synchronization source) */
#define HSP_ESYNC1SRCR_EV10SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV10SSRC_Pos) /*!< 0x00000010 */
#define HSP_ESYNC1SRCR_EV10SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV10SSRC_Pos) /*!< 0x00000020 */

#define HSP_ESYNC1SRCR_EV11SSRC_Pos (8UL)
#define HSP_ESYNC1SRCR_EV11SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV11SSRC_Pos) /*!< 0x00000300 */
#define HSP_ESYNC1SRCR_EV11SSRC     HSP_ESYNC1SRCR_EV11SSRC_Msk            /*!< EV11SSRC[1:0] bits (Event 11 synchronization source) */
#define HSP_ESYNC1SRCR_EV11SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV11SSRC_Pos) /*!< 0x00000100 */
#define HSP_ESYNC1SRCR_EV11SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV11SSRC_Pos) /*!< 0x00000200 */

#define HSP_ESYNC1SRCR_EV12SSRC_Pos (12UL)
#define HSP_ESYNC1SRCR_EV12SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV12SSRC_Pos) /*!< 0x00003000 */
#define HSP_ESYNC1SRCR_EV12SSRC     HSP_ESYNC1SRCR_EV12SSRC_Msk            /*!< EV12SSRC[1:0] bits (Event 12 synchronization source) */
#define HSP_ESYNC1SRCR_EV12SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV12SSRC_Pos) /*!< 0x00001000 */
#define HSP_ESYNC1SRCR_EV12SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV12SSRC_Pos) /*!< 0x00002000 */

#define HSP_ESYNC1SRCR_EV13SSRC_Pos (16UL)
#define HSP_ESYNC1SRCR_EV13SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV13SSRC_Pos) /*!< 0x00030000 */
#define HSP_ESYNC1SRCR_EV13SSRC     HSP_ESYNC1SRCR_EV13SSRC_Msk            /*!< EV13SSRC[1:0] bits (Event 13 synchronization source) */
#define HSP_ESYNC1SRCR_EV13SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV13SSRC_Pos) /*!< 0x00010000 */
#define HSP_ESYNC1SRCR_EV13SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV13SSRC_Pos) /*!< 0x00020000 */

#define HSP_ESYNC1SRCR_EV14SSRC_Pos (20UL)
#define HSP_ESYNC1SRCR_EV14SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV14SSRC_Pos) /*!< 0x00300000 */
#define HSP_ESYNC1SRCR_EV14SSRC     HSP_ESYNC1SRCR_EV14SSRC_Msk            /*!< EV14SSRC[1:0] bits (Event 14 synchronization source) */
#define HSP_ESYNC1SRCR_EV14SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV14SSRC_Pos) /*!< 0x00100000 */
#define HSP_ESYNC1SRCR_EV14SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV14SSRC_Pos) /*!< 0x00200000 */

#define HSP_ESYNC1SRCR_EV15SSRC_Pos (24UL)
#define HSP_ESYNC1SRCR_EV15SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV15SSRC_Pos) /*!< 0x03000000 */
#define HSP_ESYNC1SRCR_EV15SSRC     HSP_ESYNC1SRCR_EV15SSRC_Msk            /*!< EV15SSRC[1:0] bits (Event 15 synchronization source) */
#define HSP_ESYNC1SRCR_EV15SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV15SSRC_Pos) /*!< 0x01000000 */
#define HSP_ESYNC1SRCR_EV15SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV15SSRC_Pos) /*!< 0x02000000 */

#define HSP_ESYNC1SRCR_EV16SSRC_Pos (28UL)
#define HSP_ESYNC1SRCR_EV16SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV16SSRC_Pos) /*!< 0x30000000 */
#define HSP_ESYNC1SRCR_EV16SSRC     HSP_ESYNC1SRCR_EV16SSRC_Msk            /*!< EV16SSRC[1:0] bits (Event 16 synchronization source) */
#define HSP_ESYNC1SRCR_EV16SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV16SSRC_Pos) /*!< 0x10000000 */
#define HSP_ESYNC1SRCR_EV16SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV16SSRC_Pos) /*!< 0x20000000 */

/********************  Bit definition for HSP_ESYNC2SRCR register  ********************/

#define HSP_ESYNC2SRCR_EV17SSRC_Pos (0UL)
#define HSP_ESYNC2SRCR_EV17SSRC_Msk (0x3UL << HSP_ESYNC2SRCR_EV17SSRC_Pos) /*!< 0x00000003 */
#define HSP_ESYNC2SRCR_EV17SSRC     HSP_ESYNC2SRCR_EV17SSRC_Msk            /*!< EV17SSRC[1:0] bits (Event 17 synchronization source) */
#define HSP_ESYNC2SRCR_EV17SSRC_0   (0x1UL << HSP_ESYNC2SRCR_EV17SSRC_Pos) /*!< 0x00000001 */
#define HSP_ESYNC2SRCR_EV17SSRC_1   (0x2UL << HSP_ESYNC2SRCR_EV17SSRC_Pos) /*!< 0x00000002 */

