STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
#define HSP_TCUCFGR_TC2EN_Pos   (23UL)
#define HSP_TCUCFGR_TC2EN_Msk   (0x1UL << HSP_TCUCFGR_TC2EN_Pos)    /*!< 0x00800000 */
#define HSP_TCUCFGR_TC2EN       HSP_TCUCFGR_TC2EN_Msk               /*!< TC2EN (Task comparator 2 enable <sup>(1)</sup>) */

#define HSP_TCUCFGR_TSKCMP3_Pos (24UL)
#define HSP_TCUCFGR_TSKCMP3_Msk (0x3FUL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x3F000000 */
#define HSP_TCUCFGR_TSKCMP3     HSP_TCUCFGR_TSKCMP3_Msk             /*!< TSKCMP3[5:0] bits (Task compare 3 <sup>(1)</sup>) */
#define HSP_TCUCFGR_TSKCMP3_0   (0x01UL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x01000000 */
#define HSP_TCUCFGR_TSKCMP3_1   (0x02UL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x02000000 */
#define HSP_TCUCFGR_TSKCMP3_2   (0x04UL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x04000000 */
#define HSP_TCUCFGR_TSKCMP3_3   (0x08UL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x08000000 */
#define HSP_TCUCFGR_TSKCMP3_4   (0x10UL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x10000000 */
#define HSP_TCUCFGR_TSKCMP3_5   (0x20UL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x20000000 */

#define HSP_TCUCFGR_TC3EN_Pos   (31UL)
#define HSP_TCUCFGR_TC3EN_Msk   (0x1UL << HSP_TCUCFGR_TC3EN_Pos)    /*!< 0x80000000 */
#define HSP_TCUCFGR_TC3EN       HSP_TCUCFGR_TC3EN_Msk               /*!< TC3EN (Task comparator 3 enable ) */

/********************  Bit definition for HSP_TOVLPCR register  ********************/
#define HSP_TOVLPCR_TOVLPEN_Pos (0UL)
#define HSP_TOVLPCR_TOVLPEN_Msk (0x1UL << HSP_TOVLPCR_TOVLPEN_Pos) /*!< 0x00000001 */
#define HSP_TOVLPCR_TOVLPEN     HSP_TOVLPCR_TOVLPEN_Msk            /*!< TOVLPEN (Task overlap enable <sup>(1)</sup>) */

#define HSP_TOVLPCR_LTNB_Pos    (8UL)
#define HSP_TOVLPCR_LTNB_Msk    (0x3FUL << HSP_TOVLPCR_LTNB_Pos)   /*!< 0x00003F00 */
#define HSP_TOVLPCR_LTNB        HSP_TOVLPCR_LTNB_Msk               /*!< LTNB[5:0] bits (Lower task number value <sup>(1)</sup>) */

#define HSP_TOVLPCR_HTNB_Pos    (16UL)
#define HSP_TOVLPCR_HTNB_Msk    (0x3FUL << HSP_TOVLPCR_HTNB_Pos)   /*!< 0x003F0000 */
#define HSP_TOVLPCR_HTNB        HSP_TOVLPCR_HTNB_Msk               /*!< HTNB[5:0] bits (Higher task number value ) */

/********************  Bit definition for HSP_SNPR register  ********************/
#define HSP_SNPR_SNPSELA_Pos (0UL)
#define HSP_SNPR_SNPSELA_Msk (0x7UL << HSP_SNPR_SNPSELA_Pos) /*!< 0x00000007 */
#define HSP_SNPR_SNPSELA     HSP_SNPR_SNPSELA_Msk            /*!< SNPSELA[2:0] bits (Snoop group A signal selection) */
#define HSP_SNPR_SNPSELA_0   (0x1UL << HSP_SNPR_SNPSELA_Pos) /*!< 0x00000001 */
#define HSP_SNPR_SNPSELA_1   (0x2UL << HSP_SNPR_SNPSELA_Pos) /*!< 0x00000002 */
#define HSP_SNPR_SNPSELA_2   (0x4UL << HSP_SNPR_SNPSELA_Pos) /*!< 0x00000004 */

#define HSP_SNPR_SNPSELB_Pos (4UL)
#define HSP_SNPR_SNPSELB_Msk (0x7UL << HSP_SNPR_SNPSELB_Pos) /*!< 0x00000070 */
#define HSP_SNPR_SNPSELB     HSP_SNPR_SNPSELB_Msk            /*!< SNPSELB[2:0] bits (Snoop group B signal selection) */
#define HSP_SNPR_SNPSELB_0   (0x1UL << HSP_SNPR_SNPSELB_Pos) /*!< 0x00000010 */
#define HSP_SNPR_SNPSELB_1   (0x2UL << HSP_SNPR_SNPSELB_Pos) /*!< 0x00000020 */
#define HSP_SNPR_SNPSELB_2   (0x4UL << HSP_SNPR_SNPSELB_Pos) /*!< 0x00000040 */

/********************  Bit definition for HSP_CCNTR register  ********************/
#define HSP_CCNTR_CCNTR_Pos (0UL)
#define HSP_CCNTR_CCNTR_Msk (0xFFFFFFFFUL << HSP_CCNTR_CCNTR_Pos) /*!< 0xFFFFFFFF */
#define HSP_CCNTR_CCNTR     HSP_CCNTR_CCNTR_Msk                   /*!< CCNTR[31:0] bits (Conflict counter) */

/******************  Bit definition for HSP_CAPDR register  *******************/
#define HSP_CAPDR_TSTAMP_Pos            (0UL)
#define HSP_CAPDR_TSTAMP_Msk            (0x3FFFUL << HSP_CAPDR_TSTAMP_Pos)      /*!< 0x00003FFF */
#define HSP_CAPDR_TSTAMP                HSP_CAPDR_TSTAMP_Msk                    /*!< Time-stamp value */
#define HSP_CAPDR_IFHIST_Pos            (14UL)
#define HSP_CAPDR_IFHIST_Msk            (0xFFUL << HSP_CAPDR_IFHIST_Pos)        /*!< 0x003FC000 */
#define HSP_CAPDR_IFHIST                HSP_CAPDR_IFHIST_Msk                    /*!< IF condition history */
#define HSP_CAPDR_IFCNT_Pos             (22UL)
#define HSP_CAPDR_IFCNT_Msk             (0xFUL << HSP_CAPDR_IFCNT_Pos)          /*!< 0x03C00000 */
#define HSP_CAPDR_IFCNT                 HSP_CAPDR_IFCNT_Msk                     /*!< IF instruction counter */
#define HSP_CAPDR_TSKNB_Pos             (26UL)
#define HSP_CAPDR_TSKNB_Msk             (0x3FUL << HSP_CAPDR_TSKNB_Pos)         /*!< 0xFC000000 */
#define HSP_CAPDR_TSKNB                 HSP_CAPDR_TSKNB_Msk                     /*!< Last captured task number */

#define HSP_CAPDR_ALT_IFHIST_Pos        (0UL)
#define HSP_CAPDR_ALT_IFHIST_Msk        (0x7FFFUL << HSP_CAPDR_ALT_IFHIST_Pos)  /*!< 0x00007FFF */
#define HSP_CAPDR_ALT_IFHIST            HSP_CAPDR_IFHIST_Msk                    /*!< IF condition history */
#define HSP_CAPDR_ALT_PFCTNB_Pos        (16UL)
#define HSP_CAPDR_ALT_PFCTNB_Msk        (0x3FUL << HSP_CAPDR_ALT_PFCTNB_Pos)    /*!< 0x0003F0000 */
#define HSP_CAPDR_ALT_PFCTNB            HSP_CAPDR_TSTAMP_Msk                    /*!< Processing Function Number */
#define HSP_CAPDR_ALT_IFCNT_Pos         (22UL)
#define HSP_CAPDR_ALT_IFCNT_Msk         (0xFUL << HSP_CAPDR_ALT_IFCNT_Pos)      /*!< 0x03C00000 */
#define HSP_CAPDR_ALT_IFCNT             HSP_CAPDR_IFCNT_Msk                     /*!< IF instruction counter */
#define HSP_CAPDR_ALT_TSKNB_Pos         (26UL)
#define HSP_CAPDR_ALT_TSKNB_Msk         (0x3FUL << HSP_CAPDR_ALT_TSKNB_Pos)     /*!< 0xFC000000 */
#define HSP_CAPDR_ALT_TSKNB             HSP_CAPDR_TSKNB_Msk                     /*!< Last captured task number */

/********************  Bit definition for HSP_CAPCR register  ********************/
#define HSP_CAPCR_CAPMOD_Pos  (0UL)
#define HSP_CAPCR_CAPMOD_Msk  (0x3UL << HSP_CAPCR_CAPMOD_Pos)  /*!< 0x00000003 */
#define HSP_CAPCR_CAPMOD      HSP_CAPCR_CAPMOD_Msk             /*!< CAPMOD[1:0] bits (Capture mode ) */
#define HSP_CAPCR_CAPMOD_0    (0x1UL << HSP_CAPCR_CAPMOD_Pos)  /*!< 0x00000001 */
#define HSP_CAPCR_CAPMOD_1    (0x2UL << HSP_CAPCR_CAPMOD_Pos)  /*!< 0x00000002 */

#define HSP_CAPCR_FRCNTEN_Pos (2UL)
#define HSP_CAPCR_FRCNTEN_Msk (0x1UL << HSP_CAPCR_FRCNTEN_Pos) /*!< 0x00000004 */
#define HSP_CAPCR_FRCNTEN     HSP_CAPCR_FRCNTEN_Msk            /*!< FRCNTEN (Free-running counter enable ) */

