STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
#define HSP_CAPCR_PRESC_Pos   (4UL)
#define HSP_CAPCR_PRESC_Msk   (0x1FUL << HSP_CAPCR_PRESC_Pos)  /*!< 0x000001F0 */
#define HSP_CAPCR_PRESC       HSP_CAPCR_PRESC_Msk              /*!< PRESC[4:0] bits (Time-stamp prescaler value ) */
#define HSP_CAPCR_PRESC_0     (0x01UL << HSP_CAPCR_PRESC_Pos)  /*!< 0x00000010 */
#define HSP_CAPCR_PRESC_1     (0x02UL << HSP_CAPCR_PRESC_Pos)  /*!< 0x00000020 */
#define HSP_CAPCR_PRESC_2     (0x04UL << HSP_CAPCR_PRESC_Pos)  /*!< 0x00000040 */
#define HSP_CAPCR_PRESC_3     (0x08UL << HSP_CAPCR_PRESC_Pos)  /*!< 0x00000080 */
#define HSP_CAPCR_PRESC_4     (0x10UL << HSP_CAPCR_PRESC_Pos)  /*!< 0x00000100 */

#define HSP_CAPCR_TSKFLT_Pos  (12UL)
#define HSP_CAPCR_TSKFLT_Msk  (0x1UL << HSP_CAPCR_TSKFLT_Pos)  /*!< 0x00001000 */
#define HSP_CAPCR_TSKFLT      HSP_CAPCR_TSKFLT_Msk             /*!< TSKFLT (Task filter enable <sup>(1)</sup>) */

#define HSP_CAPCR_CCNTREN_Pos (16UL)
#define HSP_CAPCR_CCNTREN_Msk (0x1UL << HSP_CAPCR_CCNTREN_Pos) /*!< 0x00010000 */
#define HSP_CAPCR_CCNTREN     HSP_CAPCR_CCNTREN_Msk            /*!< CCNTREN (Conflict counter enable ) */

/********************  Bit definition for HSP_ERR_IER register  ********************/
#define HSP_ERR_IER_TRGIOVRIE_Pos (8UL)
#define HSP_ERR_IER_TRGIOVRIE_Msk (0x1UL << HSP_ERR_IER_TRGIOVRIE_Pos) /*!< 0x00000100 */
#define HSP_ERR_IER_TRGIOVRIE     HSP_ERR_IER_TRGIOVRIE_Msk            /*!< TRGIOVRIE (TRGITF overrun interrupt enable) */

#define HSP_ERR_IER_B0ERRIE_Pos   (12UL)
#define HSP_ERR_IER_B0ERRIE_Msk   (0x1UL << HSP_ERR_IER_B0ERRIE_Pos)   /*!< 0x00001000 */
#define HSP_ERR_IER_B0ERRIE       HSP_ERR_IER_B0ERRIE_Msk              /*!< B0ERRIE (H2CBUFF0 underrun or C2HBUFF0 overrun interrupt enable) */

#define HSP_ERR_IER_B1ERRIE_Pos   (13UL)
#define HSP_ERR_IER_B1ERRIE_Msk   (0x1UL << HSP_ERR_IER_B1ERRIE_Pos)   /*!< 0x00002000 */
#define HSP_ERR_IER_B1ERRIE       HSP_ERR_IER_B1ERRIE_Msk              /*!< B1ERRIE (H2CBUFF1 underrun or C2HBUFF1 overrun interrupt enable) */

#define HSP_ERR_IER_B2ERRIE_Pos   (14UL)
#define HSP_ERR_IER_B2ERRIE_Msk   (0x1UL << HSP_ERR_IER_B2ERRIE_Pos)   /*!< 0x00004000 */
#define HSP_ERR_IER_B2ERRIE       HSP_ERR_IER_B2ERRIE_Msk              /*!< B2ERRIE (H2CBUFF2 underrun or C2HBUFF2 overrun interrupt enable) */

#define HSP_ERR_IER_B3ERRIE_Pos   (15UL)
#define HSP_ERR_IER_B3ERRIE_Msk   (0x1UL << HSP_ERR_IER_B3ERRIE_Pos)   /*!< 0x00008000 */
#define HSP_ERR_IER_B3ERRIE       HSP_ERR_IER_B3ERRIE_Msk              /*!< B3ERRIE (H2CBUFF3 underrun or C2HBUFF3 overrun interrupt enable) */

#define HSP_ERR_IER_CAPOVRIE_Pos  (16UL)
#define HSP_ERR_IER_CAPOVRIE_Msk  (0x1UL << HSP_ERR_IER_CAPOVRIE_Pos)  /*!< 0x00010000 */
#define HSP_ERR_IER_CAPOVRIE      HSP_ERR_IER_CAPOVRIE_Msk             /*!< CAPOVRIE (Capture register overrun interrupt enable) */

#define HSP_ERR_IER_FWERRIE_Pos   (17UL)
#define HSP_ERR_IER_FWERRIE_Msk   (0x1UL << HSP_ERR_IER_FWERRIE_Pos)   /*!< 0x00020000 */
#define HSP_ERR_IER_FWERRIE       HSP_ERR_IER_FWERRIE_Msk              /*!< FWERRIE (Firmware error interrupt enable) */

#define HSP_ERR_IER_SCHERRIE_Pos  (18UL)
#define HSP_ERR_IER_SCHERRIE_Msk  (0x1UL << HSP_ERR_IER_SCHERRIE_Pos)  /*!< 0x00040000 */
#define HSP_ERR_IER_SCHERRIE      HSP_ERR_IER_SCHERRIE_Msk             /*!< SCHERRIE (Scheduler error interrupt enable) */

#define HSP_ERR_IER_BKINIE_Pos    (19UL)
#define HSP_ERR_IER_BKINIE_Msk    (0x1UL << HSP_ERR_IER_BKINIE_Pos)    /*!< 0x00080000 */
#define HSP_ERR_IER_BKINIE        HSP_ERR_IER_BKINIE_Msk               /*!< BKINIE (Break input interrupt enable) */

#define HSP_ERR_IER_HDEGOVRIE_Pos (20UL)
#define HSP_ERR_IER_HDEGOVRIE_Msk (0x1UL << HSP_ERR_IER_HDEGOVRIE_Pos) /*!< 0x00100000 */
#define HSP_ERR_IER_HDEGOVRIE     HSP_ERR_IER_HDEGOVRIE_Msk            /*!< HDEGOVRIE (SPE event overrun interrupt enable) */

#define HSP_ERR_IER_OPCOERRIE_Pos (22UL)
#define HSP_ERR_IER_OPCOERRIE_Msk (0x1UL << HSP_ERR_IER_OPCOERRIE_Pos) /*!< 0x00400000 */
#define HSP_ERR_IER_OPCOERRIE     HSP_ERR_IER_OPCOERRIE_Msk            /*!< OPCOERRIE (Invalid Op. code error interrupt enable) */

#define HSP_ERR_IER_ACCERRIE_Pos  (23UL)
#define HSP_ERR_IER_ACCERRIE_Msk  (0x1UL << HSP_ERR_IER_ACCERRIE_Pos)  /*!< 0x00800000 */
#define HSP_ERR_IER_ACCERRIE      HSP_ERR_IER_ACCERRIE_Msk             /*!< ACCERRIE (SPE access error interrupt enable) */

#define HSP_ERR_IER_UDFIE_Pos     (24UL)
#define HSP_ERR_IER_UDFIE_Msk     (0x1UL << HSP_ERR_IER_UDFIE_Pos)     /*!< 0x01000000 */
#define HSP_ERR_IER_UDFIE         HSP_ERR_IER_UDFIE_Msk                /*!< UDFIE (FPU Underflow exception interrupt enable) */

#define HSP_ERR_IER_OVFIE_Pos     (25UL)
#define HSP_ERR_IER_OVFIE_Msk     (0x1UL << HSP_ERR_IER_OVFIE_Pos)     /*!< 0x02000000 */
#define HSP_ERR_IER_OVFIE         HSP_ERR_IER_OVFIE_Msk                /*!< OVFIE (FPU Overflow exception interrupt enable) */

#define HSP_ERR_IER_DBZIE_Pos     (26UL)
#define HSP_ERR_IER_DBZIE_Msk     (0x1UL << HSP_ERR_IER_DBZIE_Pos)     /*!< 0x04000000 */
#define HSP_ERR_IER_DBZIE         HSP_ERR_IER_DBZIE_Msk                /*!< DBZIE (FPU division-by-zero exception interrupt enable) */

#define HSP_ERR_IER_INVIE_Pos     (27UL)
#define HSP_ERR_IER_INVIE_Msk     (0x1UL << HSP_ERR_IER_INVIE_Pos)     /*!< 0x08000000 */
#define HSP_ERR_IER_INVIE         HSP_ERR_IER_INVIE_Msk                /*!< INVIE (FPU Invalid exception interrupt enable) */

#define HSP_ERR_IER_DENORMIE_Pos  (28UL)
#define HSP_ERR_IER_DENORMIE_Msk  (0x1UL << HSP_ERR_IER_DENORMIE_Pos)  /*!< 0x10000000 */
#define HSP_ERR_IER_DENORMIE      HSP_ERR_IER_DENORMIE_Msk             /*!< DENORMIE (FPU denormal interrupt enable) */

/********************  Bit definition for HSP_EVT_IER register  ********************/
#define HSP_EVT_IER_H2CMRDYIE_Pos  (0UL)
#define HSP_EVT_IER_H2CMRDYIE_Msk  (0x1UL << HSP_EVT_IER_H2CMRDYIE_Pos)  /*!< 0x00000001 */
#define HSP_EVT_IER_H2CMRDYIE      HSP_EVT_IER_H2CMRDYIE_Msk             /*!< H2CMRDYIE (HSP to CPU message ready interrupt enable) */

#define HSP_EVT_IER_C2HMFREEIE_Pos (1UL)
#define HSP_EVT_IER_C2HMFREEIE_Msk (0x1UL << HSP_EVT_IER_C2HMFREEIE_Pos) /*!< 0x00000002 */
#define HSP_EVT_IER_C2HMFREEIE     HSP_EVT_IER_C2HMFREEIE_Msk            /*!< C2HMFREEIE (CPU to HSP message box free interrupt enable) */

#define HSP_EVT_IER_DCDONEIE_Pos   (2UL)
#define HSP_EVT_IER_DCDONEIE_Msk   (0x1UL << HSP_EVT_IER_DCDONEIE_Pos)   /*!< 0x00000004 */
#define HSP_EVT_IER_DCDONEIE       HSP_EVT_IER_DCDONEIE_Msk              /*!< DCDONEIE (Direct command done interrupt enable) */

#define HSP_EVT_IER_CAPRDYIE_Pos   (4UL)
#define HSP_EVT_IER_CAPRDYIE_Msk   (0x1UL << HSP_EVT_IER_CAPRDYIE_Pos)   /*!< 0x00000010 */
#define HSP_EVT_IER_CAPRDYIE       HSP_EVT_IER_CAPRDYIE_Msk              /*!< CAPRDYIE (Capture buffer data ready interrupt enable) */

#define HSP_EVT_IER_CDEGRDYIE_Pos  (7UL)
#define HSP_EVT_IER_CDEGRDYIE_Msk  (0x1UL << HSP_EVT_IER_CDEGRDYIE_Pos)  /*!< 0x00000080 */
#define HSP_EVT_IER_CDEGRDYIE      HSP_EVT_IER_CDEGRDYIE_Msk             /*!< CDEGRDYIE (CPU Dedicated event generator ready interrupt enable) */

#define HSP_EVT_IER_SOFWFEIE_Pos   (8UL)
#define HSP_EVT_IER_SOFWFEIE_Msk   (0x1UL << HSP_EVT_IER_SOFWFEIE_Pos)   /*!< 0x00000100 */
#define HSP_EVT_IER_SOFWFEIE       HSP_EVT_IER_SOFWFEIE_Msk              /*!< SOFWFEIE (Start of WFE interrupt enable) */

