STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
#define HSP_ERR_ISR_B0ERRF_Pos   (12UL)
#define HSP_ERR_ISR_B0ERRF_Msk   (0x1UL << HSP_ERR_ISR_B0ERRF_Pos)   /*!< 0x00001000 */
#define HSP_ERR_ISR_B0ERRF       HSP_ERR_ISR_B0ERRF_Msk              /*!< B0ERRF (H2CBUFF0 underrun or C2HBUFF0 overrun flag) */

#define HSP_ERR_ISR_B1ERRF_Pos   (13UL)
#define HSP_ERR_ISR_B1ERRF_Msk   (0x1UL << HSP_ERR_ISR_B1ERRF_Pos)   /*!< 0x00002000 */
#define HSP_ERR_ISR_B1ERRF       HSP_ERR_ISR_B1ERRF_Msk              /*!< B1ERRF (H2CBUFF1 underrun or C2HBUFF1 overrun flag) */

#define HSP_ERR_ISR_B2ERRF_Pos   (14UL)
#define HSP_ERR_ISR_B2ERRF_Msk   (0x1UL << HSP_ERR_ISR_B2ERRF_Pos)   /*!< 0x00004000 */
#define HSP_ERR_ISR_B2ERRF       HSP_ERR_ISR_B2ERRF_Msk              /*!< B2ERRF (H2CBUFF2 underrun or C2HBUFF2 overrun flag) */

#define HSP_ERR_ISR_B3ERRF_Pos   (15UL)
#define HSP_ERR_ISR_B3ERRF_Msk   (0x1UL << HSP_ERR_ISR_B3ERRF_Pos)   /*!< 0x00008000 */
#define HSP_ERR_ISR_B3ERRF       HSP_ERR_ISR_B3ERRF_Msk              /*!< B3ERRF (H2CBUFF3 underrun or C2HBUFF3 overrun flag) */

#define HSP_ERR_ISR_CAPOVRF_Pos  (16UL)
#define HSP_ERR_ISR_CAPOVRF_Msk  (0x1UL << HSP_ERR_ISR_CAPOVRF_Pos)  /*!< 0x00010000 */
#define HSP_ERR_ISR_CAPOVRF      HSP_ERR_ISR_CAPOVRF_Msk             /*!< CAPOVRF (Capture register overrun flag) */

#define HSP_ERR_ISR_FWERRF_Pos   (17UL)
#define HSP_ERR_ISR_FWERRF_Msk   (0x1UL << HSP_ERR_ISR_FWERRF_Pos)   /*!< 0x00020000 */
#define HSP_ERR_ISR_FWERRF       HSP_ERR_ISR_FWERRF_Msk              /*!< FWERRF (Firmware error flag) */

#define HSP_ERR_ISR_SCHERRF_Pos  (18UL)
#define HSP_ERR_ISR_SCHERRF_Msk  (0x1UL << HSP_ERR_ISR_SCHERRF_Pos)  /*!< 0x00040000 */
#define HSP_ERR_ISR_SCHERRF      HSP_ERR_ISR_SCHERRF_Msk             /*!< SCHERRF (Scheduler error flag) */

#define HSP_ERR_ISR_BKINF_Pos    (19UL)
#define HSP_ERR_ISR_BKINF_Msk    (0x1UL << HSP_ERR_ISR_BKINF_Pos)    /*!< 0x00080000 */
#define HSP_ERR_ISR_BKINF        HSP_ERR_ISR_BKINF_Msk               /*!< BKINF (Break input flag) */

#define HSP_ERR_ISR_HDEGOVRF_Pos (20UL)
#define HSP_ERR_ISR_HDEGOVRF_Msk (0x1UL << HSP_ERR_ISR_HDEGOVRF_Pos) /*!< 0x00100000 */
#define HSP_ERR_ISR_HDEGOVRF     HSP_ERR_ISR_HDEGOVRF_Msk            /*!< HDEGOVRF (SPE event overrun flag) */

#define HSP_ERR_ISR_OPCOERRF_Pos (22UL)
#define HSP_ERR_ISR_OPCOERRF_Msk (0x1UL << HSP_ERR_ISR_OPCOERRF_Pos) /*!< 0x00400000 */
#define HSP_ERR_ISR_OPCOERRF     HSP_ERR_ISR_OPCOERRF_Msk            /*!< OPCOERRF (Invalid OpCode error flag) */

#define HSP_ERR_ISR_ACCERRF_Pos  (23UL)
#define HSP_ERR_ISR_ACCERRF_Msk  (0x1UL << HSP_ERR_ISR_ACCERRF_Pos)  /*!< 0x00800000 */
#define HSP_ERR_ISR_ACCERRF      HSP_ERR_ISR_ACCERRF_Msk             /*!< ACCERRF (SPE Access error flag) */

#define HSP_ERR_ISR_FPUERRF_Pos  (24UL)
#define HSP_ERR_ISR_FPUERRF_Msk  (0x1UL << HSP_ERR_ISR_FPUERRF_Pos)  /*!< 0x01000000 */
#define HSP_ERR_ISR_FPUERRF      HSP_ERR_ISR_FPUERRF_Msk             /*!< FPUERRF (Computation error flag) */

/********************  Bit definition for HSP_EVT_ISR register  ********************/
#define HSP_EVT_ISR_H2CMRDYF_Pos  (0UL)
#define HSP_EVT_ISR_H2CMRDYF_Msk  (0x1UL << HSP_EVT_ISR_H2CMRDYF_Pos)  /*!< 0x00000001 */
#define HSP_EVT_ISR_H2CMRDYF      HSP_EVT_ISR_H2CMRDYF_Msk             /*!< H2CMRDYF (HSP to CPU message ready flag) */

#define HSP_EVT_ISR_C2HMFREEF_Pos (1UL)
#define HSP_EVT_ISR_C2HMFREEF_Msk (0x1UL << HSP_EVT_ISR_C2HMFREEF_Pos) /*!< 0x00000002 */
#define HSP_EVT_ISR_C2HMFREEF     HSP_EVT_ISR_C2HMFREEF_Msk            /*!< C2HMFREEF (CPU to HSP message box free flag) */

#define HSP_EVT_ISR_DCDONEF_Pos   (2UL)
#define HSP_EVT_ISR_DCDONEF_Msk   (0x1UL << HSP_EVT_ISR_DCDONEF_Pos)   /*!< 0x00000004 */
#define HSP_EVT_ISR_DCDONEF       HSP_EVT_ISR_DCDONEF_Msk              /*!< DCDONEF (Direct command done flag) */

#define HSP_EVT_ISR_CAPRDYF_Pos   (4UL)
#define HSP_EVT_ISR_CAPRDYF_Msk   (0x1UL << HSP_EVT_ISR_CAPRDYF_Pos)   /*!< 0x00000010 */
#define HSP_EVT_ISR_CAPRDYF       HSP_EVT_ISR_CAPRDYF_Msk              /*!< CAPRDYF (Capture buffer data ready flag) */

#define HSP_EVT_ISR_CDEGRDYF_Pos  (7UL)
#define HSP_EVT_ISR_CDEGRDYF_Msk  (0x1UL << HSP_EVT_ISR_CDEGRDYF_Pos)  /*!< 0x00000080 */
#define HSP_EVT_ISR_CDEGRDYF      HSP_EVT_ISR_CDEGRDYF_Msk             /*!< CDEGRDYF (CPU Dedicated event generator ready flag) */

#define HSP_EVT_ISR_SOFWFEF_Pos   (8UL)
#define HSP_EVT_ISR_SOFWFEF_Msk   (0x1UL << HSP_EVT_ISR_SOFWFEF_Pos)   /*!< 0x00000100 */
#define HSP_EVT_ISR_SOFWFEF       HSP_EVT_ISR_SOFWFEF_Msk              /*!< SOFWFEF (Start of WFE flag) */

#define HSP_EVT_ISR_EOFWFEF_Pos   (9UL)
#define HSP_EVT_ISR_EOFWFEF_Msk   (0x1UL << HSP_EVT_ISR_EOFWFEF_Pos)   /*!< 0x00000200 */
#define HSP_EVT_ISR_EOFWFEF       HSP_EVT_ISR_EOFWFEF_Msk              /*!< EOFWFEF (End of WFE flag) */

#define HSP_EVT_ISR_B0EVTF_Pos    (12UL)
#define HSP_EVT_ISR_B0EVTF_Msk    (0x1UL << HSP_EVT_ISR_B0EVTF_Pos)    /*!< 0x00001000 */
#define HSP_EVT_ISR_B0EVTF        HSP_EVT_ISR_B0EVTF_Msk               /*!< B0EVTF (BUFF0 event flag) */

#define HSP_EVT_ISR_B1EVTF_Pos    (13UL)
#define HSP_EVT_ISR_B1EVTF_Msk    (0x1UL << HSP_EVT_ISR_B1EVTF_Pos)    /*!< 0x00002000 */
#define HSP_EVT_ISR_B1EVTF        HSP_EVT_ISR_B1EVTF_Msk               /*!< B1EVTF (BUFF1 event flag) */

#define HSP_EVT_ISR_B2EVTF_Pos    (14UL)
#define HSP_EVT_ISR_B2EVTF_Msk    (0x1UL << HSP_EVT_ISR_B2EVTF_Pos)    /*!< 0x00004000 */
#define HSP_EVT_ISR_B2EVTF        HSP_EVT_ISR_B2EVTF_Msk               /*!< B2EVTF (BUFF2 event flag) */

#define HSP_EVT_ISR_B3EVTF_Pos    (15UL)
#define HSP_EVT_ISR_B3EVTF_Msk    (0x1UL << HSP_EVT_ISR_B3EVTF_Pos)    /*!< 0x00008000 */
#define HSP_EVT_ISR_B3EVTF        HSP_EVT_ISR_B3EVTF_Msk               /*!< B3EVTF (BUFF3 event flag) */

#define HSP_EVT_ISR_SOTECP0F_Pos  (16UL)
#define HSP_EVT_ISR_SOTECP0F_Msk  (0x1UL << HSP_EVT_ISR_SOTECP0F_Pos)  /*!< 0x00010000 */
#define HSP_EVT_ISR_SOTECP0F      HSP_EVT_ISR_SOTECP0F_Msk             /*!< SOTECP0F (Start of task flag, for event comparator 0) */

#define HSP_EVT_ISR_SOTECP1F_Pos  (17UL)
#define HSP_EVT_ISR_SOTECP1F_Msk  (0x1UL << HSP_EVT_ISR_SOTECP1F_Pos)  /*!< 0x00020000 */
#define HSP_EVT_ISR_SOTECP1F      HSP_EVT_ISR_SOTECP1F_Msk             /*!< SOTECP1F (Start of task flag, for event comparator 1) */

