STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
#define HSP_EVT_ISR_SOTECP2F_Pos  (18UL)
#define HSP_EVT_ISR_SOTECP2F_Msk  (0x1UL << HSP_EVT_ISR_SOTECP2F_Pos)  /*!< 0x00040000 */
#define HSP_EVT_ISR_SOTECP2F      HSP_EVT_ISR_SOTECP2F_Msk             /*!< SOTECP2F (Start of task flag, for event comparator 2) */

#define HSP_EVT_ISR_SOTECP3F_Pos  (19UL)
#define HSP_EVT_ISR_SOTECP3F_Msk  (0x1UL << HSP_EVT_ISR_SOTECP3F_Pos)  /*!< 0x00080000 */
#define HSP_EVT_ISR_SOTECP3F      HSP_EVT_ISR_SOTECP3F_Msk             /*!< SOTECP3F (Start of task flag, for event comparator 3) */

#define HSP_EVT_ISR_EOTECP0F_Pos  (20UL)
#define HSP_EVT_ISR_EOTECP0F_Msk  (0x1UL << HSP_EVT_ISR_EOTECP0F_Pos)  /*!< 0x00100000 */
#define HSP_EVT_ISR_EOTECP0F      HSP_EVT_ISR_EOTECP0F_Msk             /*!< EOTECP0F (End of task flag, for event comparator 0) */

#define HSP_EVT_ISR_EOTECP1F_Pos  (21UL)
#define HSP_EVT_ISR_EOTECP1F_Msk  (0x1UL << HSP_EVT_ISR_EOTECP1F_Pos)  /*!< 0x00200000 */
#define HSP_EVT_ISR_EOTECP1F      HSP_EVT_ISR_EOTECP1F_Msk             /*!< EOTECP1F (End of task flag, for event comparator 1) */

#define HSP_EVT_ISR_EOTECP2F_Pos  (22UL)
#define HSP_EVT_ISR_EOTECP2F_Msk  (0x1UL << HSP_EVT_ISR_EOTECP2F_Pos)  /*!< 0x00400000 */
#define HSP_EVT_ISR_EOTECP2F      HSP_EVT_ISR_EOTECP2F_Msk             /*!< EOTECP2F (End of task flag, for event comparator 2) */

#define HSP_EVT_ISR_EOTECP3F_Pos  (23UL)
#define HSP_EVT_ISR_EOTECP3F_Msk  (0x1UL << HSP_EVT_ISR_EOTECP3F_Pos)  /*!< 0x00800000 */
#define HSP_EVT_ISR_EOTECP3F      HSP_EVT_ISR_EOTECP3F_Msk             /*!< EOTECP3F (End of task flag, for event comparator 3) */

#define HSP_EVT_ISR_TOVLPF_Pos    (28UL)
#define HSP_EVT_ISR_TOVLPF_Msk    (0x1UL << HSP_EVT_ISR_TOVLPF_Pos)    /*!< 0x10000000 */
#define HSP_EVT_ISR_TOVLPF        HSP_EVT_ISR_TOVLPF_Msk               /*!< TOVLPF (Task overlap flag) */

#define HSP_EVT_ISR_FPUSATF_Pos   (31UL)
#define HSP_EVT_ISR_FPUSATF_Msk   (0x1UL << HSP_EVT_ISR_FPUSATF_Pos)   /*!< 0x80000000 */
#define HSP_EVT_ISR_FPUSATF       HSP_EVT_ISR_FPUSATF_Msk              /*!< FPUSATF (FPU saturation flag) */

/********************  Bit definition for HSP_PFCTEVT_ISR register  ********************/
#define HSP_PFCTEVT_ISR_PFCTF_Pos (0UL)
#define HSP_PFCTEVT_ISR_PFCTF_Msk (0xFFFFFFFFUL << HSP_PFCTEVT_ISR_PFCTF_Pos) /*!< 0xFFFFFFFF */
#define HSP_PFCTEVT_ISR_PFCTF     HSP_PFCTEVT_ISR_PFCTF_Msk                   /*!< PFCTF[31:0] bits (Flags generated by SPE processing functions ) */
#define HSP_PFCTEVT_ISR_PFCTF_0   (0x00001UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000001 */
#define HSP_PFCTEVT_ISR_PFCTF_1   (0x00002UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000002 */
#define HSP_PFCTEVT_ISR_PFCTF_2   (0x00004UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000004 */
#define HSP_PFCTEVT_ISR_PFCTF_3   (0x00008UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000008 */
#define HSP_PFCTEVT_ISR_PFCTF_4   (0x00010UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000010 */
#define HSP_PFCTEVT_ISR_PFCTF_5   (0x00020UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000020 */
#define HSP_PFCTEVT_ISR_PFCTF_6   (0x00040UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000040 */
#define HSP_PFCTEVT_ISR_PFCTF_7   (0x00080UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000080 */
#define HSP_PFCTEVT_ISR_PFCTF_8   (0x00100UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000100 */
#define HSP_PFCTEVT_ISR_PFCTF_9   (0x00200UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000200 */
#define HSP_PFCTEVT_ISR_PFCTF_10  (0x00400UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000400 */
#define HSP_PFCTEVT_ISR_PFCTF_11  (0x00800UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000800 */
#define HSP_PFCTEVT_ISR_PFCTF_12  (0x01000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00001000 */
#define HSP_PFCTEVT_ISR_PFCTF_13  (0x02000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00002000 */
#define HSP_PFCTEVT_ISR_PFCTF_14  (0x04000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00004000 */
#define HSP_PFCTEVT_ISR_PFCTF_15  (0x08000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00008000 */
#define HSP_PFCTEVT_ISR_PFCTF_16  (0x10000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00010000 */
#define HSP_PFCTEVT_ISR_PFCTF_17  (0x20000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00020000 */
#define HSP_PFCTEVT_ISR_PFCTF_18  (0x40000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00040000 */
#define HSP_PFCTEVT_ISR_PFCTF_19  (0x80000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00080000 */
#define HSP_PFCTEVT_ISR_PFCTF_20  (0x100000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)   /*!< 0x00100000 */
#define HSP_PFCTEVT_ISR_PFCTF_21  (0x200000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)   /*!< 0x00200000 */
#define HSP_PFCTEVT_ISR_PFCTF_22  (0x400000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)   /*!< 0x00400000 */
#define HSP_PFCTEVT_ISR_PFCTF_23  (0x800000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)   /*!< 0x00800000 */
#define HSP_PFCTEVT_ISR_PFCTF_24  (0x1000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)  /*!< 0x01000000 */
#define HSP_PFCTEVT_ISR_PFCTF_25  (0x2000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)  /*!< 0x02000000 */
#define HSP_PFCTEVT_ISR_PFCTF_26  (0x4000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)  /*!< 0x04000000 */
#define HSP_PFCTEVT_ISR_PFCTF_27  (0x8000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)  /*!< 0x08000000 */
#define HSP_PFCTEVT_ISR_PFCTF_28  (0x10000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos) /*!< 0x10000000 */
#define HSP_PFCTEVT_ISR_PFCTF_29  (0x20000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos) /*!< 0x20000000 */
#define HSP_PFCTEVT_ISR_PFCTF_30  (0x40000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos) /*!< 0x40000000 */
#define HSP_PFCTEVT_ISR_PFCTF_31  (0x80000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_ERRINFR register  ********************/
#define HSP_ERRINFR_INEXACT_Pos (0UL)
#define HSP_ERRINFR_INEXACT_Msk (0x1UL << HSP_ERRINFR_INEXACT_Pos)   /*!< 0x00000001 */
#define HSP_ERRINFR_INEXACT     HSP_ERRINFR_INEXACT_Msk              /*!< INEXACT (INEXACT exception flag) */

#define HSP_ERRINFR_UDFLOW_Pos  (1UL)
#define HSP_ERRINFR_UDFLOW_Msk  (0x1UL << HSP_ERRINFR_UDFLOW_Pos)    /*!< 0x00000002 */
#define HSP_ERRINFR_UDFLOW      HSP_ERRINFR_UDFLOW_Msk               /*!< UDFLOW (UNDERFLOW exception flag) */

