STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
#define HSP_ERRINFR_OVFLOW_Pos  (2UL)
#define HSP_ERRINFR_OVFLOW_Msk  (0x1UL << HSP_ERRINFR_OVFLOW_Pos)    /*!< 0x00000004 */
#define HSP_ERRINFR_OVFLOW      HSP_ERRINFR_OVFLOW_Msk               /*!< OVFLOW (OVERFLOW exception flag) */

#define HSP_ERRINFR_DIVZERO_Pos (3UL)
#define HSP_ERRINFR_DIVZERO_Msk (0x1UL << HSP_ERRINFR_DIVZERO_Pos)   /*!< 0x00000008 */
#define HSP_ERRINFR_DIVZERO     HSP_ERRINFR_DIVZERO_Msk              /*!< DIVZERO (Division by zero exception flag) */

#define HSP_ERRINFR_INVALID_Pos (4UL)
#define HSP_ERRINFR_INVALID_Msk (0x1UL << HSP_ERRINFR_INVALID_Pos)   /*!< 0x00000010 */
#define HSP_ERRINFR_INVALID     HSP_ERRINFR_INVALID_Msk              /*!< INVALID (INVALID exception flag) */

#define HSP_ERRINFR_DENORM_Pos  (5UL)
#define HSP_ERRINFR_DENORM_Msk  (0x1UL << HSP_ERRINFR_DENORM_Pos)    /*!< 0x00000020 */
#define HSP_ERRINFR_DENORM      HSP_ERRINFR_DENORM_Msk               /*!< DENORM (DENORMAL exception flag) */

#define HSP_ERRINFR_CMERR_Pos   (8UL)
#define HSP_ERRINFR_CMERR_Msk   (0x1UL << HSP_ERRINFR_CMERR_Pos)     /*!< 0x00000100 */
#define HSP_ERRINFR_CMERR       HSP_ERRINFR_CMERR_Msk                /*!< CMERR (Code memory access error flag) */

#define HSP_ERRINFR_DMERR_Pos   (9UL)
#define HSP_ERRINFR_DMERR_Msk   (0x1UL << HSP_ERRINFR_DMERR_Pos)     /*!< 0x00000200 */
#define HSP_ERRINFR_DMERR       HSP_ERRINFR_DMERR_Msk                /*!< DMERR (Data memory access error flag) */

#define HSP_ERRINFR_MAHBERR_Pos (11UL)
#define HSP_ERRINFR_MAHBERR_Msk (0x1UL << HSP_ERRINFR_MAHBERR_Pos)   /*!< 0x00000800 */
#define HSP_ERRINFR_MAHBERR     HSP_ERRINFR_MAHBERR_Msk              /*!< MAHBERR (Internal AHB access error flag) */

#define HSP_ERRINFR_SAHBERR_Pos (12UL)
#define HSP_ERRINFR_SAHBERR_Msk (0x1UL << HSP_ERRINFR_SAHBERR_Pos)   /*!< 0x00001000 */
#define HSP_ERRINFR_SAHBERR     HSP_ERRINFR_SAHBERR_Msk              /*!< SAHBERR (Slave AHB access error flag) */

#define HSP_ERRINFR_TRGIERR_Pos (16UL)
#define HSP_ERRINFR_TRGIERR_Msk (0x3FFUL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x03FF0000 */
#define HSP_ERRINFR_TRGIERR     HSP_ERRINFR_TRGIERR_Msk              /*!< TRGIERR[9:0] bits (TRGIN error information) */
#define HSP_ERRINFR_TRGIERR_0   (0x001UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00010000 */
#define HSP_ERRINFR_TRGIERR_1   (0x002UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00020000 */
#define HSP_ERRINFR_TRGIERR_2   (0x004UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00040000 */
#define HSP_ERRINFR_TRGIERR_3   (0x008UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00080000 */
#define HSP_ERRINFR_TRGIERR_4   (0x010UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00100000 */
#define HSP_ERRINFR_TRGIERR_5   (0x020UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00200000 */
#define HSP_ERRINFR_TRGIERR_6   (0x040UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00400000 */
#define HSP_ERRINFR_TRGIERR_7   (0x080UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00800000 */
#define HSP_ERRINFR_TRGIERR_8   (0x100UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x01000000 */
#define HSP_ERRINFR_TRGIERR_9   (0x200UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x02000000 */

/********************  Bit definition for HSP_ERR_ICR register  ********************/
#define HSP_ERR_ICR_TRGIOVRC_Pos (8UL)
#define HSP_ERR_ICR_TRGIOVRC_Msk (0x1UL << HSP_ERR_ICR_TRGIOVRC_Pos) /*!< 0x00000100 */
#define HSP_ERR_ICR_TRGIOVRC     HSP_ERR_ICR_TRGIOVRC_Msk            /*!< TRGIOVRC (Clear TRGIOVRF flag) */

#define HSP_ERR_ICR_B0ERRC_Pos   (12UL)
#define HSP_ERR_ICR_B0ERRC_Msk   (0x1UL << HSP_ERR_ICR_B0ERRC_Pos)   /*!< 0x00001000 */
#define HSP_ERR_ICR_B0ERRC       HSP_ERR_ICR_B0ERRC_Msk              /*!< B0ERRC (Clear B0ERRF flag) */

#define HSP_ERR_ICR_B1ERRC_Pos   (13UL)
#define HSP_ERR_ICR_B1ERRC_Msk   (0x1UL << HSP_ERR_ICR_B1ERRC_Pos)   /*!< 0x00002000 */
#define HSP_ERR_ICR_B1ERRC       HSP_ERR_ICR_B1ERRC_Msk              /*!< B1ERRC (Clear B1ERRF flag) */

#define HSP_ERR_ICR_B2ERRC_Pos   (14UL)
#define HSP_ERR_ICR_B2ERRC_Msk   (0x1UL << HSP_ERR_ICR_B2ERRC_Pos)   /*!< 0x00004000 */
#define HSP_ERR_ICR_B2ERRC       HSP_ERR_ICR_B2ERRC_Msk              /*!< B2ERRC (Clear B2ERRF flag) */

#define HSP_ERR_ICR_B3ERRC_Pos   (15UL)
#define HSP_ERR_ICR_B3ERRC_Msk   (0x1UL << HSP_ERR_ICR_B3ERRC_Pos)   /*!< 0x00008000 */
#define HSP_ERR_ICR_B3ERRC       HSP_ERR_ICR_B3ERRC_Msk              /*!< B3ERRC (Clear B3ERRF flag) */

#define HSP_ERR_ICR_CAPOVRC_Pos  (16UL)
#define HSP_ERR_ICR_CAPOVRC_Msk  (0x1UL << HSP_ERR_ICR_CAPOVRC_Pos)  /*!< 0x00010000 */
#define HSP_ERR_ICR_CAPOVRC      HSP_ERR_ICR_CAPOVRC_Msk             /*!< CAPOVRC (Clear CAPOVRF flag) */

#define HSP_ERR_ICR_FWERRC_Pos   (17UL)
#define HSP_ERR_ICR_FWERRC_Msk   (0x1UL << HSP_ERR_ICR_FWERRC_Pos)   /*!< 0x00020000 */
#define HSP_ERR_ICR_FWERRC       HSP_ERR_ICR_FWERRC_Msk              /*!< FWERRC (Clear FWERRF flag) */

#define HSP_ERR_ICR_SCHERRC_Pos  (18UL)
#define HSP_ERR_ICR_SCHERRC_Msk  (0x1UL << HSP_ERR_ICR_SCHERRC_Pos)  /*!< 0x00040000 */
#define HSP_ERR_ICR_SCHERRC      HSP_ERR_ICR_SCHERRC_Msk             /*!< SCHERRC (Clear SCHERRF flag) */

#define HSP_ERR_ICR_BKINC_Pos    (19UL)
#define HSP_ERR_ICR_BKINC_Msk    (0x1UL << HSP_ERR_ICR_BKINC_Pos)    /*!< 0x00080000 */
#define HSP_ERR_ICR_BKINC        HSP_ERR_ICR_BKINC_Msk               /*!< BKINC (Clear BKINF flag) */

#define HSP_ERR_ICR_HDEGOVRC_Pos (20UL)
#define HSP_ERR_ICR_HDEGOVRC_Msk (0x1UL << HSP_ERR_ICR_HDEGOVRC_Pos) /*!< 0x00100000 */
#define HSP_ERR_ICR_HDEGOVRC     HSP_ERR_ICR_HDEGOVRC_Msk            /*!< HDEGOVRC (Clear HDEGOVRF flag) */

#define HSP_ERR_ICR_OPCOERRC_Pos (22UL)
#define HSP_ERR_ICR_OPCOERRC_Msk (0x1UL << HSP_ERR_ICR_OPCOERRC_Pos) /*!< 0x00400000 */
#define HSP_ERR_ICR_OPCOERRC     HSP_ERR_ICR_OPCOERRC_Msk            /*!< OPCOERRC (Clear OPCOERRF flag) */

#define HSP_ERR_ICR_ACCERRC_Pos  (23UL)
#define HSP_ERR_ICR_ACCERRC_Msk  (0x1UL << HSP_ERR_ICR_ACCERRC_Pos)  /*!< 0x00800000 */
#define HSP_ERR_ICR_ACCERRC      HSP_ERR_ICR_ACCERRC_Msk             /*!< ACCERRC (Clear ACCERRF flag) */

#define HSP_ERR_ICR_FPUERRC_Pos  (24UL)
#define HSP_ERR_ICR_FPUERRC_Msk  (0x1UL << HSP_ERR_ICR_FPUERRC_Pos)  /*!< 0x01000000 */
#define HSP_ERR_ICR_FPUERRC      HSP_ERR_ICR_FPUERRC_Msk             /*!< FPUERRC (Clear FPUERRF flag) */

/********************  Bit definition for HSP_EVT_ICR register  ********************/
#define HSP_EVT_ICR_H2CMRDYC_Pos  (0UL)
#define HSP_EVT_ICR_H2CMRDYC_Msk  (0x1UL << HSP_EVT_ICR_H2CMRDYC_Pos)  /*!< 0x00000001 */
#define HSP_EVT_ICR_H2CMRDYC      HSP_EVT_ICR_H2CMRDYC_Msk             /*!< H2CMRDYC (Clear H2CMRDYF flag) */

#define HSP_EVT_ICR_C2HMFREEC_Pos (1UL)
#define HSP_EVT_ICR_C2HMFREEC_Msk (0x1UL << HSP_EVT_ICR_C2HMFREEC_Pos) /*!< 0x00000002 */
#define HSP_EVT_ICR_C2HMFREEC     HSP_EVT_ICR_C2HMFREEC_Msk            /*!< C2HMFREEC (Clear C2HMFREEF flag) */

#define HSP_EVT_ICR_DCDONEC_Pos   (2UL)
#define HSP_EVT_ICR_DCDONEC_Msk   (0x1UL << HSP_EVT_ICR_DCDONEC_Pos)   /*!< 0x00000004 */
#define HSP_EVT_ICR_DCDONEC       HSP_EVT_ICR_DCDONEC_Msk              /*!< DCDONEC (Clear DCDONEF flag) */

#define HSP_EVT_ICR_CDEGRDYC_Pos  (7UL)
#define HSP_EVT_ICR_CDEGRDYC_Msk  (0x1UL << HSP_EVT_ICR_CDEGRDYC_Pos)  /*!< 0x00000080 */
#define HSP_EVT_ICR_CDEGRDYC      HSP_EVT_ICR_CDEGRDYC_Msk             /*!< CDEGRDYC (Clear of CDEGRDYF flag) */

#define HSP_EVT_ICR_SOFWFEC_Pos   (8UL)
#define HSP_EVT_ICR_SOFWFEC_Msk   (0x1UL << HSP_EVT_ICR_SOFWFEC_Pos)   /*!< 0x00000100 */
#define HSP_EVT_ICR_SOFWFEC       HSP_EVT_ICR_SOFWFEC_Msk              /*!< SOFWFEC (Clear of SOFWFEF flag) */

#define HSP_EVT_ICR_EOFWFEC_Pos   (9UL)
#define HSP_EVT_ICR_EOFWFEC_Msk   (0x1UL << HSP_EVT_ICR_EOFWFEC_Pos)   /*!< 0x00000200 */
#define HSP_EVT_ICR_EOFWFEC       HSP_EVT_ICR_EOFWFEC_Msk              /*!< EOFWFEC (Clear of EOFWFEF flag) */

#define HSP_EVT_ICR_SOTECP0C_Pos  (16UL)
#define HSP_EVT_ICR_SOTECP0C_Msk  (0x1UL << HSP_EVT_ICR_SOTECP0C_Pos)  /*!< 0x00010000 */
#define HSP_EVT_ICR_SOTECP0C      HSP_EVT_ICR_SOTECP0C_Msk             /*!< SOTECP0C (Clear SOTECP0F flag) */

#define HSP_EVT_ICR_SOTECP1C_Pos  (17UL)
#define HSP_EVT_ICR_SOTECP1C_Msk  (0x1UL << HSP_EVT_ICR_SOTECP1C_Pos)  /*!< 0x00020000 */
#define HSP_EVT_ICR_SOTECP1C      HSP_EVT_ICR_SOTECP1C_Msk             /*!< SOTECP1C (Clear SOTECP1F flag) */

#define HSP_EVT_ICR_SOTECP2C_Pos  (18UL)
#define HSP_EVT_ICR_SOTECP2C_Msk  (0x1UL << HSP_EVT_ICR_SOTECP2C_Pos)  /*!< 0x00040000 */
#define HSP_EVT_ICR_SOTECP2C      HSP_EVT_ICR_SOTECP2C_Msk             /*!< SOTECP2C (Clear SOTECP2F flag) */

