STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
#define HSP_EVT_ICR_SOTECP3C_Pos  (19UL)
#define HSP_EVT_ICR_SOTECP3C_Msk  (0x1UL << HSP_EVT_ICR_SOTECP3C_Pos)  /*!< 0x00080000 */
#define HSP_EVT_ICR_SOTECP3C      HSP_EVT_ICR_SOTECP3C_Msk             /*!< SOTECP3C (Clear SOTECP3F flag) */

#define HSP_EVT_ICR_EOTECP0C_Pos  (20UL)
#define HSP_EVT_ICR_EOTECP0C_Msk  (0x1UL << HSP_EVT_ICR_EOTECP0C_Pos)  /*!< 0x00100000 */
#define HSP_EVT_ICR_EOTECP0C      HSP_EVT_ICR_EOTECP0C_Msk             /*!< EOTECP0C (Clear EOTECP0F flag) */

#define HSP_EVT_ICR_EOTECP1C_Pos  (21UL)
#define HSP_EVT_ICR_EOTECP1C_Msk  (0x1UL << HSP_EVT_ICR_EOTECP1C_Pos)  /*!< 0x00200000 */
#define HSP_EVT_ICR_EOTECP1C      HSP_EVT_ICR_EOTECP1C_Msk             /*!< EOTECP1C (Clear EOTECP1F flag) */

#define HSP_EVT_ICR_EOTECP2C_Pos  (22UL)
#define HSP_EVT_ICR_EOTECP2C_Msk  (0x1UL << HSP_EVT_ICR_EOTECP2C_Pos)  /*!< 0x00400000 */
#define HSP_EVT_ICR_EOTECP2C      HSP_EVT_ICR_EOTECP2C_Msk             /*!< EOTECP2C (Clear EOTECP2F flag) */

#define HSP_EVT_ICR_EOTECP3C_Pos  (23UL)
#define HSP_EVT_ICR_EOTECP3C_Msk  (0x1UL << HSP_EVT_ICR_EOTECP3C_Pos)  /*!< 0x00800000 */
#define HSP_EVT_ICR_EOTECP3C      HSP_EVT_ICR_EOTECP3C_Msk             /*!< EOTECP3C (Clear EOTECP3F flag) */

#define HSP_EVT_ICR_TOVLPC_Pos    (28UL)
#define HSP_EVT_ICR_TOVLPC_Msk    (0x1UL << HSP_EVT_ICR_TOVLPC_Pos)    /*!< 0x10000000 */
#define HSP_EVT_ICR_TOVLPC        HSP_EVT_ICR_TOVLPC_Msk               /*!< TOVLPC (Clear TOVLPF flag) */

#define HSP_EVT_ICR_FPUSATC_Pos   (31UL)
#define HSP_EVT_ICR_FPUSATC_Msk   (0x1UL << HSP_EVT_ICR_FPUSATC_Pos)   /*!< 0x80000000 */
#define HSP_EVT_ICR_FPUSATC       HSP_EVT_ICR_FPUSATC_Msk              /*!< FPUSATC (Clear FPUSATF flag) */

/********************  Bit definition for HSP_PFCTEVT_ICR register  ********************/
#define HSP_PFCTEVT_ICR_PFCTC_Pos (0UL)
#define HSP_PFCTEVT_ICR_PFCTC_Msk (0xFFFFFFFFUL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0xFFFFFFFF */
#define HSP_PFCTEVT_ICR_PFCTC     HSP_PFCTEVT_ICR_PFCTC_Msk                   /*!< PFCTC[31:0] bits (Clear PFCTF[31:0] flag) */
#define HSP_PFCTEVT_ICR_PFCTC_0   (0x00001UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000001 */
#define HSP_PFCTEVT_ICR_PFCTC_1   (0x00002UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000002 */
#define HSP_PFCTEVT_ICR_PFCTC_2   (0x00004UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000004 */
#define HSP_PFCTEVT_ICR_PFCTC_3   (0x00008UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000008 */
#define HSP_PFCTEVT_ICR_PFCTC_4   (0x00010UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000010 */
#define HSP_PFCTEVT_ICR_PFCTC_5   (0x00020UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000020 */
#define HSP_PFCTEVT_ICR_PFCTC_6   (0x00040UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000040 */
#define HSP_PFCTEVT_ICR_PFCTC_7   (0x00080UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000080 */
#define HSP_PFCTEVT_ICR_PFCTC_8   (0x00100UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000100 */
#define HSP_PFCTEVT_ICR_PFCTC_9   (0x00200UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000200 */
#define HSP_PFCTEVT_ICR_PFCTC_10  (0x00400UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000400 */
#define HSP_PFCTEVT_ICR_PFCTC_11  (0x00800UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000800 */
#define HSP_PFCTEVT_ICR_PFCTC_12  (0x01000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00001000 */
#define HSP_PFCTEVT_ICR_PFCTC_13  (0x02000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00002000 */
#define HSP_PFCTEVT_ICR_PFCTC_14  (0x04000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00004000 */
#define HSP_PFCTEVT_ICR_PFCTC_15  (0x08000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00008000 */
#define HSP_PFCTEVT_ICR_PFCTC_16  (0x10000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00010000 */
#define HSP_PFCTEVT_ICR_PFCTC_17  (0x20000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00020000 */
#define HSP_PFCTEVT_ICR_PFCTC_18  (0x40000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00040000 */
#define HSP_PFCTEVT_ICR_PFCTC_19  (0x80000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00080000 */
#define HSP_PFCTEVT_ICR_PFCTC_20  (0x100000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)   /*!< 0x00100000 */
#define HSP_PFCTEVT_ICR_PFCTC_21  (0x200000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)   /*!< 0x00200000 */
#define HSP_PFCTEVT_ICR_PFCTC_22  (0x400000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)   /*!< 0x00400000 */
#define HSP_PFCTEVT_ICR_PFCTC_23  (0x800000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)   /*!< 0x00800000 */
#define HSP_PFCTEVT_ICR_PFCTC_24  (0x1000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)  /*!< 0x01000000 */
#define HSP_PFCTEVT_ICR_PFCTC_25  (0x2000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)  /*!< 0x02000000 */
#define HSP_PFCTEVT_ICR_PFCTC_26  (0x4000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)  /*!< 0x04000000 */
#define HSP_PFCTEVT_ICR_PFCTC_27  (0x8000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)  /*!< 0x08000000 */
#define HSP_PFCTEVT_ICR_PFCTC_28  (0x10000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0x10000000 */
#define HSP_PFCTEVT_ICR_PFCTC_29  (0x20000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0x20000000 */
#define HSP_PFCTEVT_ICR_PFCTC_30  (0x40000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0x40000000 */
#define HSP_PFCTEVT_ICR_PFCTC_31  (0x80000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_FWVERR register  ********************/
#define HSP_FWVERR_CRAMINREV_Pos (0UL)
#define HSP_FWVERR_CRAMINREV_Msk (0xFFUL << HSP_FWVERR_CRAMINREV_Pos) /*!< 0x000000FF */
#define HSP_FWVERR_CRAMINREV     HSP_FWVERR_CRAMINREV_Msk             /*!< CRAMINREV[7:0] bits (Code RAM Minor revision) */

#define HSP_FWVERR_CRAMAJREV_Pos (8UL)
#define HSP_FWVERR_CRAMAJREV_Msk (0xFUL << HSP_FWVERR_CRAMAJREV_Pos)  /*!< 0x00000F00 */
#define HSP_FWVERR_CRAMAJREV     HSP_FWVERR_CRAMAJREV_Msk             /*!< CRAMAJREV[3:0] bits (Code RAM Major revision) */

#define HSP_FWVERR_CROMINREV_Pos (12UL)
#define HSP_FWVERR_CROMINREV_Msk (0xFFUL << HSP_FWVERR_CROMINREV_Pos)  /*!< 0x000FF000 */
#define HSP_FWVERR_CROMINREV     HSP_FWVERR_CROMINREV_Msk             /*!< CROMINREV[7:0] bits (Code ROM Minor revision) */

#define HSP_FWVERR_CROMAJREV_Pos (20UL)
#define HSP_FWVERR_CROMAJREV_Msk (0xFUL << HSP_FWVERR_CROMAJREV_Pos)  /*!< 0x000F0000 */
#define HSP_FWVERR_CROMAJREV     HSP_FWVERR_CROMAJREV_Msk             /*!< CROMAJREV[3:0] bits (Code ROM Major revision) */

#define HSP_FWVERR_DROMINREV_Pos (24UL)
#define HSP_FWVERR_DROMINREV_Msk (0xFUL << HSP_FWVERR_DROMINREV_Pos)  /*!< 0x00F00000 */
#define HSP_FWVERR_DROMINREV     HSP_FWVERR_DROMINREV_Msk             /*!< DROMINREV[3:0] bits (Data ROM Minor revision) */

#define HSP_FWVERR_DROMAJREV_Pos (28UL)
#define HSP_FWVERR_DROMAJREV_Msk (0xFUL << HSP_FWVERR_DROMAJREV_Pos)  /*!< 0x0F000000 */
#define HSP_FWVERR_DROMAJREV     HSP_FWVERR_DROMAJREV_Msk             /*!< DROMAJREV[3:0] bits (Data ROM Major revision) */

