STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
/******************************* HASH Instances ********************************/
#define IS_HASH_ALL_INSTANCE(INSTANCE) ((INSTANCE) == HASH_NS)

#if $U3_2M$ || $U3_1M5$
/******************************* HSP Instances ********************************/
#define IS_HSP_ALL_INSTANCE(INSTANCE) ((INSTANCE) == HSP1_NS)

#endif /* $U3_2M$ || $U3_1M5$ */
#if !$U3_512K$
/******************************** FDCAN Instances *****************************/
#if $U3_2M$
#define IS_FDCAN_ALL_INSTANCE(INSTANCE) (((INSTANCE) == FDCAN1_NS) || ((INSTANCE) == FDCAN2_NS))
#else
#define IS_FDCAN_ALL_INSTANCE(INSTANCE) ((INSTANCE) == FDCAN1_NS)
#endif

#endif /* !$U3_512K$ */
/******************************** COMP Instances ******************************/
#define IS_COMP_ALL_INSTANCE(INSTANCE) (((INSTANCE) == COMP1_NS) || ((INSTANCE) == COMP2_NS))

/******************** COMP Instances with window mode capability **************/
#define IS_COMP_WINDOWMODE_INSTANCE(INSTANCE) (((INSTANCE) == COMP1_NS) || ((INSTANCE) == COMP2_NS))

/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == CRC_NS))

/******************************* DAC Instances ********************************/
#define IS_DAC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DAC1_NS)

/******************************* DELAYBLOCK Instances *************************/
#if $U3_512K$ || $U3_256K$
#define IS_DLYB_ALL_INSTANCE(INSTANCE)  (((INSTANCE) == DLYB_OCTOSPI1_NS))
#else /* $U3_512K$ */
#define IS_DLYB_ALL_INSTANCE(INSTANCE)  (((INSTANCE) == DLYB_SDMMC1_NS)   || \
                                         ((INSTANCE) == DLYB_OCTOSPI1_NS))
#endif /* $U3_512K$ || $U3_256K$*/

/******************************** DMA Instances *******************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPDMA1_Channel0_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel1_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel2_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel3_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel4_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel5_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel6_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel7_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel8_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel9_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel10_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel11_NS))

#define IS_GPDMA_INSTANCE(INSTANCE)   (((INSTANCE) == GPDMA1_Channel0_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel1_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel2_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel3_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel4_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel5_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel6_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel7_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel8_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel9_NS)  || \
                                       ((INSTANCE) == GPDMA1_Channel10_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel11_NS))

#define IS_DMA_2D_ADDRESSING_INSTANCE(INSTANCE) (((INSTANCE) == GPDMA1_Channel10_NS)  || \
                                                 ((INSTANCE) == GPDMA1_Channel11_NS))

#define IS_DMA_PFREQ_INSTANCE(INSTANCE) (((INSTANCE) == GPDMA1_Channel0_NS)  || \
                                         ((INSTANCE) == GPDMA1_Channel1_NS))

/******************************* GPIO Instances *******************************/
#if $U3_512K$
#define IS_GPIO_ALL_INSTANCE(INSTANCE)      (((INSTANCE) == GPIOA_NS) || ((INSTANCE) == GPIOB_NS) || \
                                             ((INSTANCE) == GPIOC_NS) || ((INSTANCE) == GPIOD_NS) || \
                                             ((INSTANCE) == GPIOE_NS) || ((INSTANCE) == GPIOH_NS))
#elif $U3_2M$ || $U3_1M5$
#define IS_GPIO_ALL_INSTANCE(INSTANCE)      (((INSTANCE) == GPIOA_NS) || ((INSTANCE) == GPIOB_NS) || \
                                             ((INSTANCE) == GPIOC_NS) || ((INSTANCE) == GPIOD_NS) || \
                                             ((INSTANCE) == GPIOE_NS) || ((INSTANCE) == GPIOF_NS) || \
                                             ((INSTANCE) == GPIOG_NS) || ((INSTANCE) == GPIOH_NS))
#elif $U3_256K$
#define IS_GPIO_ALL_INSTANCE(INSTANCE)      (((INSTANCE) == GPIOA_NS) || ((INSTANCE) == GPIOB_NS) || \
                                             ((INSTANCE) == GPIOC_NS) || ((INSTANCE) == GPIOD_NS) || \
                                             ((INSTANCE) == GPIOH_NS))
#else
#define IS_GPIO_ALL_INSTANCE(INSTANCE)      (((INSTANCE) == GPIOA_NS) || ((INSTANCE) == GPIOB_NS) || \
                                             ((INSTANCE) == GPIOC_NS) || ((INSTANCE) == GPIOD_NS) || \
                                             ((INSTANCE) == GPIOE_NS) || ((INSTANCE) == GPIOG_NS) || \
                                             ((INSTANCE) == GPIOH_NS))
#endif /* $U3_512K$ */

  /******************************* GPIO AF Instances ****************************/
  /* On U3, all GPIO Bank support AF */
#define IS_GPIO_AF_INSTANCE(INSTANCE)       IS_GPIO_ALL_INSTANCE(INSTANCE)

  /**************************** GPIO Lock Instances *****************************/
  /* On U3, all GPIO Bank support the Lock mechanism */
#define IS_GPIO_LOCK_INSTANCE(INSTANCE)     IS_GPIO_ALL_INSTANCE(INSTANCE)

/******************************** I2C Instances *******************************/
#if $U3_512K$ || $U3_256K$
#define IS_I2C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_NS) || \
                                       ((INSTANCE) == I2C3_NS))
#elif $U3_2M$
#define IS_I2C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_NS) || \
                                       ((INSTANCE) == I2C2_NS) || \
                                       ((INSTANCE) == I2C3_NS) || \
                                       ((INSTANCE) == I2C4_NS))
#else
#define IS_I2C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_NS) || \
                                       ((INSTANCE) == I2C2_NS) || \
                                       ((INSTANCE) == I2C3_NS))
#endif /* $U3_512K$ && $U3_256K$ */

/****************** I2C Instances : wakeup capability from stop modes *********/
#define IS_I2C_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) IS_I2C_ALL_INSTANCE(INSTANCE)

/******************* I2C Instances : Group belongingness *********************/
#if $U3_512K$ || $U3_256K$
#define IS_I2C_GRP1_INSTANCE(INSTANCE) ((INSTANCE) == I2C1_NS)
#elif $U3_2M$
#define IS_I2C_GRP1_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_NS) || \
                                        ((INSTANCE) == I2C2_NS) || \
                                        ((INSTANCE) == I2C4_NS))
#else /* $U3_512K$ */
#define IS_I2C_GRP1_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_NS) || \
                                        ((INSTANCE) == I2C2_NS))
#endif /* $U3_512K$ || $U3_256K$ */

