STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3xxxxx.h
#define IS_I2C_GRP2_INSTANCE(INSTANCE) ((INSTANCE) == I2C3_NS)

/******************************** I3C Instances *******************************/
#if $U3_512K$ || $U3_256K$
#define IS_I3C_ALL_INSTANCE(INSTANCE) ((INSTANCE) == I3C1_NS)
#else /* $U3_512K$ */
#define IS_I3C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I3C1_NS) || \
                                       ((INSTANCE) == I3C2_NS))
#endif /* $U3_512K$ || $U3_256K$*/

/******************* I3C Instances : Group belongingness *********************/
#if $U3_512K$ || $U3_256K$
#define IS_I3C_GRP1_INSTANCE(INSTANCE) ((INSTANCE) == I3C1_NS)
#else /* $U3_512K$ */
#define IS_I3C_GRP1_INSTANCE(INSTANCE) (((INSTANCE) == I3C1_NS) || \
                                        ((INSTANCE) == I3C2_NS))
#endif /* $U3_512K$ || $U3_256K$*/

/****************************** OPAMP Instances *******************************/
#define IS_OPAMP_ALL_INSTANCE(INSTANCE) (((INSTANCE) == OPAMP1_NS) || ((INSTANCE) == OPAMP2_NS))

/******************************* OSPI Instances *******************************/
#define IS_OSPI_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == OCTOSPI1_NS)

/****************************** RAMCFG Instances ********************************/
#if $U3_2M$ || $U3_1M5$
#define IS_RAMCFG_ALL_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_SRAM1_NS) || \
                                          ((INSTANCE) == RAMCFG_SRAM2_NS) || \
                                          ((INSTANCE) == RAMCFG_SRAM3_NS))
#else
#define IS_RAMCFG_ALL_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_SRAM1_NS) || \
                                          ((INSTANCE) == RAMCFG_SRAM2_NS))
#endif /* $U3_2M$ */

/***************************** RAMCFG PED Instances *****************************/
#if $U3_2M$ || $U3_1M5$
#define IS_RAMCFG_PED_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_SRAM2_NS)  || \
                                          ((INSTANCE) == RAMCFG_SRAM3_NS))
#else
#define IS_RAMCFG_PED_INSTANCE(INSTANCE) ((INSTANCE) == RAMCFG_SRAM2_NS)
#endif /* $U3_2M$ */

/***************************** RAMCFG IT Instances ******************************/
#if $U3_2M$ || $U3_1M5$
#define IS_RAMCFG_IT_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_SRAM2_NS)   || \
                                         ((INSTANCE) == RAMCFG_SRAM3_NS))
#else
#define IS_RAMCFG_IT_INSTANCE(INSTANCE) ((INSTANCE) == RAMCFG_SRAM2_NS)
#endif /* $U3_2M$ */

/************************ RAMCFG Write Protection Instances *********************/
#define IS_RAMCFG_WP_INSTANCE(INSTANCE) ((INSTANCE) == RAMCFG_SRAM2_NS)

/************************ RAMCFG Erase Instances ********************************/
#if $U3_2M$ || $U3_1M5$
#define IS_RAMCFG_ER_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_SRAM1_NS)  || \
                                         ((INSTANCE) == RAMCFG_SRAM2_NS)  || \
                                         ((INSTANCE) == RAMCFG_SRAM3_NS))
#else
#define IS_RAMCFG_ER_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_SRAM1_NS)  || \
                                         ((INSTANCE) == RAMCFG_SRAM2_NS))
#endif /* $U3_2M$ || $U3_1M5$ */

/******************************* RNG Instances ********************************/
#define IS_RNG_ALL_INSTANCE(INSTANCE)  (((INSTANCE) == RNG_NS))

/****************************** RTC Instances *********************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == RTC_NS))

#if !$U3_512K$ && !$U3_256K$
/******************************** SAI Instances *******************************/
#define IS_SAI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SAI1_Block_A_NS) || ((INSTANCE) == SAI1_Block_B_NS))
#endif /* !$U3_512K$ && !$U3_256K$*/

#if !$U3_512K$ && !$U3_256K$
/****************************** SDMMC Instances *******************************/
#define IS_SDMMC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SDMMC1_NS))
#endif /* $U3_512K$ && !$U3_256K$*/

/****************************** SMBUS Instances *******************************/
#if !$U3_512K$ && !$U3_256K$
#define IS_SMBUS_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_NS) || \
                                         ((INSTANCE) == I2C2_NS) || \
                                         ((INSTANCE) == I2C3_NS))
#else
#define IS_SMBUS_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_NS) || \
                                         ((INSTANCE) == I2C3_NS))
#endif /* !$U3_512K$ && !$U3_256K$ */

/******************* SMBUS Instances : Group belongingness *********************/
#if !$U3_512K$ && !$U3_256K$
#define IS_SMBUS_GRP1_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_NS) || \
                                          ((INSTANCE) == I2C2_NS))
#else
#define IS_SMBUS_GRP1_INSTANCE(INSTANCE) ((INSTANCE) == I2C1_NS)
#endif /* !$U3_512K$ */

#define IS_SMBUS_GRP2_INSTANCE(INSTANCE) ((INSTANCE) == I2C3_NS)

/******************************** SPI Instances *******************************/
#if !$U3_256K$ && !$U3_2M$
#define IS_SPI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_NS) || \
                                       ((INSTANCE) == SPI2_NS) || \
                                       ((INSTANCE) == SPI3_NS))

#define IS_SPI_LIMITED_INSTANCE(INSTANCE) ((INSTANCE) == SPI3_NS)
#elif $U3_2M$
#define IS_SPI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_NS) || \
                                       ((INSTANCE) == SPI2_NS) || \
                                       ((INSTANCE) == SPI3_NS) || \
                                       ((INSTANCE) == SPI4_NS))

#define IS_SPI_LIMITED_INSTANCE(INSTANCE) (((INSTANCE) == SPI3_NS) || \
                                           ((INSTANCE) == SPI4_NS))
#else /*!$U3_256K$*/
#define IS_SPI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_NS) || \
                                       ((INSTANCE) == SPI2_NS))
#endif /*!$U3_256K$*/

#define IS_SPI_FULL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_NS) || \
                                        ((INSTANCE) == SPI2_NS))

/******************* SPI Instances : Group belongingness *********************/
#define IS_SPI_GRP1_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_NS) || \
                                        ((INSTANCE) == SPI2_NS))

